var threadContentData = [{"post":[{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":1,"time":"Fri 11 June 2010 02:46 AM","content":" Bill includes amendment to allow abortions at overseas bases   WASHINGTON   A Senate provision to allow abortions at overseas military bases could set up an election year fight between abortion rights supporters and conservative lawmakers who have thwarted the measure for years.  Senate Republicans threatened to block the full defense authorization bill when it comes up for a vote later this month after the abortion provision was attached in the chamber s Armed Services Committee mark-up.  Under the amendment, female servicemembers and military dependents stationed overseas would have access to abortions, provided they pay for the procedure themselves and medical personnel on base are willing to perform it. No military doctors would be required to perform abortions if they object to the practice.  In a statement, amendment sponsor Sen. Roland Burris, D-Ill., framed the issue as one of basic fairness for the tens of thousands of female troops and family members stationed outside the United States.   It is critical that we provide the highest quality care for our service members while they are serving our nation overseas, and that includes allowing women and their families the right to choose at facilities operated under the Department of Defense,  he said.  Under current law, physicians at overseas bases can perform abortions only when the mother s life is in danger, or in cases of rape or incest. In the latter two, women still must pay for the procedure themselves.  In recent years, similar proposals to allow overseas abortions have been offered in the House and Senate as part of the annual budget bills, but failed before they could become law. The issue was not broached in the House this year, and House Armed Services Committee Chairman Ike Skelton, D-Mo., restated his public opposition to a change in the policy.  The American Civil Liberties Union and NARAL Pro-Choice America both backed Burris  plan. In a statement earlier this month, Sen. Roger Wicker, R-Miss., called the abortion amendment  a moral failure of this Congress  and promised to fight to remove the provision.   Since the mid-1990s, attempts to change this law have been rejected repeatedly,  he said.  Regardless of their views on whether abortion is ever justified, the vast majority of Americans agree that taxpayer dollars should not subsidize such controversial procedures.   Both the House and Senate versions of the defense authorization bill already include repeal language for the military s  don t ask, don t tell  law, a controversial move that Republicans in both chambers predicted could jeopardize passage of the final bill. Twenty-six House Democrats voted against the  don t ask, don t tell  provision, but the full measure passed by a 229-186 margin.  The Senate is expected to vote later this month on the authorization bill, which includes the abortion provision, and a conference committee will work on differences between the House and Senate versions throughout the summer.  From The Stars and Stripes ","user_id":"IHAWKER","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":2,"time":"Fri 11 June 2010 07:55 AM","content":" Roger Wicker of Mississippi...now there&apos;s a surprise...  Third highest in the nation in pregnancies among 15-19 year olds...highest in the nation in live births among 15-19 year olds...and dead last in the nation in median household income---ten percent below the next state.  I guess you just can&apos;t buy morality.","user_id":"Yooper_tj","fromReply":[25],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":3,"time":"Fri 11 June 2010 11:32 AM","content":"It&apos;s about damned time!  Why do military women serving overseas have to be subjected to second-class (or lower) health care than their civilian counterparts in the US?  I think it&apos;s offensive that they would have to pay for it themselves to begin with.  I agree that providers (doctors, nurse) should have the option to refuse to perform an abortion if they object, but the women themselves have absolutely every right to all the healthcare benefits available to their civilian counterparts in CONUS! ","user_id":"Cider33_Alpha","fromReply":[7,11,14,37,38],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":4,"time":"Fri 11 June 2010 12:31 PM","content":"Cider, I fully agree. ","user_id":"IHAWKER","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":5,"time":"Fri 11 June 2010 02:35 PM","content":"Oh yes, the liberals celebrate killing the innocent unborn while they fight tooth and nail for the trash on death row.  And the seals.    Humans, no.    Sickening!!  GARBAGE!","user_id":"PinkBlossoms","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":6,"time":"Fri 11 June 2010 03:13 PM","content":"Don&apos;t ASSUME, PB.  You should know by now my positions on this and some other hot-button issues, including the death penalty (FYI: PRO).  Those of us who are pro-choice when it comes to an individual woman&apos;s right to choose what is done to HER body are not necessarily for or against other positions held so holy to the Right side of the American political spectrum. ","user_id":"Cider33_Alpha","fromReply":[7,11,14,37,38],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":7,"time":"Fri 11 June 2010 03:22 PM","content":"REPLYING TO Cider33_Alpha WHO SAID: <u>\" Don&apos;t ASSUME, PB.  You should know by now my positions on this and some other hot-button issues, including the death penalty (FYI: PRO).  Those of us who are pro-choice when it comes to an individual woman&apos;s right to choose what is done to HER body are not necessarily for or against other positions held so holy to the Right side of the American political spectrum.\"</u>  I agree - I&apos;m pro-choice, but my problems with the death penalty are related to process (time until execution, scrutiny of evidence, etc.) rather than the concept itself.  If anything, I think the death penalty is UNDERused. ","user_id":"cosmicfish","fromReply":[],"toReply":[3,6]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":8,"time":"Fri 11 June 2010 03:30 PM","content":"Once they \"de-sex\" the military & commence strict enforcement of the new strigent regs, any female finding herself knocked up after being confined to a military base may find herself under charges. ","user_id":"GunnyZak","fromReply":[13,27,29,32,39,40,44,47],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":9,"time":"Fri 11 June 2010 03:49 PM","content":"Please (oh God, PLEASE) define \"desex.\"  And what are these new \"stringent regs\" to which you refer?  Inquiring minds want and need to know! ","user_id":"Cider33_Alpha","fromReply":[11,14,37,38],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":10,"time":"Fri 11 June 2010 04:03 PM","content":"  Hmm, that just may   off her husband that is serving on the same base.....     The particular proposal I think you are referring to was pulled off the table right after it was suggested. ","user_id":"Ex_CG_GM","fromReply":[12,43],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":11,"time":"Fri 11 June 2010 04:12 PM","content":"REPLYING TO Cider33_Alpha WHO SAID: <u>\" Please (oh God, PLEASE) define \"desex.\"  And what are these new \"stringent regs\" to which you refer?  Inquiring minds want and need to know!\"</u>   I&apos;m sure you&apos;re not that much of a geritol you can&apos;t figure it out. Think way back to all those officer romps in the BOQ&apos;s. ","user_id":"GunnyZak","fromReply":[13,27,29,32,39,40,44,47],"toReply":[3,6,9]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":12,"time":"Fri 11 June 2010 04:16 PM","content":"REPLYING TO Ex_CG_GM WHO SAID: <u>\"   Hmm, that just may   off her husband that is serving on the same base.....     The particular proposal I think you are referring to was pulled off the table right after it was suggested.\"</u>   Not a proposal yet that I know of. I&apos;m referring to implementation of repeal which will foster stricter sexual conduct regs to maintain good order & discipline. ","user_id":"GunnyZak","fromReply":[13,27,29,32,39,40,44,47],"toReply":[10]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":13,"time":"Fri 11 June 2010 04:21 PM","content":"REPLYING TO GunnyZak WHO SAID: <u>\"  sexual conduct regs to maintain good order & discipline.\"</u>   Ya got to be joking Gunny, did you forget that Congress just repealed DADT? ","user_id":"SignalSgtWilliams","fromReply":[],"toReply":[8,11,12]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":14,"time":"Fri 11 June 2010 08:23 PM","content":"REPLYING TO Cider33_Alpha WHO SAID: <u>\" Don&apos;t ASSUME, PB.  You should know by now my positions on this and some other hot-button issues, including the death penalty (FYI: PRO).  Those of us who are pro-choice when it comes to an individual woman&apos;s right to choose what is done to HER body are not necessarily for or against other positions held so holy to the Right side of the American political spectrum.\"</u>   Cider, there&apos;s no way to sugar coat killing the most innocent among us.    As for knowing your stance on this issue, no I didn&apos;t ... but this thread speaks it loud and clear.","user_id":"PinkBlossoms","fromReply":[],"toReply":[3,6,9]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":15,"time":"Sat 12 June 2010 12:09 AM","content":"I might as well throw in my two cents:  Last week I reconnected Mary   with a lady who was in first grade with me, way back in 1943.  Our mothers worked together in the school cafeteria.   Her two older sisters were the same age as my two older brothers.  The families were good friends.   We have not seen each other in sixty  years.  Now she lives in Tenseness about two miles from our youngest daughter and family.     But, the one thing that is locked in both of our memories from first grade is the day we were told that her 14 year old sister, Margret   died.    Margret died because she was pregnant and her mother tried to abort the baby with a coat hanger or some other such method.  What a horrible way for anyone to die.  We all believed that it was incest.  There were never any charges against her mother.  It was just the way things were done in those days.      Yes, we had a home for unwed mothers,  The Florence Crittenton Home.   But, the shame that families felt in those days was enormous and almost unbearable.      I m unashamedly  prolife  - I believe that life begins at conception.  In Margret s case we lost both the young mother and the unborn baby.   I m confident that everyone wishes there would never be another abortion.  But, we can not go back to the days of the  coat hanger abortions.    Personal notes:  We are thankful that we could not have gotten an abortion in 1971 while stationed in Kinzening Germany. I think we what have jumped at the opportunity.  My wife was not well and it was a tough permanency.  But, we would have missed having one of the greatest young men God very created, our youngest Timothy Robert John Love now 38. He has been married for 16 years to a wonderful wife and they have two terrific young children, our Caleb and Abbey.   Also our oldest granddaughter most likely would have been aborted if it was possible.  She is the apple of her mom and dad and grandparent eyes.    To paraphrase Patrick Henry, I say, I know not what others may choose but, as for me, give me a country where abortions of any type is not necessary or wanted.  Until then lets may it a last, but a very safe choice of the mother.   I just don t know how to make a no abortion  deportation  rule work. ","user_id":"OldArmyLove","fromReply":[21],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":16,"time":"Sat 12 June 2010 06:43 AM","content":"Well said OldArmyLove.         Abortions should be safe, legal and RARE.","user_id":"SeaWitch1220","fromReply":[19],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":17,"time":"Sat 12 June 2010 09:21 AM","content":"Nicely expressed OAL.  Sea, that line would make a great bumper sticker, can I have your permission to us it if I ever feel the need to express my view on the matter with plastic glued on my truck? ","user_id":"MM2_ss_Lewis","fromReply":[33],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":18,"time":"Sat 12 June 2010 10:02 AM","content":"How does that work if abortion in the foreign host nation is illegal ? ","user_id":"ScotsVisitor","fromReply":[23],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":19,"time":"Sat 12 June 2010 10:04 AM","content":"REPLYING TO SeaWitch1220 WHO SAID: <u>\" Well said OldArmyLove.         Abortions should be safe, legal and RARE.\"</u>   The only possible way this can happen is for all of us to take a serious look at how we are politicizing educating today&apos;s youth in regards to sexual conduct.  Focusing on only teaching abstinence in public schools is a totally naive and stupid concept.  Teach all aspects of sex, not just abstinence.  Teens are going to explore, they will engage in all forms of sex, and they are being put in serious jepardy by not being informed about the consequences of STD and unwanted pregnancies.  Provide real information on birth control methods.  Provide condoms without question or restriction; provide meaningful guidance information on oral birth control contraceptives, and start it early.  Social conservatives are demanding that sex education be sanitized and want it to be a family issue alone.  Sure, the parents SHOULD be the ones responsible to do this, but the cold hard fact is that they are NOT doing it. Then what? Every year, younger children are engaging in risky sexual activities and suffer emotional trauma, sexually transmitted diseases that are increasingly difficult to treat and cure, and babies are having babies.   Teach them, provide them with information and hope they make a good choice...but never forget that they will engage in sexual activities and if we don&apos;t understand and accept that fact, and depoliticize it, then nothing will change... ","user_id":"skinman13","fromReply":[20,26,34,41,49,50],"toReply":[16]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":20,"time":"Sat 12 June 2010 10:49 AM","content":"REPLYING TO skinman13 WHO SAID: <u>\"  The only possible way this can happen is for all of us to take a serious look at how we are politicizing educating today&apos;s youth in regards to sexual conduct.  Focusing on only teaching abstinence in public schools is a totally naive and stupid concept.  Teach all aspects of sex, not just abstinence.  Teens are going to explore, they will engage in all forms of sex, and they are being put in serious jepardy by not being informed about the consequences of STD and unwanted pregnancies.  Provide real information on birth control methods.  Provide condoms without question or restriction; provide meaningful guidance information on oral birth control contraceptives, and start it early.  Social conservatives are demanding that sex education be sanitized and want it to be a family issue alone.  Sure, the parents SHOULD be the ones responsible to do this, but the cold hard fact is that they are NOT doing it. Then what? Every year, younger children are engaging in risky sexual activities and suffer emotional trauma, sexually transmitted diseases that are increasingly difficult to treat and cure, and babies are having babies.   Teach them, provide them with information and hope they make a good choice...but never forget that they will engage in sexual activities and if we don&apos;t understand and accept that fact, and depoliticize it, then nothing will change...\"</u>        That is a very intelligent and comprehensive approach to the problem and all you have said is how it should be IMO. ","user_id":"IHAWKER","fromReply":[],"toReply":[19]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":21,"time":"Sat 12 June 2010 02:01 PM","content":"REPLYING TO OldArmyLove WHO SAID: <u>\"    Yes, we had a home for unwed mothers,  The Florence Crittenton Home.   But, the shame that families felt in those days was enormous and almost unbearable.      \"</u>    The Florence Crittenton Home still exists.   In the bad old days, we snuck unmarried women into these homes or sent them to take care of sick aunts.   Now we sneak them into abortion clinics. ","user_id":"Boospar","fromReply":[24,52,54,56,59,60],"toReply":[15]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":22,"time":"Sat 12 June 2010 02:06 PM","content":"I recall when President Clinton tried this back in the ninties.   No military physicians would do an elective abortion, so they had to hire outsiders. Many nurses and other personnel refused to assist. ","user_id":"Boospar","fromReply":[24,52,54,56,59,60],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":23,"time":"Sat 12 June 2010 02:06 PM","content":"REPLYING TO ScotsVisitor WHO SAID: <u>\" How does that work if abortion in the foreign host nation is illegal ?\"</u>   Depends on agreement with host nation. It is simple if the base is considered extra-territorial. ","user_id":"thorin001","fromReply":[28,30,35,51,53,55,57,58,61,62],"toReply":[18]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":24,"time":"Sat 12 June 2010 03:52 PM","content":"REPLYING TO Boospar WHO SAID: <u>\" I recall when President Clinton tried this back in the ninties.   No military physicians would do an elective abortion, so they had to hire outsiders. Many nurses and other personnel refused to assist.\"</u>   Military doctors may be doctors, but they are also officers.  Make it a lawful order and refusal is grounds for a less than honorable separation with NO benefits.   Religious  or moral grounds should not be an acceptable reason for refusal either.  A lot of soldiers have the same religious and moral arguments against serving and waging war and killing but they are expected to follow orders just the same.   We are no longer conscripting people for military service so if a doctor or medical person does not want to follow orders to perform abortions, then they should not enlist or accept a commission.  If they do, then they have to also accept that they may be called on to perform abortions and should expect to follow orders or face legal consequences. ","user_id":"skinman13","fromReply":[26,34,41,49,50],"toReply":[21,22]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":25,"time":"Sat 12 June 2010 04:13 PM","content":"REPLYING TO Yooper_tj WHO SAID: <u>\"   Let&apos;s hear it for the Social Conservatives!  Keep on reminding us that the victims of rape and incest are at fault...and that they should be held both morally and fiscally responsible for the consequences.     I guess you just can&apos;t buy morality.\"</u> Yes, because there is so Much Incest and Rape at Hohenfels or Vincenza, or Bagram ","user_id":"LineDoggie","fromReply":[],"toReply":[2]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":26,"time":"Sat 12 June 2010 04:37 PM","content":"REPLYING TO skinman13 WHO SAID: <u>\"  Military doctors may be doctors, but they are also officers.  Make it a lawful order and refusal is grounds for a less than honorable separation with NO benefits.   Religious  or moral grounds should not be an acceptable reason for refusal either.  A lot of soldiers have the same religious and moral arguments against serving and waging war and killing but they are expected to follow orders just the same.   We are no longer conscripting people for military service so if a doctor or medical person does not want to follow orders to perform abortions, then they should not enlist or accept a commission.  If they do, then they have to also accept that they may be called on to perform abortions and should expect to follow orders or face legal consequences.\"</u>   Fed Law provides Doctor&apos;s with an opt out option. Now, if the Libturds want to change fed law which would force Doctor&apos;s to perform a procedure they&apos;re morally opposed to... well hell they might as well throw in a bill reactivating the Draft also as both would have about the same chance of survival or at least there&apos;ll be blood running in the streets over one or the other.  The little Misses can simply hold an asprin between their knees until they are in a location where they can safely eliminate their mistakes. ","user_id":"GunnyZak","fromReply":[27,29,32,39,40,44,47],"toReply":[19,24]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":27,"time":"Sat 12 June 2010 05:59 PM","content":"REPLYING TO GunnyZak WHO SAID: <u>\"   Fed Law provides Doctor&apos;s with an opt out option. Now, if the Libturds want to change fed law which would force Doctor&apos;s to perform a procedure they&apos;re morally opposed to... well hell they might as well throw in a bill reactivating the Draft also as both would have about the same chance of survival or at least there&apos;ll be blood running in the streets over one or the other.  The little Misses can simply hold an asprin between their knees until they are in a location where they can safely eliminate their mistakes.\"</u>   Then you would have no problem with Moslems refusing to treat women at all. Same law protects &apos;moral&apos; objections.  As long as abortion is legal it must be treated as any other (mostly) elective procedure. ","user_id":"thorin001","fromReply":[28,30,35,51,53,55,57,58,61,62],"toReply":[8,11,12,26]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":28,"time":"Sat 12 June 2010 06:31 PM","content":"REPLYING TO thorin001 WHO SAID: <u>\"   Then you would have no problem with Moslems refusing to treat women at all. Same law protects &apos;moral&apos; objections.  As long as abortion is legal it must be treated as any other (mostly) elective procedure.\"</u>   If fed law read that Moslems didn&apos;t have to treat females then that&apos;s the law. But it is not, is it?  If fed law reads that mil docs at overseas locations can provide elective abortions (if they choose so) providing the patient covers the costs ... that&apos;s the law . Isn&apos;t it? ","user_id":"GunnyZak","fromReply":[29,32,39,40,44,47],"toReply":[23,27]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":29,"time":"Sat 12 June 2010 06:47 PM","content":"REPLYING TO GunnyZak WHO SAID: <u>\"   If fed law read that Moslems didn&apos;t have to treat females then that&apos;s the law. But it is not, is it?  If fed law reads that mil docs at overseas locations can provide elective abortions (if they choose so) providing the patient covers the costs ... that&apos;s the law . Isn&apos;t it?\"</u>   Which law are you refering to? I was refering to the so called &apos;conscience clause&apos;. ","user_id":"thorin001","fromReply":[30,35,51,53,55,57,58,61,62],"toReply":[8,11,12,26,28]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":30,"time":"Sat 12 June 2010 06:51 PM","content":"REPLYING TO thorin001 WHO SAID: <u>\"   Which law are you refering to? I was refering to the so called &apos;conscience clause&apos;.\"</u>   Off the OP:  \"Under the amendment, female servicemembers and military dependents stationed overseas would have access to abortions, provided they pay for the procedure themselves and medical personnel on base are willing to perform it. No military doctors would be required to perform abortions if they object to the practice.\" ","user_id":"GunnyZak","fromReply":[32,39,40,44,47],"toReply":[23,27,29]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":31,"time":"Sat 12 June 2010 10:38 PM","content":"I am anti-abotion, but if the law allows it, I will not try to stop anyone who tries to do it. I hate death, but I will not be \"the first to cast a stone\".... ","user_id":"Golgoth","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":32,"time":"Sun 13 June 2010 05:02 AM","content":"REPLYING TO GunnyZak WHO SAID: <u>\" ]  Off the OP:  \"Under the amendment, female servicemembers and military dependents stationed overseas would have access to abortions, provided they pay for the procedure themselves and medical personnel on base are willing to perform it. No military doctors would be required to perform abortions if they object to the practice.\"\"</u>   Thanks. That&apos;s what I get for skimming through the article.  I still contend that there should be no special regulations for abortion as long as it is still legal.  That whole opt out clause renders the entire abortion option moot. &apos;We will claim to allow abortions, put pressure on doctors not to perform them, and then allow the doctors to refuse to perform them with no repercussions.&apos; Yeah, that is really allowing them.    ","user_id":"thorin001","fromReply":[35,51,53,55,57,58,61,62],"toReply":[8,11,12,26,28,30]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":33,"time":"Sun 13 June 2010 06:41 AM","content":"REPLYING TO MM2_ss_Lewis WHO SAID: <u>\" Nicely expressed OAL.  Sea, that line would make a great bumper sticker, can I have your permission to us it if I ever feel the need to express my view on the matter with plastic glued on my truck?\"</u> I&apos;m fairly certain I didn&apos;t coin that phrase...just heard it somewhere. You&apos;re welcome to it   ","user_id":"SeaWitch1220","fromReply":[],"toReply":[17]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":34,"time":"Sun 13 June 2010 06:45 AM","content":"REPLYING TO skinman13 WHO SAID: <u>\"   The only possible way this can happen is for all of us to take a serious look at how we are politicizing educating today&apos;s youth in regards to sexual conduct.  Focusing on only teaching abstinence in public schools is a totally naive and stupid concept.  Teach all aspects of sex, not just abstinence.  Teens are going to explore, they will engage in all forms of sex, and they are being put in serious jepardy by not being informed about the consequences of STD and unwanted pregnancies.  Provide real information on birth control methods.  Provide condoms without question or restriction; provide meaningful guidance information on oral birth control contraceptives, and start it early.  Social conservatives are demanding that sex education be sanitized and want it to be a family issue alone.  Sure, the parents SHOULD be the ones responsible to do this, but the cold hard fact is that they are NOT doing it. Then what? Every year, younger children are engaging in risky sexual activities and suffer emotional trauma, sexually transmitted diseases that are increasingly difficult to treat and cure, and babies are having babies.   Teach them, provide them with information and hope they make a good choice...but never forget that they will engage in sexual activities and if we don&apos;t understand and accept that fact, and depoliticize it, then nothing will change...\"</u> I agree with you wholeheartedly...I&apos;m the gal that wants a condom machine in all High School restrooms, male and female.","user_id":"SeaWitch1220","fromReply":[],"toReply":[19,24]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":35,"time":"Sun 13 June 2010 08:08 AM","content":"REPLYING TO thorin001 WHO SAID: <u>\"   Thanks. That&apos;s what I get for skimming through the article.  I still contend that there should be no special regulations for abortion as long as it is still legal.  That whole opt out clause renders the entire abortion option moot. &apos;We will claim to allow abortions, put pressure on doctors not to perform them, and then allow the doctors to refuse to perform them with no repercussions.&apos; Yeah, that is really allowing them.   \"</u>   On the other hand, if the law allows negligent women to obtain abortions through military facilities why not swing open the door to all elective procedures. Tummy tucks, nose jobs, chin lifts, p nis extensions etc.. Get that Hollywood Look on the taxpayers dime! ","user_id":"GunnyZak","fromReply":[39,40,44,47],"toReply":[23,27,29,32]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":36,"time":"Sun 13 June 2010 08:20 AM","content":"\"NEGLIGENT WOMEN\"???  WTF?  Since when do women become pregnant all by themselves? ","user_id":"Cider33_Alpha","fromReply":[37,38],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":37,"time":"Sun 13 June 2010 08:32 AM","content":"REPLYING TO Cider33_Alpha WHO SAID: <u>\" \"NEGLIGENT WOMEN\"???  WTF?  Since when do women become pregnant all by themselves?\"</u>   12-minutes; remarkable restraint, really!    ","user_id":"KJ1110","fromReply":[],"toReply":[3,6,9,36]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":38,"time":"Sun 13 June 2010 09:54 AM","content":"REPLYING TO Cider33_Alpha WHO SAID: <u>\" \"NEGLIGENT WOMEN\"???  WTF?  Since when do women become pregnant all by themselves?\"</u>   Oh.. it&apos;s the guys fault that the woman granting access has not made demand for safe entry     Take a geritol & chill... ","user_id":"GunnyZak","fromReply":[39,40,44,47],"toReply":[3,6,9,36]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":39,"time":"Sun 13 June 2010 10:00 AM","content":"REPLYING TO GunnyZak WHO SAID: <u>\"   Fed Law provides Doctor&apos;s with an opt out option. Now, if the Libturds want to change fed law which would force Doctor&apos;s to perform a procedure they&apos;re morally opposed to... well hell they might as well throw in a bill reactivating the Draft also as both would have about the same chance of survival or at least there&apos;ll be blood running in the streets over one or the other.  The little Misses can simply hold an asprin between their knees until they are in a location where they can safely eliminate their mistakes.\"</u>   So, doctors can opt out of performing an abortion but soldiers can not legally opt out of killing the enemy and airmen cannot legally opt out of dropping the bombs...pretty politically motivated option, isn&apos;t it?  That is the point I am making...politicizing abortion is arbitrary and stupid.  Fed laws can be changed, and your, \"hold an aspirin between her knees,\" comment is incredibly naive.  How about the boy?  You are definately old-school because this comment shows that you believe that birth control is strictly a woman&apos;s responsibility.    Maybe you were pure and chaste when you were a teenager, or maybe you are just so damn old that you cannot remember how strong the sex drive of a teenager is, and are denying that today&apos;s youth are more open and accepting of sex and are engaging in sexual activities at a younger age than our generation.  BTW, tossing out stupid crap like, \"libturds,\" in your otherwise good comment makes it look like you just want to pick a fight and not express your opinion. ","user_id":"skinman13","fromReply":[41,49,50],"toReply":[8,11,12,26,28,30,35,38]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":40,"time":"Sun 13 June 2010 10:04 AM","content":"REPLYING TO GunnyZak WHO SAID: <u>\"   Oh.. it&apos;s the guys fault that the woman granting access has not made demand for safe entry     Take a geritol & chill...\"</u>   Take a Viagra and remember what sex is like...   ","user_id":"skinman13","fromReply":[41,49,50],"toReply":[8,11,12,26,28,30,35,38]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":41,"time":"Sun 13 June 2010 10:33 AM","content":"REPLYING TO skinman13 WHO SAID: <u>\"   So, doctors can opt out of performing an abortion but soldiers can not legally opt out of killing the enemy and airmen cannot legally opt out of dropping the bombs...pretty politically motivated option, isn&apos;t it?  That is the point I am making...politicizing abortion is arbitrary and stupid.  Fed laws can be changed, and your, \"hold an aspirin between her knees,\" comment is incredibly naive.  How about the boy?  You are definately old-school because this comment shows that you believe that birth control is strictly a woman&apos;s responsibility.    Maybe you were pure and chaste when you were a teenager, or maybe you are just so damn old that you cannot remember how strong the sex drive of a teenager is, and are denying that today&apos;s youth are more open and accepting of sex and are engaging in sexual activities at a younger age than our generation.  BTW, tossing out stupid crap like, \"libturds,\" in your otherwise good comment makes it look like you just want to pick a fight and not express your opinion.\"</u>   Not comprehending \"holding the asprin between the knees\" means this discussion is over your head.   As a teen.. I was a Marine & father of 3 with  4 sliding in right after turning 21. Kinda shoots your assumption chit away. Of course I&apos;m sure you speak as a person holding similar responsibilties.  On topic. The law is what it is. You think that mil clinics should turn into abortion mills... why don&apos;t you & your like press to have the law changed.  Me? I&apos;m not against choice. I am against forcing military doctors under the color of law to perform a procedure they find morally repugnant.  BTW, killing is a choice Sailor. ","user_id":"GunnyZak","fromReply":[44,47],"toReply":[19,24,39,40]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":42,"time":"Sun 13 June 2010 11:46 AM","content":"  There was an article awhile back about some high level officer in Iraq stating that if a deployed woman got prgenant she could be subject to court martial.  Big firestorm erupted and he backed away very quickly. ","user_id":"Ex_CG_GM","fromReply":[43],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":43,"time":"Sun 13 June 2010 11:57 AM","content":"REPLYING TO Ex_CG_GM WHO SAID: <u>\"   There was an article awhile back about some high level officer in Iraq stating that if a deployed woman got prgenant she could be subject to court martial.  Big firestorm erupted and he backed away very quickly.\"</u>   We have to wait to see what sexual conduct regs will come down the pike with repeal of DADT. ","user_id":"GunnyZak","fromReply":[44,47],"toReply":[10,42]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":44,"time":"Sun 13 June 2010 02:18 PM","content":"REPLYING TO GunnyZak WHO SAID: <u>\"   On the other hand, if the law allows negligent women to obtain abortions through military facilities why not swing open the door to all elective procedures. Tummy tucks, nose jobs, chin lifts, p nis extensions etc.. Get that Hollywood Look on the taxpayers dime!\"</u>   Bet you were unaware that military hospitals do elective breast augmentation, as long as they have a plastic surgery clinic. All the member has to do is pay for the implants. ","user_id":"Esample1","fromReply":[46],"toReply":[8,11,12,26,28,30,35,38,41,43]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":45,"time":"Sun 13 June 2010 02:30 PM","content":"Moderators  hat off!     I just realized, I posted the original draft of this just after midnight last night.  Sometime, I do strange things in my sleep. Oh well, pick and choose from each of them or ignore both of them.                Service members and their families should ever be denied a government entitlement that is available to general population.      We all have different views on this topic for many different reasons. I would like to share the following, all true;  Last week, I reconnected with Mary  , through a classmates forum, a lady who was in first grade with me, way back in 1943.  Our mothers worked together in the school cafeteria.   Her two older sisters were the same age as my two older brothers.  The families were good friends.   We have not seen or spoke or talked with each other in sixty  years.  Now she lives in Tenseness about two miles from our youngest daughter and family.     But, the one thing that is locked in both of our memories from first grade is the day we were told that her 14 year old sister, Margret died.    Margret died because she was pregnant and her mother tried to abort the baby with a coat hanger or some other such method.  What a horrible way for anyone to die.  We all believed that it was incest.  There were never any charges against her mother or anyone else.  It was just the way things were done in those days.      Yes, we had a home for unwed mothers,  The Florence Crittenton Home.   But, the shame that families felt in those days was enormous and almost unbearable.      I m unashamedly  prolife  - I believe that life begins at conception.  In Margret s case both the young mother and the unborn baby were lost.     Personal notes:  My grandmother, a very small Pima Indian, died giving birth to my mother and her twin brother.  The doctor said, she was too small to give birth to twins.  That was 1896 and there was no such thing as a safe abortion.  The stories we ve been told about how the my grandmother death impacted my grandmother, I m confident that he would, if it were possible, chosen my grandmother s life over the life of the twins.  As soon as my mother discovered she was pregnant with me, she was advised to have an abortion.  I would be her seventh child.  My father had just been confined the in Florida insane asylum.  My next older sibling was very not in good health.  The family vas  dirt poor  and I would be another mouth to feed.  My mother would not even consider it   I m sure in part her decision was based on the circumstances of her own birth.   I m thankful for the life that my mother gave me.   We are thankful that we could not have gotten an abortion in 1971 while stationed in Kitzingen Germany. I think we what have jumped at the opportunity.  We didn t want anymore children.  My wife was not well and it was a tough permanency.  If she/we would have had the abortion, we would have missed having one of the greatest young men God very created, our youngest son Timothy now 38. He has been married for 16 years to a wonderful a terrific young lady.  They are parents of two loving wonderful children, our Caleb and our Abbey.   After Tim s birth, I visited the doctor and had  the procedure.   As a father and husband, if given the option of choosing the life of my wife over the life of our unborn child, I would always choose my wife.  My final thoughts: Abortion should never be a substitute for birth control and this horrible  partial birth abortion  procedure is in MN2BHO, nothing but infanticide.     The statement by my much loved friend,      an individual woman&apos;s right to choose what is done to HER body    has to be given a lot of weight.  But, prostitution is outlawed in most states as is drug use, and these both affect a persons use and control over their own body.    Finally, I don t know how to reduce the astronomical number abortion. I m confident that everyone wishes there would never be another abortion.  But, we can not and must not, go back to the days of the  coat hanger abortions.  The answer might be education, education, education.   ","user_id":"OldArmyLove","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":46,"time":"Sun 13 June 2010 02:50 PM","content":"REPLYING TO Esample1 WHO SAID: <u>\" Bet you were unaware that military hospitals do elective breast augmentation, as long as they have a plastic surgery clinic. All the member has to do is pay for the implants.\"</u>   Yes I did & why I didn&apos;t include boob jobs on the list. It&apos;s offered so mil docs can gain experiece in reconstructive surgery. Word is some receivers of larger   have paid a much higher price than if they simply went to experts in the field. ","user_id":"GunnyZak","fromReply":[47],"toReply":[44]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":47,"time":"Sun 13 June 2010 07:13 PM","content":"REPLYING TO GunnyZak WHO SAID: <u>\"   On the other hand, if the law allows negligent women to obtain abortions through military facilities why not swing open the door to all elective procedures. Tummy tucks, nose jobs, chin lifts, p nis extensions etc.. Get that Hollywood Look on the taxpayers dime!\"</u>   Which is why it should be treated as any other elective surgury. No special treatment. ","user_id":"thorin001","fromReply":[51,53,55,57,58,61,62],"toReply":[8,11,12,26,28,30,35,38,41,43,46]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":48,"time":"Sun 13 June 2010 07:32 PM","content":"You know, all these folks talking about sex drive and such.  Mind you I was not an angel as a teenager, but I was a virgin until I was 23.  Likely I would still be a virgin today if me and this one ol gal hadn&apos;t gotten completely blitzed and found ourselves in a compromising position the next morning.  Now that being said.  Parents, talk to your kids about sex, drugs, and all those other uncomfortable subjects.  Kids and young military personell, don&apos;t do it, if you do, use protection, I don&apos;t care if you are male, female, both, or neither, use protection.  It is cheaper than an abortion, and frankly, folks like me would like to see abortions used safely and very rarely, and I don&apos;t want to hear about some young servicemember getting killed at an abortion clinic by some whacko either.  Should service members have access to abortions over seas?  Absolutely, IMHO they should as sometimes they are needed, say the health/life of the mother, rape, ect.  I do not feel they should be available as an alternative form of birth control or because a woman doesn&apos;t want to wear the maternity uniform.  Also, doctors should have an opt out for such things as well.  I want my doctor to wholeheartedly be in favor of any operation he is doing on me and I want him to have the experience and knowledge as well.  I wouldn&apos;t want a brain surgeon operating on me that is against using certain techniques on moral grounds to be the one doing the operation where that method is required, would you?  Same goes for abortions as well.  Do you want someone who is oposed to the operation working on your naughty bits?...I wouldn&apos;t. ","user_id":"MM2_ss_Lewis","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":49,"time":"Thu 17 June 2010 07:37 PM","content":"REPLYING TO skinman13 WHO SAID: <u>\"   Military doctors may be doctors, but they are also officers.  Make it a lawful order and refusal is grounds for a less than honorable separation with NO benefits.   Religious  or moral grounds should not be an acceptable reason for refusal either.  A lot of soldiers have the same religious and moral arguments against serving and waging war and killing but they are expected to follow orders just the same.   We are no longer conscripting people for military service so if a doctor or medical person does not want to follow orders to perform abortions, then they should not enlist or accept a commission.  If they do, then they have to also accept that they may be called on to perform abortions and should expect to follow orders or face legal consequences.\"</u>    Another advocate for freedom of choice is heard from.   Though apparently not all are entitled to this .....      ","user_id":"Boospar","fromReply":[52,54,56,59,60],"toReply":[19,24,39,40]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":50,"time":"Thu 17 June 2010 07:45 PM","content":"REPLYING TO skinman13 WHO SAID: <u>\"   So, doctors can opt out of performing an abortion but soldiers can not legally opt out of killing the enemy and airmen cannot legally opt out of dropping the bombs...pretty politically motivated option, isn&apos;t it?  That is the point I am making...politicizing abortion is arbitrary and stupid. \"</u>    Unborn humans are the enemy?      ","user_id":"Boospar","fromReply":[52,54,56,59,60],"toReply":[19,24,39,40]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":51,"time":"Thu 17 June 2010 07:58 PM","content":"REPLYING TO thorin001 WHO SAID: <u>\"   Which is why it should be treated as any other elective surgury. No special treatment.\"</u>    Surgeons refuse to perform elective surgery all the time. Why I just had one refuse to carve open one of my knees. ","user_id":"Boospar","fromReply":[52,54,56,59,60],"toReply":[23,27,29,32,47]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":52,"time":"Thu 17 June 2010 09:06 PM","content":"REPLYING TO Boospar WHO SAID: <u>\"    Surgeons refuse to perform elective surgery all the time. Why I just had one refuse to carve open one of my knees.\"</u>   But was it a military doctor? I really don&apos;t care one way or the other. I just do not like the special treatment for certain procedures. ","user_id":"thorin001","fromReply":[53,55,57,58,61,62],"toReply":[21,22,49,50,51]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":53,"time":"Thu 17 June 2010 09:47 PM","content":"REPLYING TO thorin001 WHO SAID: <u>\"   But was it a military doctor? I really don&apos;t care one way or the other. I just do not like the special treatment for certain procedures.\"</u>    I doubt a military doctor would have carved it up, either.   I would hope you are equally opposed to the special treatment status of bariatric surgery, amongst other forms of special treatment for some things. ","user_id":"Boospar","fromReply":[54,56,59,60],"toReply":[23,27,29,32,47,52]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":54,"time":"Fri 18 June 2010 12:05 PM","content":"REPLYING TO Boospar WHO SAID: <u>\"    I doubt a military doctor would have carved it up, either.   I would hope you are equally opposed to the special treatment status of bariatric surgery, amongst other forms of special treatment for some things.\"</u>   It sounds like there is a valid medical reason to not cut your knee rather than an arbitrary imposition of norals.  But, to answer your question, pretty much. ","user_id":"thorin001","fromReply":[55,57,58,61,62],"toReply":[21,22,49,50,51,53]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":55,"time":"Fri 18 June 2010 02:10 PM","content":"REPLYING TO thorin001 WHO SAID: <u>\"   It sounds like there is a valid medical reason to not cut your knee rather than an arbitrary imposition of norals.  But, to answer your question, pretty much.\"</u>    No valid medical reason exists for most pregnancy terminations, either. Plus a physician who refuses to perform abortions isn&apos;t imposing his morals on anyone, he is refusing to perform a legal procedure, which happens to people in and out of the military all the time.   Should we get rid of things like bariatric surgery because of their special status? ","user_id":"Boospar","fromReply":[56,59,60],"toReply":[23,27,29,32,47,52,54]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":56,"time":"Fri 18 June 2010 05:12 PM","content":"REPLYING TO Boospar WHO SAID: <u>\"    No valid medical reason exists for most pregnancy terminations, either. Plus a physician who refuses to perform abortions isn&apos;t imposing his morals on anyone, he is refusing to perform a legal procedure, which happens to people in and out of the military all the time.   Should we get rid of things like bariatric surgery because of their special status?\"</u>   Yes, refusing to terminate a pregnancy very often is imposing your morals on a patient. When there is no medical reason beyond the risk carried by all medical procedures that is exactly what the doctor is doing. And, yes, I know that the vast majority of abortions are purely elective.  Why should we get rid of bariatric surgery? We should get rid of needing the approval of the doctor&apos;s priest though. If you are asking if the military should pay for them, the answer is we should treat it as any other elective surgery. ","user_id":"thorin001","fromReply":[57,58,61,62],"toReply":[21,22,49,50,51,53,55]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":57,"time":"Fri 18 June 2010 06:47 PM","content":"REPLYING TO thorin001 WHO SAID: <u>\"   Yes, refusing to terminate a pregnancy very often is imposing your morals on a patient. When there is no medical reason beyond the risk carried by all medical procedures that is exactly what the doctor is doing. And, yes, I know that the vast majority of abortions are purely elective.  \"</u>    I shall have to inform the surgeon who won&apos;t scope my knee he is imposing his morals on women because he won&apos;t terminate pregnancies. I&apos;m sure he&apos;ll be surprised, as my guess is he didn&apos;t think it was something a sports medicine specialist should be expected to do. ","user_id":"Boospar","fromReply":[59,60],"toReply":[23,27,29,32,47,52,54,56]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":58,"time":"Fri 18 June 2010 06:51 PM","content":"REPLYING TO thorin001 WHO SAID: <u>\"     Why should we get rid of bariatric surgery? We should get rid of needing the approval of the doctor&apos;s priest though. If you are asking if the military should pay for them, the answer is we should treat it as any other elective surgery.\"</u>    You earlier stated you didn&apos;t like the special treatment for certain procedures. Bariatric surgery is treated differently than most other surgeries performed in military hospitals. If you are opposed to specialness, you should advocate for its elimination. ","user_id":"Boospar","fromReply":[59,60],"toReply":[23,27,29,32,47,52,54,56]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":59,"time":"Fri 18 June 2010 08:06 PM","content":"REPLYING TO Boospar WHO SAID: <u>\"    You earlier stated you didn&apos;t like the special treatment for certain procedures. Bariatric surgery is treated differently than most other surgeries performed in military hospitals. If you are opposed to specialness, you should advocate for its elimination.\"</u>   There is a difference between special for medical reasons and special for political reasons. Legislative restrictions on abortion are almost entirely political.  With bariatric surgery can a doctor say that he does not want to perform the surgery for personal reasons even when the procedure is offered at the clinic? ","user_id":"thorin001","fromReply":[61,62],"toReply":[21,22,49,50,51,53,55,57,58]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":60,"time":"Fri 18 June 2010 08:08 PM","content":"REPLYING TO Boospar WHO SAID: <u>\"    I shall have to inform the surgeon who won&apos;t scope my knee he is imposing his morals on women because he won&apos;t terminate pregnancies. I&apos;m sure he&apos;ll be surprised, as my guess is he didn&apos;t think it was something a sports medicine specialist should be expected to do.\"</u>   Your lack of intellectual honesty is showing.    ","user_id":"thorin001","fromReply":[61,62],"toReply":[21,22,49,50,51,53,55,57,58]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":61,"time":"Fri 18 June 2010 08:23 PM","content":"REPLYING TO thorin001 WHO SAID: <u>\"   There is a difference between special for medical reasons and special for political reasons. Legislative restrictions on abortion are almost entirely political.  With bariatric surgery can a doctor say that he does not want to perform the surgery for personal reasons even when the procedure is offered at the clinic?\"</u>    Not really. Special is special. What you appear to be saying is specialness should be allowed to exist when it doesn&apos;t intefere with some agendas.   With regard to bariatric surgery, yes doctors can and do decline to perform  this surgery on individuals all the time. ","user_id":"Boospar","fromReply":[],"toReply":[23,27,29,32,47,52,54,56,59,60]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":62,"time":"Fri 18 June 2010 08:26 PM","content":"REPLYING TO thorin001 WHO SAID: <u>\"   Your lack of intellectual honesty is showing.   \"</u>    So is your lack of consistency.      ","user_id":"Boospar","fromReply":[],"toReply":[23,27,29,32,47,52,54,56,59,60]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":63,"time":"Sat 19 June 2010 07:54 AM","content":"[QUOTE] Focusing on only teaching abstinence in public schools is a totally naive and stupid concept. Teach all aspects of sex, not just abstinence. Teens are going to explore, they will engage in all forms of sex, and they are being put in serious jepardy by not being informed about the consequences of STD and unwanted pregnancies. Provide real information on birth control methods. Provide condoms without question or restriction; provide meaningful guidance information on oral birth control contraceptives, and start it early.[UNQUOTE]  I wasn&apos;t going to add anything to this thread until I saw this........  The whole idea of what is right and proper to teach in schools has gone over the top! WAAAAAY over the top!!  There have been outrageous abuses of our children by administrators and \"teachers\" of various sex ed and \"health\" programs and it needs to be stopped and re-evaluated.  5 weeks ago my fourteen year old daughter, along with her \"health\" class, was treated to the spectacle of an internally positioned camera in a woman&apos;s vagina, showing the moment of ejaculation and in full view I might add, was the male&apos;s member during the moment.  This is a production of either the History channel, or the Discovery channel, she couldn&apos;t remember which and I am damned sure going to find out. The teacher is under warning right now and I intend to see him disciplined, up to and removal from, his position.  Most of our problem today is the tacit approval by adults of sexual freedom for teens not emotionally ready for that responsibility. in Short LAZY ASSED PARENTS WHO WON&apos;T DO THEIR JOB AS PARENTS!!!  We still have too damned many sixties burn outs who want to be \"friends\" with their  kids instead of parents and some of these fools, like this excuse for a teacher, are running rampant in their juvenile adolescent revolt, rebel with out a clue personna!!!  I have also charged this creep with assault and sexual misconduct and intend to press that all the way also....personally!!  This video was also shown to the sixth graders, (12 year olds) upon investigation, so this isn&apos;t over by a long shot!!  I am not a prude and those of you who will condemn me for being just another knee jerk reactionary Christian, better think again....it is NOT just my kid who is in danger of being over stimulated by this crap....it is YOURS as well!!!  T ","user_id":"tawodi","fromReply":[64],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1100030352001","post_id":64,"time":"Sat 19 June 2010 08:04 AM","content":"REPLYING TO tawodi WHO SAID: <u>\" [QUOTE] Focusing on only teaching abstinence in public schools is a totally naive and stupid concept. Teach all aspects of sex, not just abstinence. Teens are going to explore, they will engage in all forms of sex, and they are being put in serious jepardy by not being informed about the consequences of STD and unwanted pregnancies. Provide real information on birth control methods. Provide condoms without question or restriction; provide meaningful guidance information on oral birth control contraceptives, and start it early.[UNQUOTE]  I wasn&apos;t going to add anything to this thread until I saw this........  The whole idea of what is right and proper to teach in schools has gone over the top! WAAAAAY over the top!!  There have been outrageous abuses of our children by administrators and \"teachers\" of various sex ed and \"health\" programs and it needs to be stopped and re-evaluated.  5 weeks ago my fourteen year old daughter, along with her \"health\" class, was treated to the spectacle of an internally positioned camera in a woman&apos;s vagina, showing the moment of ejaculation and in full view I might add, was the male&apos;s member during the moment.  This is a production of either the History channel, or the Discovery channel, she couldn&apos;t remember which and I am damned sure going to find out. The teacher is under warning right now and I intend to see him disciplined, up to and removal from, his position.  Most of our problem today is the tacit approval by adults of sexual freedom for teens not emotionally ready for that responsibility. in Short LAZY ASSED PARENTS WHO WON&apos;T DO THEIR JOB AS PARENTS!!!  We still have too damned many sixties burn outs who want to be \"friends\" with their  kids instead of parents and some of these fools, like this excuse for a teacher, are running rampant in their juvenile adolescent revolt, rebel with out a clue personna!!!  I have also charged this creep with assault and sexual misconduct and intend to press that all the way also....personally!!  This video was also shown to the sixth graders, (12 year olds) upon investigation, so this isn&apos;t over by a long shot!!  I am not a prude and those of you who will condemn me for being just another knee jerk reactionary Christian, better think again....it is NOT just my kid who is in danger of being over stimulated by this crap....it is YOURS as well!!!  T\"</u>   I have to agree with you on this one, Tawodi - not on religious grounds, but because I agree that Boomers and their children (who are now having children) were/are too lazy or afraid to address sex ed issues with  their own children  straight on - yet we allow and even expect strangers (teachers) to do it, and God help them if they don&apos;t do it right!  The ultimate abdication of parental responsibility.  Oops - I said the R-word.  \"Responsibility\" and \"personal accountability\" are two of the things MOST missing from today&apos;s American society.  While I am and always will be pro-choice, if we held ourselves and our children to high standards of responsibility and personal accountability, then abortion would be what it should be:  legal, safe and rare. ","user_id":"Cider33_Alpha","fromReply":[],"toReply":[63]}],"id":"409192893_1100030352001"},{"post":[{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":1,"time":"Fri 22 February 2008 10:08 PM","content":" How far are you willing to go with a    woman s right to choose   ?    What I have in mind are child-bearing questions other than a woman s right to choose whether or not to have an abortion, either on demand or with some restrictions.   Does a woman have the right to choose the sex of the baby she carries? The color of the baby s eyes and hair? To have triplets? . . . What voice does her partner   husband or otherwise   have in her decision? Does a woman have the right to choose to have a baby against her husband s wishes?   Natallie was diagnosed with ovarian cancer  .  Before doctors removed both her ovaries, she and her partner, Howard, had six embryos fertilized with his sperm. The embryos were then frozen and stored.  The couple broke up. Howard withdrew his consent for the embryos to be used and asked that they be destroyed.  Natallie wanted to implant the embryos and sued to be allowed to do so without his permission.   She has argued he had already consented to their creation, storage and use, and should not be allowed to change his mind.  Current [national] laws require both the man and woman to give consent, and allow either party to withdraw that consent up to the point where the embryos are implanted.  Her lawyers argue that the right to a family life is enshrined in [an international] Convention of Human Rights and that she should be allowed to implant the embryos.   How would you rule? If national and international laws weren t involved, would you feel different? ","user_id":"machiavellean","fromReply":[42],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":2,"time":"Sun 09 March 2008 03:55 PM","content":"You know we have tried the birth control pill, the  patch, the morning after pill, IUDs, etc.  None of that seems to fully work because there are still women that get pregnant and want an abortion.  Reading through you post gave me this idea:  castrate or shoot every man that gets a woman pregnant without the benefit of marriage or is not willing to marry her when the condition is discovered.        Bring back shotgun weddings....it&apos;ll be a new trend...    ","user_id":"aggie_swife","fromReply":[4,8],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":3,"time":"Sun 09 March 2008 03:58 PM","content":"I&apos;m sure most women would not let a bunch scriveled old men in black robes tell them what to do with bodies...Just like men would not like to be told what to do with their johnsons...well maybe redumblicans    ","user_id":"scottrj50","fromReply":[14],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":4,"time":"Sun 09 March 2008 04:10 PM","content":"REPLYING TO aggie_swife WHO SAID: <u>\" You know we have tried the birth control pill, the  patch, the morning after pill, IUDs, etc.  None of that seems to fully work because there are still women that get pregnant and want an abortion.  Reading through you post gave me this idea:  castrate or shoot every man that gets a woman pregnant without the benefit of marriage or is not willing to marry her when the condition is discovered.        Bring back shotgun weddings....it&apos;ll be a new trend...    \"</u>   So how does that work for the women who deliberately get pregnant without the mans consent? Do we shoot them or remove their ability to reproduce? You can&apos;t lay all the responsibility on one sex and not expect some from the other.  I find it quite absurd, disgusting, appalling, reprehensible, and angering that my WIFE can go and have an abortion without MY consent yet after 3 children at 30 I still was  REQUIRED BY LAW  to get my wife&apos;s consent to have a vasectomy. You will get NO sympathy from me. I haven&apos;t received a dime in child support from my ex-wife in over 17 years. The \"state\" won&apos;t help me because I have the wrong anatomy. I have NUMEROUS cases of men I know who were wrongly persecuted by the state even while these men WERE paying child support. Until all these inequalities are corrected we have to live with what we&apos;ve got, like it or not.","user_id":"mmulder67","fromReply":[7,21],"toReply":[2]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":5,"time":"Sun 09 March 2008 04:19 PM","content":"I agree that the system is screwed up.  No, a woman should not be able to sue to get her ex-husbands frozen goods because she no longer has ovaries to produce.  If she does - then she will sue him for child support even though he was against it.  After all - it is his child as well. If she is that deperate to have children, she should ADOPT.  I&apos;m not going to get into abortion, it has been argued too many times on this web page. ","user_id":"Persy","fromReply":[6,19,34],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":6,"time":"Sun 09 March 2008 04:22 PM","content":"REPLYING TO Persy WHO SAID: <u>\" I agree that the system is screwed up.  No, a woman should not be able to sue to get her ex-husbands frozen goods because she no longer has ovaries to produce.  If she does - then she will sue him for child support even though he was against it.  After all - it is his child as well. If she is that deperate to have children, she should ADOPT.  I&apos;m not going to get into abortion, it has been argued too many times on this web page.\"</u>   I will second that opinion.","user_id":"mmulder67","fromReply":[7,21],"toReply":[5]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":7,"time":"Sun 09 March 2008 04:34 PM","content":"REPLYING TO mmulder67 WHO SAID: <u>\"   So how does that work for the women who deliberately get pregnant without the mans consent? Do we shoot them or remove their ability to reproduce? You can&apos;t lay all the responsibility on one sex and not expect some from the other.  I find it quite absurd, disgusting, appalling, reprehensible, and angering that my WIFE can go and have an abortion without MY consent yet after 3 children at 30 I still was  REQUIRED BY LAW  to get my wife&apos;s consent to have a vasectomy. You will get NO sympathy from me. I haven&apos;t received a dime in child support from my ex-wife in over 17 years. The \"state\" won&apos;t help me because I have the wrong anatomy. I have NUMEROUS cases of men I know who were wrongly persecuted by the state even while these men WERE paying child support. Until all these inequalities are corrected we have to live with what we&apos;ve got, like it or not.\"</u>   You are right - fair is fair.    What state do you live in that you can&apos;t collect child support if you have custody for the children?  One other question:  You wrote,:  numerous cases...wrongly persecuted....that were paying child support.\"  What were they persecuted for?","user_id":"aggie_swife","fromReply":[8],"toReply":[4,6]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":8,"time":"Sun 09 March 2008 05:26 PM","content":"REPLYING TO aggie_swife WHO SAID: <u>\"   You are right - fair is fair.    What state do you live in that you can&apos;t collect child support if you have custody for the children?  One other question:  You wrote,:  numerous cases...wrongly persecuted....that were paying child support.\"  What were they persecuted for?\"</u>   I can collect child support if I tell them where she is, (I don&apos;t know), and they won&apos;t look for her. I know a few women who got \"assisstance\" from the state in locating a delinquent ex. Maybe just a perceived slight on my part and irrelevant to this thread. The men I know were paying support to their ex&apos;s and when those ex&apos;s applied for assistance from the state then the state put&apos;s those men through the wringer. They have been slow to unwilling to accept canceled checks as proof of payments and have garnished these guys wages for \"back support\" that has already been paid. It is unnecessary and a waste of taxpayer money to persecute these guys.  It could always be disgruntled men with an attitude against the system???? It seems that the system is geared to side with the woman and the man get&apos;s little, if any, say in the matter. There are numerous things that need to be overhauled and I don&apos;t have all the answers. Just would like to see more \"equality\" in things pertaining to these issues.","user_id":"mmulder67","fromReply":[21],"toReply":[2,7]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":9,"time":"Sun 09 March 2008 05:40 PM","content":"If a woman wants to murder her unborn child and she has the right to do so, I should have the right to say \"you want it you raise it\"  An abortion destroys a life.  That decision rests on the woman who is going to have to carry the child to term.  If we make it illegal than lots of women will end up dead from the back room abortions that are botched up.  If she can live with the decison to kill her baby I have no say in the matter.  Except to say \"you want it, you raise it\"   The sexual revolution did not just benefit the women ","user_id":"Marou","fromReply":[10,29],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":10,"time":"Sun 09 March 2008 05:53 PM","content":"REPLYING TO Marou WHO SAID: <u>\" If a woman wants to murder her unborn child and she has the right to do so, I should have the right to say \"you want it you raise it\"  An abortion destroys a life.  That decision rests on the woman who is going to have to carry the child to term.  If we make it illegal than lots of women will end up dead from the back room abortions that are botched up.  If she can live with the decison to kill her baby I have no say in the matter.  Except to say \"you want it, you raise it\"   The sexual revolution did not just benefit the women\"</u>   But that is not the case. In every instance where the man DID NOT want to be a father the woman&apos;s decision has final say and the man has no recourse. He is then  BY LAW  required to support that child for 18  years. How is that fair? We have no rights in whether the child is born yet we have the responsibility to support that child?? That is the biggest problem I have with the issue. Now, if you absolve the man of his responsiblity to support that child, who will? The taxpayers? If the woman can&apos;t support herself and the child, is it right to make the public support her/them? That is why the public (read courts) have so much weight in making decisions affecting procreation. I personally don&apos;t believe in abortion and due to my persuasiveness in dealing with my ex, I now have a 19 year old son. I have raised him with the help of my family and my current wife without any assistance from his biological mother. That I haven&apos;t needed public assistance should be irrelevant to the state (to which I pay taxes) in their providing me with the same services they provide to others. But I am satisfied with the results and only want equality for everyone dealing with these kind of situations, both men and women.","user_id":"mmulder67","fromReply":[21],"toReply":[9]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":11,"time":"Sun 09 March 2008 06:02 PM","content":"I want to clarify if the woman wants to abort it than that decision rests with her.    If she wants to keep it that decision rest with her.    In either case since it is not my decision I should not be liable sinc it is not my decision ","user_id":"Marou","fromReply":[29],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":12,"time":"Sun 09 March 2008 06:14 PM","content":"That is the only issue I agreed with Reagan on, abortion.........  There have been men forced to pay child support for children that were proven not to be theirs, because the judge says once you pay, you have to pay forever.........now that&apos;s crazy......... ","user_id":"Golgoth","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":13,"time":"Sun 09 March 2008 06:48 PM","content":"I&apos;d like to point out that there are state laws prohibiting abortion on the basis of sex selection alone. I had to counsel a South Asian man who was trying to find out the sex of the fetus, then have his wife abort if the fetus turned out to be female. I had to fight to remain calm as I repeatedly advised him that it is against the law to do so in the state we were in. He should be glad that there was no way for me to slap him over the phone. ","user_id":"sweetsuds","fromReply":[27,36,40],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":14,"time":"Sun 09 March 2008 09:27 PM","content":"REPLYING TO scottrj50 WHO SAID: <u>\" I&apos;m sure most women would not let a bunch scriveled old men in black robes tell them what to do with bodies...Just like men would not like to be told what to do with their johnsons...well maybe redumblicans   \"</u>   How dare you deny that those bodies are housing other bodies.  You&apos;re a disgusting individual.  What about the voices for those bodies?  They don&apos;t count because your hippy feminist   says so?    Then you throw in some slander for all Republicans.    You sicken me.  Why stick to party lines?  Why not say you&apos;re an American and fight for every American?  Even those who are still in the womb?  If it&apos;s legal to kill a healthy unborn child, it should be legal to kill someone you dislike.  What the hell is the difference?    Start putting programs into place for those Americans who will have problems when they give birth.    Help those mothers in need.  Have programs for the children, for health/education.  40 million dead and nobody cares.","user_id":"Fighterpilotmafia","fromReply":[16,17],"toReply":[3]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":15,"time":"Sun 09 March 2008 09:40 PM","content":"This will be shocking to most of you here, but I am going to say it anyway and let the chips fall as they may...  But, if you want to talk choice, women, and men alike, made the choice to sleep with each other.  Taking the life of a child, even unborn or fetal, is wrong in every way.  The choice was made when they chose to have sex.  There is protection available; there are condoms, anti-sperm creams, birth control pills and much more that people can use, but too ignorant, or a better term IDIOTIC, to use such things to prevent unwanted children.  There are plenty of families out there that are unable to have children at all who would love the chance to become parents.  There are also plenty of children out there right now who NEED good parents to take care of them.  Choice?  The choice was made when they CHOSE to have sex with each other.  There are only certain cases I agree with abortion and those are rape, molestation, incest and/or sexual abuse. ","user_id":"SwtDivaLove","fromReply":[20,38],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":16,"time":"Sun 09 March 2008 09:44 PM","content":"REPLYING TO Fighterpilotmafia WHO SAID: <u>\"   How dare you deny that those bodies are housing other bodies.  You&apos;re a disgusting individual.  What about the voices for those bodies?  They don&apos;t count because your hippy feminist   says so?    Then you throw in some slander for all Republicans.    You sicken me.  Why stick to party lines?  Why not say you&apos;re an American and fight for every American?  Even those who are still in the womb?  If it&apos;s legal to kill a healthy unborn child, it should be legal to kill someone you dislike.  What the hell is the difference?    Start putting programs into place for those Americans who will have problems when they give birth.    Help those mothers in need.  Have programs for the children, for health/education.  40 million dead and nobody cares.\"</u>   Uh....What?????? How did you get all that from a comment on freedom of choice?","user_id":"mmulder67","fromReply":[21],"toReply":[14]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":17,"time":"Sun 09 March 2008 10:22 PM","content":"REPLYING TO Fighterpilotmafia WHO SAID: <u>\"   How dare you deny that those bodies are housing other bodies.  You&apos;re a disgusting individual.  What about the voices for those bodies?  They don&apos;t count because your hippy feminist   says so?    Then you throw in some slander for all Republicans.    You sicken me.  Why stick to party lines?  Why not say you&apos;re an American and fight for every American?  Even those who are still in the womb?  If it&apos;s legal to kill a healthy unborn child, it should be legal to kill someone you dislike.  What the hell is the difference?    Start putting programs into place for those Americans who will have problems when they give birth.    Help those mothers in need.  Have programs for the children, for health/education.  40 million dead and nobody cares.\"</u>    yea donate your salary to knocked up girls who get the scorn...and the boys just skip and brag about their latest conquest to their igmo friends...Get a grip you lightweight       ","user_id":"scottrj50","fromReply":[],"toReply":[14]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":18,"time":"Mon 10 March 2008 04:32 AM","content":"Abortion is a tired subject, but still important.    As I&apos;ve said here before, I&apos;m against it.  I volunteer for and support Right to Life.    And as briefly as I can say it again, I will not judge women who have gone that route.  That said, I think it&apos;s important for a young woman to fully realize that whatever decision she makes - it&apos;s for life.  Adoption is always an option.","user_id":"PinkBlossoms","fromReply":[22],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":19,"time":"Mon 10 March 2008 05:41 AM","content":"REPLYING TO Persy WHO SAID: <u>\" I agree that the system is screwed up.  No, a woman should not be able to sue to get her ex-husbands frozen goods because she no longer has ovaries to produce.  If she does - then she will sue him for child support even though he was against it.  After all - it is his child as well. If she is that deperate to have children, she should ADOPT.  I&apos;m not going to get into abortion, it has been argued too many times on this web page.\"</u>        ","user_id":"GunnyRet03","fromReply":[],"toReply":[5]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":20,"time":"Mon 10 March 2008 06:44 AM","content":"REPLYING TO SwtDivaLove WHO SAID: <u>\" The choice was made when they chose to have sex.  There is protection available; there are condoms, anti-sperm creams, birth control pills and much more that people can use, but too ignorant, or a better term IDIOTIC, to use such things to prevent unwanted children. \"</u> You are aware, of course, of the element within the \"Pro-Life\" movement who believe that the use of any form of birth control, whether it is used by a married couple or two unmarried people, is the equivilent of having an abortion and should be criminalized? (See former Senator Rick Santorom of Pennsylvania&apos;s public comments re  Griswold v. Connecticut , for example)  You are probably also aware that there are elements within the \"Pro-Life\" movement who consider me a criminal because I chose to have a vasectomy after the birth of my second child?  You may also be aware that there are elements within the \"Pro-Life\" movement that believe that the proper action to be taken if a woman is raped and becomes pregnant is that the rapist should be required to marry the raped woman or financially compensate her family rather than have the fetus aborted.  The extremists within the \"pro-Life\" community, like the fundamentalist extremists in every movement, have drawn their \"line in the sand\" and will never accept anything other than celibacy within marriage and outside marriage as the only marginally acceptable form of birth control. ","user_id":"Fightdirector","fromReply":[25,28,31],"toReply":[15]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":21,"time":"Mon 10 March 2008 06:57 AM","content":"REPLYING TO mmulder67 WHO SAID: <u>\" You will get NO sympathy from me. I haven&apos;t received a dime in child support from my ex-wife in over 17 years. The \"state\" won&apos;t help me because I have the wrong anatomy.\"</u> A member of my last Massachusetts National Guard unit (before I retired) was in a similar situation. After having two children, his wife went back to law school, graduated, passed the Bar examinations, and then asked for a divorce. At the divorce, at her specific request to the judge, he was given custody and she was assessed child support. She then recieved a job offer from a law firm in California and moved there. She stopped paying her child support, and he went to the appropriate authorities in Massachusetts for help. He was told, \"You&apos;re a man. When we finish tracking down  every man  who isn&apos;t paying his court-ordered child support - then we&apos;ll get around to trying to collect from your ex-wife.\"  When last I heard, she was over  250,000 in arrears. ","user_id":"Fightdirector","fromReply":[25,28,31],"toReply":[4,6,8,10,16]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":22,"time":"Mon 10 March 2008 07:53 AM","content":"REPLYING TO PinkBlossoms WHO SAID: <u>\" Abortion is a tired subject, but still important.    As I&apos;ve said here before, I&apos;m against it.  I volunteer for and support Right to Life.    And as briefly as I can say it again, I will not judge women who have gone that route.  That said, I think it&apos;s important for a young woman to fully realize that whatever decision she makes - it&apos;s for life.  Adoption is always an option.\"</u>  Not always, Pink. Women in abusive relationships tend to get beaten more often while they are pregnant, making miscarriages and stillbirths more likely. That, and medically, not every woman should be pregnant- it can be very dangerous to be pregnant if one has certain medical conditions. Choosing to continue a pregnancy isn&apos;t always choosing life- sometimes, it&apos;s simply a painful way to die. ","user_id":"sweetsuds","fromReply":[27,36,40],"toReply":[18]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":23,"time":"Mon 10 March 2008 08:29 AM","content":"IMO, ovarian cancer is a death sentence. 99  of the time it&apos;s not diagnosed until it&apos;s too late. Usually at a stage 3. It&apos;s symptoms are non specific and vague, what most women feel sometime in their life. (bloating, weight gain, non specific abdominal pain) Unfortunately, she will die. Implanting the embroyo&apos;s are now a moot point. Sorry. It&apos;s a fact of life... ","user_id":"DocTrowerFMF","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":24,"time":"Mon 10 March 2008 08:37 AM","content":" Associated Press:  If a woman&apos;s body spontaneously rejects a fertilized egg within a week of that fertilization, should she be prosecuted for self-aborting or \"killing\" a living human being?  Or should her body have \"the right to choose\"?    ","user_id":"Fightdirector","fromReply":[25,28,31],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":25,"time":"Mon 10 March 2008 09:39 AM","content":"REPLYING TO Fightdirector WHO SAID: <u>\"  Associated Press:  If a woman&apos;s body spontaneously rejects a fertilized egg within a week of that fertilization, should she be prosecuted for self-aborting or \"killing\" a living human being?  Or should her body have \"the right to choose\"?   \"</u>   Not to be overly simplistic, but you know, \"If men could get pregnant, not only would abortion be legal...it would be tax-deductable\"  Think about it! ","user_id":"WhoFreak","fromReply":[],"toReply":[20,21,24]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":26,"time":"Mon 10 March 2008 11:53 AM","content":"I will go as far as the voting booth. Unless someone else shoots first.","user_id":"rm444","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":27,"time":"Mon 10 March 2008 02:46 PM","content":"REPLYING TO sweetsuds WHO SAID: <u>\" I&apos;d like to point out that there are state laws prohibiting abortion on the basis of sex selection alone. I had to counsel a South Asian man who was trying to find out the sex of the fetus, then have his wife abort if the fetus turned out to be female. I had to fight to remain calm as I repeatedly advised him that it is against the law to do so in the state we were in. He should be glad that there was no way for me to slap him over the phone.\"</u>   --------------------------- Are you SURE?  Are you talking about a law in one of the 50 US states?  While that is an absolutely deplorable reason for an abortion, I have never know it to be illegal. I have never known \"intent\" to have anything to do with the legality of a pre-viability abortion. ","user_id":"nurse_attorney","fromReply":[30,37],"toReply":[13,22]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":28,"time":"Mon 10 March 2008 02:49 PM","content":"REPLYING TO Fightdirector WHO SAID: <u>\" A member of my last Massachusetts National Guard unit (before I retired) was in a similar situation. After having two children, his wife went back to law school, graduated, passed the Bar examinations, and then asked for a divorce. At the divorce, at her specific request to the judge, he was given custody and she was assessed child support. She then recieved a job offer from a law firm in California and moved there. She stopped paying her child support, and he went to the appropriate authorities in Massachusetts for help. He was told, \"You&apos;re a man. When we finish tracking down  every man  who isn&apos;t paying his court-ordered child support - then we&apos;ll get around to trying to collect from your ex-wife.\"  When last I heard, she was over  250,000 in arrears.\"</u>   --------------------- He should report her to the California Bar, complete with documentation.  They&apos;ll put the pressure on her and might even pull her ticket if she doesn&apos;t pay up. ","user_id":"nurse_attorney","fromReply":[30,37],"toReply":[20,21,24]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":29,"time":"Mon 10 March 2008 03:02 PM","content":"REPLYING TO Marou WHO SAID: <u>\" I want to clarify if the woman wants to abort it than that decision rests with her.    If she wants to keep it that decision rest with her.    In either case since it is not my decision I should not be liable sinc it is not my decision\"</u>   So, either way, you aren&apos;t going to support her - even though it is also yours? ","user_id":"Persy","fromReply":[34],"toReply":[9,11]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":30,"time":"Mon 10 March 2008 03:17 PM","content":"REPLYING TO nurse_attorney WHO SAID: <u>\"   --------------------------- Are you SURE?  Are you talking about a law in one of the 50 US states?  While that is an absolutely deplorable reason for an abortion, I have never know it to be illegal. I have never known \"intent\" to have anything to do with the legality of a pre-viability abortion.\"</u>   It was on the books in PA at the time that I was working as a reproductive health counselor.  It&apos;s part of the Abortion Control Act. I don&apos;t know if it&apos;s still extant. I&apos;d heard at the time that NY had a similar law, but I couldn&apos;t find any evidence of that.  http://www.fandm.edu/x10160.xml   http://query.nytimes.com/gst/fullpage.html?res 950DE3DE...3AA25752C1A96F948260  ","user_id":"sweetsuds","fromReply":[36,40],"toReply":[27,28]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":31,"time":"Mon 10 March 2008 07:24 PM","content":"REPLYING TO Fightdirector WHO SAID: <u>\" You are aware, of course, of the element within the \"Pro-Life\" movement who believe that the use of any form of birth control, whether it is used by a married couple or two unmarried people, is the equivilent of having an abortion and should be criminalized? (See former Senator Rick Santorom of Pennsylvania&apos;s public comments re  Griswold v. Connecticut , for example)  You are probably also aware that there are elements within the \"Pro-Life\" movement who consider me a criminal because I chose to have a vasectomy after the birth of my second child?  You may also be aware that there are elements within the \"Pro-Life\" movement that believe that the proper action to be taken if a woman is raped and becomes pregnant is that the rapist should be required to marry the raped woman or financially compensate her family rather than have the fetus aborted.  The extremists within the \"pro-Life\" community, like the fundamentalist extremists in every movement, have drawn their \"line in the sand\" and will never accept anything other than celibacy within marriage and outside marriage as the only marginally acceptable form of birth control.\"</u>   Actually, I was totally unaware of it.  However, I believe in any form of birth control as long as it prevents unwanted children instead of abortion.  When I hear of people who have gotten pregnant because they didn&apos;t use protection of any kind, and now are with a child they never wanted and/or too young to actually care for a child I consider STUPID.  Even young kids know about forms of birth control, yet the continue to fore go the usage of such items.  Another point along this line is that parents are not teaching their kids properly also about sex and preventative measures from teen pregnancies.  Still, I believe in birth control, and have even known several men who have had vasectomies to prevent more children, and women who have had their tubes tied.  The point is, people of this day and age are quite aware of STD&apos;s & VD&apos;s, plus AIDS.  Yet, they are too stupid to use the 2 brain cells in their head to have thought better and end up with a child that they did not want.  Instead of thinking with the big head on the shoulders, men are thinking with the small head in their pants, and girls/women should have the brains enough to also prevent it also.  To me, they are just as guilty as the men are.  But, my belief in &apos;Pro-Choice&apos; is that they made the choice to not use protection and were stupid enough to get pregnant.  I&apos;m very much &apos;Pro-Life&apos;.  But, like I also said, I only believe in abortion in certain cases; rape, molestation and incestual pregnancies. ","user_id":"SwtDivaLove","fromReply":[38],"toReply":[20,21,24]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":32,"time":"Mon 10 March 2008 07:34 PM","content":"Swtdivalove, if things always worked out the way we planned them, we&apos;d live in a very different world. The only 100  effective contraception method would be a hysterectomy or castration. Everything else, including sterilization, has a failure rate and contraindications. Coercive sex and coerced pregnancy is shockingly common in abusive relationships, and recent research has turned up that teenage boys are coercing their girlfriends into having sex and getting pregnant. So, walk a mile in the shoes of a girl whose boyfriend has been puncturing his condoms without her knowledge, and tell me what you think. ","user_id":"sweetsuds","fromReply":[36,40],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":33,"time":"Mon 10 March 2008 07:53 PM","content":"If my son did that, I would beat him with an inch of his life.  But, you are right... There is a lot of coercion happening also, and something I do not agree with.  I am still &apos;Pro-Life&apos;. ","user_id":"SwtDivaLove","fromReply":[38],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":34,"time":"Mon 10 March 2008 07:57 PM","content":"REPLYING TO Persy WHO SAID: <u>\" I agree that the system is screwed up.  No, a woman should not be able to sue to get her ex-husbands frozen goods because she no longer has ovaries to produce.  If she does - then she will sue him for child support even though he was against it.  After all - it is his child as well. If she is that deperate to have children, she should ADOPT.  I&apos;m not going to get into abortion, it has been argued too many times on this web page.\"</u>   Does that mean that an anonymous sperm donor should be held for child support, also? ","user_id":"billbright","fromReply":[35,39],"toReply":[5,29]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":35,"time":"Mon 10 March 2008 08:23 PM","content":"REPLYING TO billbright WHO SAID: <u>\"   Does that mean that an anonymous sperm donor should be held for child support, also?\"</u>   I believe that is a whole other issue in and of itself. ","user_id":"SwtDivaLove","fromReply":[38],"toReply":[34]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":36,"time":"Tue 11 March 2008 09:46 AM","content":"REPLYING TO sweetsuds WHO SAID: <u>\"   It was on the books in PA at the time that I was working as a reproductive health counselor.  It&apos;s part of the Abortion Control Act. I don&apos;t know if it&apos;s still extant. I&apos;d heard at the time that NY had a similar law, but I couldn&apos;t find any evidence of that.  http://www.fandm.edu/x10160.xml   http://query.nytimes.com/gst/fullpage.html?res 950DE3DE...3AA25752C1A96F948260 \"</u>   ----------------- Ah, thanks for the update.  Didn&apos;t that get tossed by SCOTUS (or most of it)? ","user_id":"nurse_attorney","fromReply":[37],"toReply":[13,22,30,32]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":37,"time":"Tue 11 March 2008 09:50 AM","content":"REPLYING TO nurse_attorney WHO SAID: <u>\"   ----------------- Ah, thanks for the update.  Didn&apos;t that get tossed by SCOTUS (or most of it)?\"</u>  If so, not while I worked there, nearly 10 years after the law was enacted. I was rather glad that I could tell that evil man that what he was planning to do was illegal. ","user_id":"sweetsuds","fromReply":[40],"toReply":[27,28,36]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":38,"time":"Tue 11 March 2008 09:51 AM","content":"REPLYING TO SwtDivaLove WHO SAID: <u>\"  I&apos;m very much &apos;Pro-Life&apos;.  But, like I also said, I only believe in abortion in certain cases; rape, molestation and incestual pregnancies.\"</u>   --------------------- This is the tough part of the \"pro-life\" stance.  Although I adamantly disagree with that position, I do have more respect for pro-lifers who are ABSOLUTELY and WITHOUT EXCEPTION opposed to abortion.  That is really the only pro-life position that makes sense.  If you can make \"exceptions\" when \"killing an unborn human being\" is \"acceptable,\" then you&apos;re not pro-life.  Your are only pro YOUR choices rather than someone else&apos;s choice.  That is a position that says: okay, sometimes it is acceptable to kill unborn babies but the choice belongs to me, or the government or judges but not to the woman effected by the unwanted pregnancy.  That&apos;s a pro-choice position that adds in an element of control over the lives of others. ","user_id":"nurse_attorney","fromReply":[],"toReply":[15,31,33,35]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":39,"time":"Tue 11 March 2008 09:52 AM","content":"REPLYING TO billbright WHO SAID: <u>\"   Does that mean that an anonymous sperm donor should be held for child support, also?\"</u>   ----------------------- That would depend on the contract he signed when he donated his sperm.  If he&apos;s told he may be responsible for support, he can choose not to donate. ","user_id":"nurse_attorney","fromReply":[],"toReply":[34]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":40,"time":"Tue 11 March 2008 09:54 AM","content":"REPLYING TO sweetsuds WHO SAID: <u>\"  If so, not while I worked there, nearly 10 years after the law was enacted. I was rather glad that I could tell that evil man that what he was planning to do was illegal.\"</u>   ------------------------ Gender selection abortions are truly abhorrent - but ought not be illegal.  \"Why,\" you ask?  Because it is unenforceable, for one. Why would you ever tell \"why\" if it is allowable for no reason at all? ","user_id":"nurse_attorney","fromReply":[],"toReply":[13,22,30,32,37]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":41,"time":"Tue 11 March 2008 10:06 AM","content":"Quite true- but this dude asked me when one could identify the sex of a fetus, then asked about the availability of abortions at that point. I told him that if they were choosing abortion, that it&apos;s safer to do so early, but he refused to consider doing so earlier. He then said \"I don&apos;t need a girl\". This is done in India- and some places are suffering from a lack of available women as a result. Do they then decide to quit aborting or abandoning girls? No, they buy or kidnap women from neighboring areas. Misogyny will be the end of us all. ","user_id":"sweetsuds","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_2520020171001","post_id":42,"time":"Tue 11 March 2008 02:27 PM","content":"REPLYING TO machiavellean WHO SAID: <u>\"  How far are you willing to go with a    woman s right to choose   ?    What I have in mind are child-bearing questions other than a woman s right to choose whether or not to have an abortion, either on demand or with some restrictions.   Does a woman have the right to choose the sex of the baby she carries? The color of the baby s eyes and hair? To have triplets? . . . What voice does her partner   husband or otherwise   have in her decision? Does a woman have the right to choose to have a baby against her husband s wishes?   Natallie was diagnosed with ovarian cancer  .  Before doctors removed both her ovaries, she and her partner, Howard, had six embryos fertilized with his sperm. The embryos were then frozen and stored.  The couple broke up. Howard withdrew his consent for the embryos to be used and asked that they be destroyed.  Natallie wanted to implant the embryos and sued to be allowed to do so without his permission.   She has argued he had already consented to their creation, storage and use, and should not be allowed to change his mind.  Current [national] laws require both the man and woman to give consent, and allow either party to withdraw that consent up to the point where the embryos are implanted.  Her lawyers argue that the right to a family life is enshrined in [an international] Convention of Human Rights and that she should be allowed to implant the embryos.   How would you rule? If national and international laws weren t involved, would you feel different?\"</u>   Good questions Mach!  My personal belief ONLY - \"Only a woman ever really knows who the father is.\"  Words I heard when I was very little and over which much ado has been made in popular culture over the subsequent 50 years.  How many babies are born without benefit of a dad in the picture - for example, a one night stand that definitively altered a woman&apos;s life and opportunities because she chose life over the convenience of an abortion?  Should a sperm donor have a right to abort baby because he doesn&apos;t like where his sperm has been donated?  In this case the couple broke up - but the \"dad\" was still nothing more than an unknown sperm donor to an unknown egg.  She should be allowed to be implanted with the fertilized in vitros and the extent of the donor&apos;s parental rights should be to have a certificate not name him as father but rather reflect the unknown identity of the donor.  Just like any other sperm donor, he should have the right to forever relinquish claim on the child as his own - financially and legally.    Just my humble opinions, Mach.  Very good ethical questions.","user_id":"CalDreaming02","fromReply":[],"toReply":[1]}],"id":"409192893_2520020171001"},{"post":[{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":1,"time":"Fri 05 September 2008 04:24 PM","content":"You know what I&apos;d really like to see?  At the very least, a form that the patient has to sign with the statement:    \"I hereby acknowledge that in proceeding with said abortion, I am putting to death a human child.\"    Just to admit it.  Just to throw the outrageous claim of &apos;choice&apos; out the window.  Sure, it&apos;s a choice.  But it is a choice to kill a baby.","user_id":"Fighterpilotmafia","fromReply":[6,8,22,24,27,28,32,40,56,59,67],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":2,"time":"Fri 05 September 2008 04:53 PM","content":"Should women be required to sign said contract before each menstrual period, in case their body ejects a fertilized egg? Should we have an inquest after every late period or confirmed miscarriage? Should death certificates be issued for every time a woman of reproductive age menstruates? If you&apos;re trying to suggest that a zygote or embryo is identical to a human child, these measures would be required. ","user_id":"sweetsuds","fromReply":[20,38,42,86],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":3,"time":"Fri 05 September 2008 05:18 PM","content":"Not to sound crass, but does that also mean every time a man has an ejaculation without the involvement of a female, will he be required to sign said document:  I hereby acknowledge that in proceeding with said ejaculation, I am putting to death a human child.  Just to admit it. Just to throw out the outrageuos claim of \"choice\" out the window. Sure it&apos;s a choice. But where do you get the right to determine when life begins? Is not a sperm a living organism?? Chew on that for a while.","user_id":"mmulder67","fromReply":[7,9,11,31,66,75],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":4,"time":"Fri 05 September 2008 05:20 PM","content":"Off topic, a potential to troll perhaps?    A fertilized egg, carried to term and somewhere in the middle of that a female has a &apos;choice&apos; to kill it with no say from the father.  Different than a menstrual period, different than the body rejecting the fertilized egg (miscarriage), no death certificate.  A fertilized, healthy egg that turns into something with a heartbeat....yeah, pretty much.  That&apos;s a human child.  Now please don&apos;t be wild with assumptions, with comments.  Let&apos;s be civil.","user_id":"Fighterpilotmafia","fromReply":[6,8,22,24,27,28,32,40,56,59,67],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":5,"time":"Fri 05 September 2008 05:25 PM","content":"An egg alone leads to nothing.  A single sperm alone leads to nothing.  It takes the two together to begin a human life.  We might as well included basic biology in the discussion. ","user_id":"Silverbusa","fromReply":[10,17,36,50,52,55],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":6,"time":"Fri 05 September 2008 05:38 PM","content":"REPLYING TO Fighterpilotmafia WHO SAID: <u>\" Off topic, a potential to troll perhaps?    Careful with the troll insinuations. You know us better than that.  A fertilized egg, carried to term and somewhere in the middle of that a female has a &apos;choice&apos; to kill it with no say from the father.  It&apos;s her body. Not that I think she should have 100  say in the matter, but that is another subject to be hashed out in the courts.  Different than a menstrual period, different than the body rejecting the fertilized egg (miscarriage), no death certificate.  I was unaware that death certificates were given for abortions???  A fertilized, healthy egg that turns into something with a heartbeat....yeah, pretty much.  That&apos;s a human child.  It&apos;s a living organism. Just like a sperm and an egg. This is never going to be settled by us. We will just disagree til the sun explodes.  Now please don&apos;t be wild with assumptions, with comments.  Let&apos;s be civil.  What are you reading that I am not??? Everything stated by everyone can be construed as an assumption.  And no one has been uncivil....yet...    \"</u> ","user_id":"mmulder67","fromReply":[7,9,11,31,66,75],"toReply":[1,4]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":7,"time":"Fri 05 September 2008 05:39 PM","content":"REPLYING TO mmulder67 WHO SAID: <u>\" Not to sound crass, but does that also mean every time a man has an ejaculation without the involvement of a female, will he be required to sign said document:  I hereby acknowledge that in proceeding with said ejaculation, I am putting to death a human child.  Just to admit it. Just to throw out the outrageuos claim of \"choice\" out the window. Sure it&apos;s a choice. But where do you get the right to determine when life begins? Is not a sperm a living organism?? Chew on that for a while.\"</u>   Thought this was an area for intelligent debate.  A sperm cell isn&apos;t a fertilized egg.    If we can&apos;t keep this on topic, without outrageous comments, I&apos;ll request it closed.","user_id":"Fighterpilotmafia","fromReply":[8,22,24,27,28,32,40,56,59,67],"toReply":[3,6]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":8,"time":"Fri 05 September 2008 05:49 PM","content":"REPLYING TO Fighterpilotmafia WHO SAID: <u>\" Thought this was an area for intelligent debate.  A sperm cell isn&apos;t a fertilized egg.    If we can&apos;t keep this on topic, without outrageous comments, I&apos;ll request it closed.\"</u>  A fertilized egg is not a human being. Therefore removing that fertilized egg from the host is not killing a baby. Is that on topic enough????","user_id":"mmulder67","fromReply":[9,11,31,66,75],"toReply":[1,4,7]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":9,"time":"Fri 05 September 2008 06:19 PM","content":"REPLYING TO mmulder67 WHO SAID: <u>\"  A fertilized egg is not a human being. Therefore removing that fertilized egg from the host is not killing a baby. Is that on topic enough????\"</u>  You are a human I presume.  You came from a fertilized egg.  At what magical moment did you become a human from just a mass of cells? ","user_id":"Silverbusa","fromReply":[10,17,36,50,52,55],"toReply":[3,6,8]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":10,"time":"Fri 05 September 2008 06:47 PM","content":"REPLYING TO Silverbusa WHO SAID: <u>\"  You are a human I presume.  You came from a fertilized egg.  At what magical moment did you become a human from just a mass of cells?\"</u>  The moment I left the host (my mother&apos;s body). Then I was classified as a baby.","user_id":"mmulder67","fromReply":[11,31,66,75],"toReply":[5,9]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":11,"time":"Fri 05 September 2008 06:49 PM","content":"REPLYING TO mmulder67 WHO SAID: <u>\"  The moment I left the host (my mother&apos;s body). Then I was classified as a baby.\"</u>  I asked when you became a human not a baby.  If your answer remains the same moment, what was so magical about exiting your mother&apos;s body that made you a human when moments before you were not?  Seems like a very arbitrary and non-scientific conclusion. ","user_id":"Silverbusa","fromReply":[17,36,50,52,55],"toReply":[3,6,8,10]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":12,"time":"Fri 05 September 2008 07:17 PM","content":"OK, a fertilized egg is still just an egg... within 10 days it duplicates and becomes a zygote... and continues to replicate, within the first month there is myocardial tissue with electrical activity (a heart beat) and there is movement after a couple of months...    I believe that there is \"life\", though microscopic, when the zygote develops.    I agree, to a degree, with the understanding statement of destroying a potential life.  I had this argument with my office manager yesterday... I don&apos;t believe that it should be a choice to actively abort a pregnancy for  s, grins, and giggles... only under mitigating circumstances...  and it is more of a moral belief issue than anything... ","user_id":"SkipHadaway","fromReply":[13,14],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":13,"time":"Fri 05 September 2008 07:40 PM","content":"REPLYING TO SkipHadaway WHO SAID: <u>\" OK, a fertilized egg is still just an egg... within 10 days it duplicates and becomes a zygote... and continues to replicate, within the first month there is myocardial tissue with electrical activity (a heart beat) and there is movement after a couple of months...    I believe that there is \"life\", though microscopic, when the zygote develops.    I agree, to a degree, with the understanding statement of destroying a potential life.  I had this argument with my office manager yesterday... I don&apos;t believe that it should be a choice to actively abort a pregnancy for  s, grins, and giggles... only under mitigating circumstances...  and it is more of a moral belief issue than anything...\"</u>  Of the members of this board who have personally known or worked with women who have had abortions, it has never been for frivolous reasons. There may be some woman, somewhere, who had an abortion to maintain her figure, but she either doesn&apos;t exist or is one hell of an actress. Women who choose abortion are often in dire circumstances- not merely a desire to avoid maternity wear. ","user_id":"sweetsuds","fromReply":[20,38,42,86],"toReply":[12]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":14,"time":"Fri 05 September 2008 07:45 PM","content":"REPLYING TO SkipHadaway WHO SAID: <u>\" I don&apos;t believe that it should be a choice to actively abort a pregnancy for  s, grins, and giggles... only under mitigating circumstances...  and it is more of a moral belief issue than anything...\"</u>   I know a few women who have had abortions. None of them did it for   s, grins, and giggles . If you think that is the main reason women have abortions you have another think coming.  On a side note, what would be your mitigating circumstances be that would  allow  a women to choose to have an abortion? ","user_id":"HANtheMANN","fromReply":[],"toReply":[12]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":15,"time":"Fri 05 September 2008 08:09 PM","content":"If you demand that every pregnacy is carried to term by force of the law then get you body out in front of an abortion clinic peacefully, accompanied by a lawyer, to create a binding contract with the mother to financially support that child to age 18.  If you will not do that you are a hypocrite that wants the law to rule others lives in terms of your morals and ideas while you accept zero responsibility for the child. ","user_id":"anoldnotboldrecondo","fromReply":[16,29,63,76],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":16,"time":"Fri 05 September 2008 09:18 PM","content":"REPLYING TO anoldnotboldrecondo WHO SAID: <u>\" If you demand that every pregnacy is carried to term by force of the law then get you body out in front of an abortion clinic peacefully, accompanied by a lawyer, to create a binding contract with the mother to financially support that child to age 18.  If you will not do that you are a hypocrite that wants the law to rule others lives in terms of your morals and ideas while you accept zero responsibility for the child.\"</u>  If I&apos;m not willing to spend every moment with a child to protect him from a child molester should I let child molesters run free?  Give me a break.  A woman who is not raped needs to take responsibility for getting pregnant. ","user_id":"Silverbusa","fromReply":[17,36,50,52,55],"toReply":[15]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":17,"time":"Fri 05 September 2008 09:30 PM","content":"REPLYING TO Silverbusa WHO SAID: <u>\" If I&apos;m not willing to spend every moment with a child to protect him from a child molester should I let child molesters run free?      HERRING   Alert...not relevant, as molesting children is a  crime  and abortion is not. Try again.   quote:  Give me a break.  A woman who is not raped needs to take responsibility for getting pregnant.\"</u>  And part of that responsibility is deciding what kind of life  both  would have if she decides to have that child. Ending the pregnancy is taking responsibility.","user_id":"mmulder67","fromReply":[31,66,75],"toReply":[5,9,11,16]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":18,"time":"Fri 05 September 2008 10:18 PM","content":"A young girl under the age of 18 gets pregnant.  She has no means of support and the father probably doesn&apos;t either.  If the parents had any brains in their heads they would have their daughter on birth control.  You know that kids are becoming sexually active at a younger age.  Is this young girl suppose to have this baby and the grandparents raise it?  I believe NO.  I believe in abortions for many reasons.  Everyone is entitled to their opinion, and this is mine.      ","user_id":"RetiredMarineWife","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":19,"time":"Sat 06 September 2008 07:56 AM","content":"Morally, I don&apos;t believe in Abortions.  However, I believe that God gave us the free will to choose our destinies right or wrong and based on that principle I am against any legislation that would in anyway for my choice and beliefs on others unless their choice somehow impedes mine and everyone else.  The real question is who is she effecting (not affecting)?  So believe the soul enters at conception, some believe upon first breath, I believe that beliefs should not be legislated, only hard core facts.  We can prove those beliefs can we?  What we can prove is that sperm mixed with an egg goes through multiple stages before you have something that resembles a human and then it is born.  Personally, I believe in a middle ground but most are too arrogant and only want their way legislated.  I say give a woman up to the first trimester, anything after that better have multiple signatures.  Most can agree that a woman knows she is pregnant within a month anyway, anything after that is just irresponsible or lazy.  You should know within a week of finding out how you feel or want to do, not at the point when a baby is kicking.  Just my 2 cents. ","user_id":"Sgt_Salaam","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":20,"time":"Sat 06 September 2008 09:13 AM","content":"REPLYING TO sweetsuds WHO SAID: <u>\" Should women be required to sign said contract before each menstrual period, in case their body ejects a fertilized egg?   Not a concious decision, and there&apos;s no way of knowing that conception occurred.   Should we have an inquest after every late period or confirmed miscarriage?   No inquest needed, but a lot of couples who suffer a miscarriage feel that they&apos;ve lost a child.   Should death certificates be issued for every time a woman of reproductive age menstruates?    Again, no conception occurred.   If you&apos;re trying to suggest that a zygote or embryo is identical to a human child, these measures would be required.   A zygote? No.  \"</u> ","user_id":"SurfaceDog","fromReply":[23],"toReply":[2,13]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":21,"time":"Sat 06 September 2008 09:55 AM","content":"I&apos;d also like to see, as per previous posts, the abortion question answered by this:  No abortions after the first month.  You get one month for your &apos;choice&apos; and then no more.  Better sex ed in schools.  Free condoms and BC/MA pills.  National something or other that will be set up to deal with unwanted children.  Did you know a black American baby is highly prized in Germany?  More so than a white one.  In the case of rape/incest/harm to a mother, abortions will be allowed.  The acknowledging of father&apos;s rights.  The father will have a say in this. ","user_id":"Fighterpilotmafia","fromReply":[22,24,27,28,32,40,56,59,67],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":22,"time":"Sat 06 September 2008 10:36 AM","content":"REPLYING TO Fighterpilotmafia WHO SAID: <u>\" I&apos;d also like to see, as per previous posts, the abortion question answered by this:  No abortions after the first month.  You get one month for your &apos;choice&apos; and then no more.  Better sex ed in schools.  Free condoms and BC/MA pills.  National something or other that will be set up to deal with unwanted children.  Did you know a black American baby is highly prized in Germany?  More so than a white one.  In the case of rape/incest/harm to a mother, abortions will be allowed.  The acknowledging of father&apos;s rights.  The father will have a say in this.\"</u>   I agree with the exception of raising it to 2 months, as some women can still have a period even after pregnant the first month and may think they are not pregnant. ","user_id":"Sgt_Salaam","fromReply":[],"toReply":[1,4,7,21]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":23,"time":"Sat 06 September 2008 10:45 AM","content":"REPLYING TO SurfaceDog WHO SAID: <u>\" \"</u>     But if embryo or even fetus   human child, it would be required to treat every case as a possibly suspicious death. Even for a stillborn, an inquest would be needed. And not every woman is traumatized by a miscarriage, or feels that she&apos;s lost a child. These aren&apos;t callous women, it&apos;s just that miscarriages are a part of life.  ","user_id":"sweetsuds","fromReply":[38,42,86],"toReply":[20]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":24,"time":"Sat 06 September 2008 10:50 AM","content":"REPLYING TO Fighterpilotmafia WHO SAID: <u>\" I&apos;d also like to see, as per previous posts, the abortion question answered by this:  No abortions after the first month.  You get one month for your &apos;choice&apos; and then no more.  Better sex ed in schools.  Free condoms and BC/MA pills.  National something or other that will be set up to deal with unwanted children.  Did you know a black American baby is highly prized in Germany?  More so than a white one.  In the case of rape/incest/harm to a mother, abortions will be allowed.  The acknowledging of father&apos;s rights.  The father will have a say in this.\"</u>   Four weeks of pregnancy is still prior to a missed period for many women- often, it&apos;s not until week six or seven that a period is actually missed. If a woman is not expecting to be pregnant, then she&apos;d likely be past your threshold by the time she finds out that she is pregnant. I&apos;m in favor of bringing back menstrual extraction. It&apos;s low-risk, convenient, and can end very early pregnancies. If a woman thinks she may have gotten pregnant during a particular encounter and it&apos;s a mite too late for EC, menstrual extraction could be used even before most home pregnancy tests could detect a pregnancy. And if she&apos;s not pregnant, she would simply have a shorter, lighter period. ","user_id":"sweetsuds","fromReply":[38,42,86],"toReply":[1,4,7,21]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":25,"time":"Sat 06 September 2008 11:16 AM","content":"What is menstrual extraction?  Or should I google it?    If a female is sexually active, what&apos;s an 18 dollar test a month?    I&apos;ll stand by my one month policy.  There needs to be a degree of responsibility, with the man and the woman.    Offer the pregnancy tests for free.  Do what it takes.  40 million dead is far too many, in my opinion.    If nothing else, just think of the taxes that would have been generated off those individuals. ","user_id":"Fighterpilotmafia","fromReply":[27,28,32,40,56,59,67],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":26,"time":"Sat 06 September 2008 12:32 PM","content":" http://en.wikipedia.org/wiki/Menstrual_extraction   It should, IMO, be only done in regulated facilities- clinics and the like, but it&apos;s a good option. I&apos;ll agree to disagree with your one month limit, though. I just don&apos;t think it&apos;s feasible, considering certain facts about human biology.  And taxes off of what individuals? Charges for the pregnancy tests? ","user_id":"sweetsuds","fromReply":[38,42,86],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":27,"time":"Sat 06 September 2008 01:20 PM","content":"REPLYING TO Fighterpilotmafia WHO SAID: <u>\" What is menstrual extraction?  Or should I google it?    If a female is sexually active, what&apos;s an 18 dollar test a month?    I&apos;ll stand by my one month policy.  There needs to be a degree of responsibility, with the man and the woman.    Offer the pregnancy tests for free.  Do what it takes.  40 million dead is far too many, in my opinion.    If nothing else, just think of the taxes that would have been generated off those individuals.\"</u>   I can see where you are coming from, however you should know that most pregnancies are detected at 6-7 weeks, which is almost 2 month. The blood test could probably dedect it at around 4-5 weeks, but doctors would tell a woman to come back for a second test 2 or 3 weeks later. So the argument for abortion during the first month of pregnancy has no base.   I believe that abortion is a moral issue and every woman should take it up with herself of wether she wants to go against moral ground or not. I have had 4 children, my first one when I was 16. At this time in my life everybody advised me that it would be better to have an abortion. However, my innerself told me that I wont be able to cope with it. Having an abortion is a very hard decission and is not being made lightly, however, I think we should respect a woman&apos;s decission, especially in cases of incest and rape.   Also, I would like to ad, that some methodes of birth control prevent an egg from implanting into the uterus after conception. That would mean, using this kind of birth control is a form or killing.   And most of all, I would like to know where you get the fact from that black babies are higher priced in Germany? As far as I know, it is against the law in Germany to \"buy\" a child...    ","user_id":"undercoversister","fromReply":[39,51],"toReply":[1,4,7,21,25]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":28,"time":"Sat 06 September 2008 02:58 PM","content":"REPLYING TO Fighterpilotmafia WHO SAID: <u>\"  Offer the pregnancy tests for free.  Do what it takes.  40 million dead is far too many, in my opinion.    If nothing else, just think of the taxes that would have been generated off those individuals.\"</u>   40 million is a big number. I wonder about it but even if it is half true who would feed, care for and educate those children that for what ever reason posed enough of a problem for their mother she chose to terminate the pregnacy?  We head down a very dark alley with more laws about who, where and how a child would be raised. Would we also force the parent into a &apos;home&apos; where she would have to rear that child? We so hate those &apos;Welfare Mothers&apos; don&apos;t we?  If the Right to Life movement gets more Supreme Court Judges appointed they may reverse Roe/Wade. My problem is that they/you feel your moral responsibility ends there. Maybe it does but if so your Christian faith is a sham. ","user_id":"anoldnotboldrecondo","fromReply":[29,63,76],"toReply":[1,4,7,21,25]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":29,"time":"Sat 06 September 2008 03:05 PM","content":"REPLYING TO anoldnotboldrecondo WHO SAID: <u>\"   40 million is a big number. I wonder about it but even if it is half true who would feed, care for and educate those children that for what ever reason posed enough of a problem for their mother she chose to terminate the pregnacy?  We head down a very dark alley with more laws about who, where and how a child would be raised. Would we also force the parent into a &apos;home&apos; where she would have to rear that child? We so hate those &apos;Welfare Mothers&apos; don&apos;t we?  If the Right to Life movement gets more Supreme Court Judges appointed they may reverse Roe/Wade. My problem is that they/you feel your moral responsibility ends there. Maybe it does but if so your Christian faith is a sham.\"</u>   A man not wearing a rubber out of wedlock is creating 8,000,000 fetus deaths?  It&apos;s just like the military, boys. You have to cover up. ","user_id":"billbright","fromReply":[30],"toReply":[15,28]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":30,"time":"Sat 06 September 2008 03:06 PM","content":"REPLYING TO billbright WHO SAID: <u>\"   A man not wearing a rubber out of wedlock is creating 40,000,000 fetus deaths?  It&apos;s just like the military, boys. You have to cover up.\"</u>  ","user_id":"billbright","fromReply":[],"toReply":[29]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":31,"time":"Sat 06 September 2008 04:27 PM","content":"REPLYING TO mmulder67 WHO SAID: <u>\"  And part of that responsibility is deciding what kind of life  both  would have if she decides to have that child. Ending the pregnancy is taking responsibility.\"</u>  Red herring?  Ever see a case of an injustice commited (not talking social issues here either) and someone walks off scott free because it&apos;s not illegal?  You know, the guy who takes upskirt shots of women without their knwoledge and then posts them on the internet and nothing happens and there is no recourse kind of injustice?  I&apos;ve seen plenty of decisions by the Supreme Court that have no basis in the Constitution (think of the property being stolen from families and being given to big business for the supposed greater good of the community).  Lastly, ending a child&apos;s life with murder isn&apos;t taking responsibility, abstaining until you are ready to deal with a pregnancy is taking responsibility.  Liberal logic is so disturbing.  Driver:  Yeah I shot the guy in the head to put him out of his misery. Investigator:  Put him out of his misery? Driver:  Yeah, I was driving home and hit this guy right in front of his house.  He was on the side of the road in terrible agony. Investigator:  You didn&apos;t think about calling an ambulance? Driver:  Oh sure, but once you consider the outrageous costs of medical care,  hic  the lost work, his current pain, the obvious fact that he&apos;s dirt poor... staggers about before regaining his balance  you see that Pinto he&apos;s got parked in the driveway of that single-wide?...and would have to spend years in rehab...look at how twisted his legs and arms are...I figured the right thing to do was to prevent any difficulties in life for him. Investigator:  Wow.  You seem rather detatched from the tragedy that&apos;s occured. Driver:  Detached?  I did the responsible thing.  What should I feel for being responsible? Investigator:  (looking at the empties strewn about the driver&apos;s car)  Sir, Have you been drinking? Driver:   almost falls over laughing  Oh yeah, I&apos;m frickin&apos; hammered. Investigator:  Thanks, for being Frank... Driver:  My name&apos;s not Frank... smiles  Investigator:  You said you were being responsible by ending that guy&apos;s life.  Wouldn&apos;t it have been responsible to not have been drinking in the first place? Driver:  Dude!  It was lady&apos;s night and I almost scored and this guy didn&apos;t have anything worth living for. ","user_id":"Silverbusa","fromReply":[36,50,52,55],"toReply":[3,6,8,10,17]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":32,"time":"Sat 06 September 2008 04:27 PM","content":"REPLYING TO Fighterpilotmafia WHO SAID: <u>\" You know what I&apos;d really like to see?  At the very least, a form that the patient has to sign with the statement:    \"I hereby acknowledge that in proceeding with said abortion, I am putting to death a human child.\"    Just to admit it.  Just to throw the outrageous claim of &apos;choice&apos; out the window.  Sure, it&apos;s a choice.  But it is a choice to kill a baby.\"</u>  Since you have avoided answering this before, please explain why the government should be able to FORCE a woman to put up with the pain and risk of carrying and delivering a baby but YOU can not be FORCE to take less risky and painful actions to save a life? For example   Donate blood    Donate bone marrow   Donate skin Or even actions such as donate a kidney or a part of the liver. ","user_id":"rayld2","fromReply":[33,41,57,61],"toReply":[1,4,7,21,25]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":33,"time":"Sat 06 September 2008 04:34 PM","content":"REPLYING TO rayld2 WHO SAID: <u>\"  Since you have avoided answering this before, please explain why the government should be able to FORCE a woman to put up with the pain and risk of carrying and delivering a baby but YOU can not be FORCE to take less risky and painful actions to save a life? For example   Donate blood    Donate bone marrow   Donate skin Or even actions such as donate a kidney or a part of the liver.\"</u>  The woman put herself in the position to be pregnant in the first place.  Does she have any responsibility to avoid getting pregnant (the only sure way is abstinence) until she is ready to have kids or is it everyone else&apos;s responsibility to pick up her slack so she won&apos;t murder her child because she just had to have sex? ","user_id":"Silverbusa","fromReply":[36,50,52,55],"toReply":[32]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":34,"time":"Sat 06 September 2008 05:13 PM","content":"Well i would like to see more rights for the father.  If the woman chooses to keep the baby the father is on the hook for payment until the kid is 18.  BUT if the father wants to keep the baby and the mother wants to terminate he has no say so whatsoever.  The father is half of that child, yet he has no say.  How is that fair or even legal.","user_id":"Fin_atic","fromReply":[35,45,53],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":35,"time":"Sat 06 September 2008 05:26 PM","content":"REPLYING TO Fin_atic WHO SAID: <u>\" Well i would like to see more rights for the father.  If the woman chooses to keep the baby the father is on the hook for payment until the kid is 18.  BUT if the father wants to keep the baby and the mother wants to terminate he has no say so whatsoever.  The father is half of that child, yet he has no say.  How is that fair or even legal.\"</u>   That could get tricky to legislate, though, especially if the parties don&apos;t agree. To force a woman to endure a pregnancy is cruel; it&apos;s also unfair to force a man to be connected to a child he made reasonable efforts to avoid bringing into the world- assuming he did. But it&apos;s also unfair to bring a child into the world that will be fought over and through because her/his parents can&apos;t come to some reasonable agreement. ","user_id":"sweetsuds","fromReply":[38,42,86],"toReply":[34]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":36,"time":"Sat 06 September 2008 06:23 PM","content":"REPLYING TO Silverbusa WHO SAID: <u>\"  The woman put herself in the position to be pregnant in the first place.  Does she have any responsibility to avoid getting pregnant (the only sure way is abstinence) until she is ready to have kids or is it everyone else&apos;s responsibility to pick up her slack so she won&apos;t murder her child because she just had to have sex?\"</u>   What happens when the woman has taken every reasonable precaution in regards to birth control and it still fails and she becomes pregnant? ","user_id":"liberal90","fromReply":[46],"toReply":[5,9,11,16,31,33]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":37,"time":"Sat 06 September 2008 06:30 PM","content":"This as everyone knows is a topic that had been beaten, hacked, mutilated to death.   But let me pose some questions. Some believe that abortion is the death of a human being. There is no qualifications being expressed - Abortions kills a human being.  So.  1. If abortion consists of taking a human life, no different than taking any other human life, would it be proper then to inflict either the death penalty or life in prison (depending on whether you believe in Capital punishment)?  It would seem to automatically follow. So I ask this for those who believe abortion is murder.   Second: Most of those who want punishment for abortion, advocate little or no punishment for the woman, but harsh penalties for the abortionist. Does this make sense? The woman after all is the one who looked for, hired, and paid the \"hit man,\" who is more of an \"accessory to the crime\" then the Mr. Big, i.e., the woman who hired him.  It would seem to me, that even those who say that a fetus is a full fledged human being, in practice do NOT see the fetus as a full fledged human being.  If the fetus is such a human, why then are the proposed penalties, almost nothing for the woman, and even for the practicing abortionist, only five years. Is this not a contradiction? If a human being is a human being - Why the shilly shallying attitude?  Third. If a fetus is a full fledged human being, why are there many people who recogise an \"exception\" if the life of the woman is in danger. Is there any other legal situation in which we allow ourselves to choose which individual lives and which dies?   So once again it would seem to me that those who see the fetus as a full fledged human, are sort of hedging their bets.   Finally, while the point has been made that there is a difference between a fetus and a sperm or an egg, is there a Moral difference? Is birth control which prevents an egg being fertislised ok, different from birth control that eliminates a fertislised egg? I ask this because the second example is \"abortion\" in the moral sense of the word.  To sum up, it seems to me, that we are drawing lines in the sand, always a risky proposition. Would it not be best to draw that line, after the birth of the fetus, and declare that birth to be the moment of legal transformation?  I say this because in my opinion, birth control is morally just as much an abortion as the medical procedure.   Dave ","user_id":"Grachus","fromReply":[48],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":38,"time":"Sat 06 September 2008 07:03 PM","content":"REPLYING TO sweetsuds WHO SAID: <u>\"  http://en.wikipedia.org/wiki/Menstrual_extraction   It should, IMO, be only done in regulated facilities- clinics and the like, but it&apos;s a good option. I&apos;ll agree to disagree with your one month limit, though. I just don&apos;t think it&apos;s feasible, considering certain facts about human biology.  And taxes off of what individuals? Charges for the pregnancy tests?\"</u>   Well thank you for being civil.  We need more of that.  Agree to disagree.  Most of the time, you won&apos;t find people who either propose that or accept that.  Here, you and I have done both.        I mean taxes off the dead people.  All the tax money they would have produced would go far.  It&apos;s trite, but it has some truth to it. ","user_id":"Fighterpilotmafia","fromReply":[40,56,59,67],"toReply":[2,13,23,24,26,35]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":39,"time":"Sat 06 September 2008 07:05 PM","content":"REPLYING TO undercoversister WHO SAID: <u>\"   I can see where you are coming from, however you should know that most pregnancies are detected at 6-7 weeks, which is almost 2 month. The blood test could probably dedect it at around 4-5 weeks, but doctors would tell a woman to come back for a second test 2 or 3 weeks later. So the argument for abortion during the first month of pregnancy has no base.   I believe that abortion is a moral issue and every woman should take it up with herself of wether she wants to go against moral ground or not. I have had 4 children, my first one when I was 16. At this time in my life everybody advised me that it would be better to have an abortion. However, my innerself told me that I wont be able to cope with it. Having an abortion is a very hard decission and is not being made lightly, however, I think we should respect a woman&apos;s decission, especially in cases of incest and rape.   Also, I would like to ad, that some methodes of birth control prevent an egg from implanting into the uterus after conception. That would mean, using this kind of birth control is a form or killing.   And most of all, I would like to know where you get the fact from that black babies are higher priced in Germany? As far as I know, it is against the law in Germany to \"buy\" a child...   \"</u>   Did I say higher priced?  I meant to say highly prized.    Yup, just check it, that&apos;s what I put.  So where does this price thing come in lol? ","user_id":"Fighterpilotmafia","fromReply":[40,56,59,67],"toReply":[27]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":40,"time":"Sat 06 September 2008 07:09 PM","content":"REPLYING TO Fighterpilotmafia WHO SAID: <u>\"   Well thank you for being civil.  We need more of that.  Agree to disagree.  Most of the time, you won&apos;t find people who either propose that or accept that.  Here, you and I have done both.        I mean taxes off the dead people.  All the tax money they would have produced would go far.  It&apos;s trite, but it has some truth to it.\"</u>   Would they have produced a net benefit? As they would be unwanted children, it&apos;s quite likely that many would not get what they needed in terms of education and care early on. And poorly educated people who may not be in the best of health aren&apos;t exactly your most productive citizens. Not that this is an \"excuse\" to allow abortion, but I don&apos;t think that banning abortion would end abortion or yield loads of productive citizens. It would, however, result in a few public health issues, like coping with the aftereffects of illegal abortion (like the return of \"infected OB\" departments in hospitals), women who lack access to pre-natal care (it&apos;s a job getting pre-natal care in some places with insurance) and dealing with children who may not have well-child care. ","user_id":"sweetsuds","fromReply":[42,86],"toReply":[1,4,7,21,25,38,39]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":41,"time":"Sat 06 September 2008 07:11 PM","content":"REPLYING TO rayld2 WHO SAID: <u>\"  Since you have avoided answering this before, please explain why the government should be able to FORCE a woman to put up with the pain and risk of carrying and delivering a baby but YOU can not be FORCE to take less risky and painful actions to save a life? For example   Donate blood    Donate bone marrow   Donate skin Or even actions such as donate a kidney or a part of the liver.\"</u>   She wasn&apos;t forced to have sex Ray.  We keep shuffing off the real &apos;choice&apos; here.  That&apos;s the choice.    I don&apos;t remember the law, and I&apos;ll have to do some research...but in the case of a national crisis I think the gov can force you to give blood, if you&apos;re able.  But I know what you&apos;re saying.    I just disagree with it and I feel that sex resulting in unwanted pregnancy is different that donating blood, skin or bone marrow. ","user_id":"Fighterpilotmafia","fromReply":[56,59,67],"toReply":[32]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":42,"time":"Sat 06 September 2008 07:27 PM","content":"REPLYING TO sweetsuds WHO SAID: <u>\"   Would they have produced a net benefit? As they would be unwanted children, it&apos;s quite likely that many would not get what they needed in terms of education and care early on. And poorly educated people who may not be in the best of health aren&apos;t exactly your most productive citizens. Not that this is an \"excuse\" to allow abortion, but I don&apos;t think that banning abortion would end abortion or yield loads of productive citizens. It would, however, result in a few public health issues, like coping with the aftereffects of illegal abortion (like the return of \"infected OB\" departments in hospitals), women who lack access to pre-natal care (it&apos;s a job getting pre-natal care in some places with insurance) and dealing with children who may not have well-child care.\"</u>   Granted, a minority of those people who aren&apos;t here that would have been, would have been a drain on society.  But I feel that the good outweighs the bad.  I think there would be far more good than bad in the situation.  But who really knows?  I read somewhere before that crime in NY and all across the US was going to skyrocket in the 90&apos;s.  It kept going up and up and up.  All of a sudden, crime just went way down, early 90&apos;s I think.  This coincides with when abortion became legal.  There are many who draw a line from that.  They feel that if abortions hadn&apos;t been made legal, America would have been over run with crime.  Who knows?  I do see the logic in that, though.  As for the comment on what should we do with mothers who procede with the abortion?  I saw a guy on youtube asking protesters the same thing outside clinics.  They really didn&apos;t know, and the guy thought he was the cat&apos;s meow because of that fact.  I&apos;ve got a solution.  Sterilize them.  It&apos;s harsh, but it&apos;s a punishment.  And no more abortions. ","user_id":"Fighterpilotmafia","fromReply":[56,59,67],"toReply":[2,13,23,24,26,35,40]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":43,"time":"Sat 06 September 2008 07:55 PM","content":"It is hard to predict something like crime rates due to abortion laws, but it&apos;s easier to link abortion laws to issues like numbers of women with infections affecting the reproductive organs and rendered infertile or disabled due to same, birth defects or complications due to attempts at illegal abortion, numbers of infants abandoned and/or killed, and other serious public health issues that are the risks entailed with abortion bans. It would be far healthier to further efforts to prevent unwanted pregnancies and make adoption a better option. ","user_id":"sweetsuds","fromReply":[86],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":44,"time":"Sat 06 September 2008 07:56 PM","content":"I don&apos;t think the government should be in this issue.  I don&apos;t see how anyone can possibly explain away the fact that once an egg is fertilized it is a living being. Some societies consider a child to be a year old when it is born.  I have always heard discussion on this issue, and it was always a decision between the father, mother, and doctor, but it was usually because of a health risk to the child or mother. If it was an unwanted pregnancy, a family member somewhere usually raised it, or it was put up for adoption. (In more recent times I actually knew a women who used this as a \"birth control\" method.  Unsat.) In this time the problem of ignorance, selfishness, and irresponsibility with the use of harmful practices (drugs, enviornment, etc.) make it even more of a complicated issue, I know. Love and concern would help.   I have always desired to do, and see, programs wherein a mother who wishes to keep her baby, but has been abandoned by whomever could stay in a nice house, be active in choirs, cooking , etc; learn methods of child care, and relationships. Women from the community could teach the womanly arts, exercise programs, yoga, etc on a volunteer basis. After the child is born have six months to visit a career/job/mental health councilor, work, get housing, and integrate back into society.   Abstinence is possible. Men need to use protection!! Somehow we skip right over the responsibility of men to stop...think, and get married if they just can&apos;t control themselves. This is not a national sport. It is the life of a prescious, prescious child, and men should be held just as accountable. It should be considered a dishonor to \"knock someone up\", instead of a great feat of accomplishment. Anyone can do that.  This is not an unrealistic venture providing it be kept in the civilian sector with little government involvement...just community, churches, volunteers, donations, etc. Waivers would have to be signed, of course for liability purposes, and if the woman choose not to go along with the program then find their own means. Bring back the human, family, community concept.  Don&apos;t leave this burden on society, the government, and clinics! ","user_id":"Tower_Flower","fromReply":[71],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":45,"time":"Sat 06 September 2008 10:23 PM","content":"REPLYING TO Fin_atic WHO SAID: <u>\" Well i would like to see more rights for the father.  If the woman chooses to keep the baby the father is on the hook for payment until the kid is 18.  BUT if the father wants to keep the baby and the mother wants to terminate he has no say so whatsoever.  The father is half of that child, yet he has no say.  How is that fair or even legal.\"</u>  Isn&apos;t it a basic leadership concept that you cannot logically hold somebody responsible if you do not also empower them.  That&apos;s the problem here.  The person with the ultimate power (whether or not to get pregnant and whether or not to get an abortion) is the female and she is being given every excuse for not taking responsibility.  yet the person with the least amount of power is being asked to step in and take responsibility.  Amazingly twisted logic there.  Good post Fin. ","user_id":"Silverbusa","fromReply":[50,52,55],"toReply":[34]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":46,"time":"Sat 06 September 2008 10:27 PM","content":"REPLYING TO liberal90 WHO SAID: <u>\"   What happens when the woman has taken every reasonable precaution in regards to birth control and it still fails and she becomes pregnant?\"</u>  A woman who takes every reasonable precaution in regards to birth control is aware that she still risks pregnancy when she sleeps with a guy.  A woman who takes the appropriate precaution in regards to birth control (abstinence) has zero risk of getting pregnant unless she is raped.  One is in control of the situation and assumes repsonsiblity because she is knowingly taking a risk.  The second has done EVERYTHING in her power to avoid getting pregnant and she should be assisted in every way for doing the right thing should she be victimized.  Do you still believe a woman sleeping around but is popping a pill is absolved of the repsonsibility of murdering a child when she chooses abortion? ","user_id":"Silverbusa","fromReply":[50,52,55],"toReply":[36]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":47,"time":"Sat 06 September 2008 10:37 PM","content":"In order to keep this discussion going, I thought I would throw in some facts:  21  feel that they do not have the financial resources to bring up a child.    21  feel that they are not ready for the responsibility of raising a child.    16  feel that their life would be changed too much. She might have a plan for her future (education, developing a career, etc.) that does not allow for having a child at the present time. She might be looking after an elderly parent and does not have sufficient time or energy to commit to a baby.    12  feel that her relationship with her partner is in difficulty.    11  feel that they are too young, and not sufficiently mature to become a mother.    In 8  of the cases, her children are grown and she does not want to start another family, or she has all the children that she wants.   Some of these reasons may be influenced by: Pressure from the father or from her parents to have an abortion.    She feels that she lacks the emotional and physical strength to go through another pregnancy and raise the child.    She believes that raising an additional child would short-change her existing children.    She is a student and/or without a partner; she feels that raising a child would be too difficult and disruptive at her time in life.    She doesn&apos;t want other people to know that she became pregnant.    A child would interfere with her career or education.    She may fear physical abuse from a parent if they learn of her pregnancy.    She may fear being tossed out onto the street by a parent if they learn of her pregnancy.    In the case of a multiple pregnancy, the woman may be faced with giving birth to more newborns than she feels she can deal with.    That being tosses out there....it looks like all of those \"circumstances\" could be changed for the better, so that pregnant woman wont feel the way they do right now. I think this is the key to reduce abortions and no matter what party affiliation, I think we can all agree that we would like to see the number of abortions reduced. ","user_id":"undercoversister","fromReply":[51],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":48,"time":"Sat 06 September 2008 10:57 PM","content":"REPLYING TO Grachus WHO SAID: <u>\" This as everyone knows is a topic that had been beaten, hacked, mutilated to death.   But let me pose some questions. Some believe that abortion is the death of a human being. There is no qualifications being expressed - Abortions kills a human being.  So.  1. If abortion consists of taking a human life, no different than taking any other human life, would it be proper then to inflict either the death penalty or life in prison (depending on whether you believe in Capital punishment)?  It would seem to automatically follow. So I ask this for those who believe abortion is murder.   Second: Most of those who want punishment for abortion, advocate little or no punishment for the woman, but harsh penalties for the abortionist. Does this make sense? The woman after all is the one who looked for, hired, and paid the \"hit man,\" who is more of an \"accessory to the crime\" then the Mr. Big, i.e., the woman who hired him.  It would seem to me, that even those who say that a fetus is a full fledged human being, in practice do NOT see the fetus as a full fledged human being.  If the fetus is such a human, why then are the proposed penalties, almost nothing for the woman, and even for the practicing abortionist, only five years. Is this not a contradiction? If a human being is a human being - Why the shilly shallying attitude?  Third. If a fetus is a full fledged human being, why are there many people who recogise an \"exception\" if the life of the woman is in danger. Is there any other legal situation in which we allow ourselves to choose which individual lives and which dies?   So once again it would seem to me that those who see the fetus as a full fledged human, are sort of hedging their bets.   Finally, while the point has been made that there is a difference between a fetus and a sperm or an egg, is there a Moral difference? Is birth control which prevents an egg being fertislised ok, different from birth control that eliminates a fertislised egg? I ask this because the second example is \"abortion\" in the moral sense of the word.  To sum up, it seems to me, that we are drawing lines in the sand, always a risky proposition. Would it not be best to draw that line, after the birth of the fetus, and declare that birth to be the moment of legal transformation?  I say this because in my opinion, birth control is morally just as much an abortion as the medical procedure.   Dave\"</u>  The idea is killing one instance and murder in another.  Killing is seen as moral or legal taking of a life as in self-defense, execution because of a crime committed, or national defense.  Murder on the other hand is the unlawful or immoral taking of life.  An aborted child comes most often as the result of a woman who had consensual sex with no intent of having and keeping a child.  The situation of getting pregnant is avoidable in these cases but a priority of sexual gratification is made over the life of the resulting child.  In the case of an execution someone has forfeited their own life (not another&apos;s) by their actions.  They are guilty where in the previous scenario, the executee is not.  You say \"Most of those who want punishment for abortion, advocate little or no punishment for the woman, but harsh penalties for the abortionist.\"  To be honest, I&apos;ve never met a person who&apos;s advocated that.  Those I know who oppose abortion merely want the procedure to be illegal for all or some abortions.  The only time an abortionist would be \"punished\" fpr an abortion is if they knowingly performed an illegal abortion.  You ask about choosing who lives and who dies in a legal situation.  And the answer is a simple yes.  A police officer has the right to kill a person who is threatening the life of another and is in the position to make it happen.  You also ask the difference between egg, sperm, and fetus.  An egg alone cannot produce a human.  A sperm alone cannot produce a human.  A fertilized egg is the most basic stage of human life.  To answer the follow up question about birth control that prevents a fertilized egg from taking hold and the birth control that prevents an egg from being fertilized, there is an obvious difference.  The easiest answer that solves all the problems except the supposed need that a person just has to have sex is that one abstain.  I see one form of BC as particularly reprehensible because as you state it is a form of abortion.  It&apos;s easy to say wait for the birth to be the point a person is declared human but it ignores all kinds of biology in doing so. ","user_id":"Silverbusa","fromReply":[50,52,55],"toReply":[37]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":49,"time":"Sat 06 September 2008 10:59 PM","content":"  The question is actually not whether we become humans at conception or not. I think life begins at conception...even before that. However, I do not believe that a 8 weeks old fetus should receive human rights. ","user_id":"undercoversister","fromReply":[51],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":50,"time":"Sun 07 September 2008 01:14 AM","content":"REPLYING TO Silverbusa WHO SAID: <u>\"  Red herring?  Ever see a case of an injustice commited (not talking social issues here either) and someone walks off scott free because it&apos;s not illegal?  You know, the guy who takes upskirt shots of women without their knwoledge and then posts them on the internet and nothing happens and there is no recourse kind of injustice?  I&apos;ve seen plenty of decisions by the Supreme Court that have no basis in the Constitution (think of the property being stolen from families and being given to big business for the supposed greater good of the community).  Lastly, ending a child&apos;s life with murder isn&apos;t taking responsibility, abstaining until you are ready to deal with a pregnancy is taking responsibility.  Liberal logic is so disturbing.  Driver:  Yeah I shot the guy in the head to put him out of his misery. Investigator:  Put him out of his misery? Driver:  Yeah, I was driving home and hit this guy right in front of his house.  He was on the side of the road in terrible agony. Investigator:  You didn&apos;t think about calling an ambulance? Driver:  Oh sure, but once you consider the outrageous costs of medical care,  hic  the lost work, his current pain, the obvious fact that he&apos;s dirt poor... staggers about before regaining his balance  you see that Pinto he&apos;s got parked in the driveway of that single-wide?...and would have to spend years in rehab...look at how twisted his legs and arms are...I figured the right thing to do was to prevent any difficulties in life for him. Investigator:  Wow.  You seem rather detatched from the tragedy that&apos;s occured. Driver:  Detached?  I did the responsible thing.  What should I feel for being responsible? Investigator:  (looking at the empties strewn about the driver&apos;s car)  Sir, Have you been drinking? Driver:   almost falls over laughing  Oh yeah, I&apos;m frickin&apos; hammered. Investigator:  Thanks, for being Frank... Driver:  My name&apos;s not Frank... smiles  Investigator:  You said you were being responsible by ending that guy&apos;s life.  Wouldn&apos;t it have been responsible to not have been drinking in the first place? Driver:  Dude!  It was lady&apos;s night and I almost scored and this guy didn&apos;t have anything worth living for.\"</u>  You cannot force society to conform to your personal moral standards. Sex between consenting adults is not, has not and never will be illegal. You disapprove of abortion. I get that. But you are not going to force anyone to have a child they don&apos;t want...unless you are willing to bear all the costs associated with that child. Abstinence is a great theory. It&apos;s never going to happen. Why??? Inherent biological traits for reproduction. Our bodies practically force us to copulate. Making the personal choice of whether or not having a child is the right thing is not our right to legislate. As for your little parable...well you forgot about the wife and three kids that guy was supporting. Not quite the same a fetus that is or isn&apos;t fully developed into a human.","user_id":"mmulder67","fromReply":[66,75],"toReply":[5,9,11,16,31,33,45,46,48]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":51,"time":"Sun 07 September 2008 12:41 PM","content":"REPLYING TO undercoversister WHO SAID: <u>\"   The question is actually not whether we become humans at conception or not. I think life begins at conception...even before that. However, I do not believe that a 8 weeks old fetus should receive human rights.\"</u>       ","user_id":"Tower_Flower","fromReply":[71],"toReply":[27,47,49]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":52,"time":"Sun 07 September 2008 02:52 PM","content":"REPLYING TO Silverbusa WHO SAID: <u>\"  The idea is killing one instance and murder in another.  Killing is seen as moral or legal taking of a life as in self-defense, execution because of a crime committed, or national defense.  Murder on the other hand is the unlawful or immoral taking of life.  An aborted child comes most often as the result of a woman who had consensual sex with no intent of having and keeping a child.  The situation of getting pregnant is avoidable in these cases but a priority of sexual gratification is made over the life of the resulting child.     I always find the above odd. No offense, but generally speaking even married couples have sex far more often then the simple need for reproduction. May I suggest that if the above is a legitimate criterium, then sex for other than reproductive reasons be outlawed? After all, condemns fail, some birth control pills are actually refurbished gummy bears made in China, and as we always say, \"Schit happens.\"  Can a mass of undifferentiated cells be declared a human being with all the rights guaranteed? And if this is true, what is the moral difference in one mass of cells and another?     Is it not true that the fertilised egg has about as much chance of developing into a human being as the egg alone, if it wasn&apos;t for the human being who is carrying them? Would it not be fair to say that the decision to carry that fetus should be the decision of that human being?    quote:  Originally posted by Silverbusa: It&apos;s easy to say wait for the birth to be the point a person is declared human but it ignores all kinds of biology in doing so.\"</u>   I agree. I would like a cut and dried, unequivocal answer that is not messed up with moral questions or when this cell or that becomes a human being.   So for example the Catholic Church seeks this unequivocal answer by saying that birth control IS the moral equivalent of abortion. Others set the boundry later, and others set the boundry even later then that.  But I agree with the logic, if not the conclusions of the Catholic Chruch. To prevent the fertilisation of an egg that would be otherwise fertilised is moraly the same as a full fledged abortion.   If I create a situation that leads to a death, legally I am considered culpable, and if not charged with murder itself, I can be charged with \"Man Slaughter,\" or \"Negiligent Homicide.\"  I solve this delemma by declaring that Birth itself is the moral line in the sand.   But while I respect your opinion, you are not actually acting on your opinion. If aborting a fetus is indeed Murder, why then are you not advocating the penalties we normally assign to killers? And to add insult to injury, the one who is really responsible gets off free, while we reserve whatever penalties to the \"accessory\" to the crime.  Dave   I bumped this post of mine, because I STILL don&apos;t see anyone advocating life in prison, or the death penalty for abortion.   If you DON&apos;T advocate it, then you really don&apos;t believe abortion is killing a human being.  Dave ","user_id":"Grachus","fromReply":[],"toReply":[5,9,11,16,31,33,45,46,48]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":53,"time":"Sun 07 September 2008 03:59 PM","content":"REPLYING TO Fin_atic WHO SAID: <u>\" Well i would like to see more rights for the father.  If the woman chooses to keep the baby the father is on the hook for payment until the kid is 18.  BUT if the father wants to keep the baby and the mother wants to terminate he has no say so whatsoever.  The father is half of that child, yet he has no say.  How is that fair or even legal.\"</u>   Y&apos;want to play, y&apos;gotta pay. Wear a rubber next time. The woman could have terminated the child and she didn&apos;t. Would you have preferred that she did? The minute you leave all the responsibility of contraceptive up to her, you forfeit your choice and give it to her.   She has the pleasure of carrying it to term while he&apos;s out hunting for new meat.  To me the abortion issue is a women&apos;s issue. Men shouldn&apos;t get a vote until they are universally ready to wear a rubber during sex. ","user_id":"billbright","fromReply":[],"toReply":[34]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":54,"time":"Sun 07 September 2008 05:11 PM","content":" You don&apos;t think abstinence is a possible alternative?    ","user_id":"USAF_76_2_80","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":55,"time":"Sun 07 September 2008 05:17 PM","content":"REPLYING TO Silverbusa WHO SAID: <u>\"  The woman put herself in the position to be pregnant in the first place.  Does she have any responsibility to avoid getting pregnant (the only sure way is abstinence) until she is ready to have kids or is it everyone else&apos;s responsibility to pick up her slack so she won&apos;t murder her child because she just had to have sex?\"</u>   So because YOU disagree with the woman having sex she should be forced to accept the pain and risk of a delivery. ","user_id":"rayld2","fromReply":[57,61],"toReply":[5,9,11,16,31,33,45,46,48]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":56,"time":"Sun 07 September 2008 05:22 PM","content":"REPLYING TO Fighterpilotmafia WHO SAID: <u>\"   She wasn&apos;t forced to have sex Ray.  We keep shuffing off the real &apos;choice&apos; here.  That&apos;s the choice.    I don&apos;t remember the law, and I&apos;ll have to do some research...but in the case of a national crisis I think the gov can force you to give blood, if you&apos;re able.  But I know what you&apos;re saying.    I just disagree with it and I feel that sex resulting in unwanted pregnancy is different that donating blood, skin or bone marrow.\"</u>   In what way is it different other than that one does NOT affect YOU personally and the other does? Please be specific and just for you information I do NOT consider she had sex or my religion (religous leaders) says so to be acceptable answers. ","user_id":"rayld2","fromReply":[57,61],"toReply":[1,4,7,21,25,38,39,41,42]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":57,"time":"Sun 07 September 2008 09:18 PM","content":"REPLYING TO rayld2 WHO SAID: <u>\"   In what way is it different other than that one does NOT affect YOU personally and the other does? Please be specific and just for you information I do NOT consider she had sex or my religion (religous leaders) says so to be acceptable answers.\"</u>    What an obtuse statement Ray.    How is it different?  How is killing a baby different than giving blood?    Hmmmmmmmmmm.  What are you getting at?  Are you saying that if I don&apos;t give blood that it&apos;s the same as killing a baby?  On the off chance that my pint might save someone, somewhere, at some point in time?    No.  One is the direct killing of another.  It&apos;s an apples to oranges response Ray, and it&apos;s doesn&apos;t belong in this forum.    By the by, I do give blood.      I would give bone marrow if someone came up and needed it.  There aren&apos;t exactly bone marrow drives in my part of the country, and from what I hear it&apos;s not a sit down for thirty minutes procedure. ","user_id":"Fighterpilotmafia","fromReply":[59,67],"toReply":[32,55,56]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":58,"time":"Mon 08 September 2008 12:41 AM","content":"You cannot legislate an inherent right that any individual has just because you don&apos;t think it&apos;s morally correct. Until you are willing and able to accept all the reponsibilities involved then you have no right to tell anyone what they can or cannot do with their own bodies when it has no effect on your quality of life. Some strange woman that has an abortion does not change your personal life in any way, shape or form.","user_id":"mmulder67","fromReply":[66,75],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":59,"time":"Mon 08 September 2008 05:37 AM","content":"REPLYING TO Fighterpilotmafia WHO SAID: <u>\"   Your statement   quote:  How is it different? How is killing a baby different than giving blood?\"</u> shows how you are twisting the issue. I asked how using the government to FORCE someone to carry and deliver a child was different than the government FORCING someone to donate blood, donate bonemarrow, etc. I did not ask how giving blood was different than killing a baby. Try answering the ACTUAL question rather than making up your own question.  I have also asked if YOU support giving the government the power to FORCE people to donate blood, bonemarrow, etc. If you support giving the government this type of power where would you draw the line? Would you allow the government to force donation of part of a liver? How about forcing the donation a kidney if you have two healthy ones? ","user_id":"rayld2","fromReply":[61],"toReply":[1,4,7,21,25,38,39,41,42,57]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":60,"time":"Mon 08 September 2008 12:47 PM","content":"I agree that it then becomes a matter of giving up more of our rights...period, and the actual issues get lost anyway (whether it be planting in the full moon, or abortion)! ","user_id":"Tower_Flower","fromReply":[71],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":61,"time":"Mon 08 September 2008 03:08 PM","content":"REPLYING TO rayld2 WHO SAID: <u>\" shows how you are twisting the issue. I asked how using the government to FORCE someone to carry and deliver a child was different than the government FORCING someone to donate blood, donate bonemarrow, etc. I did not ask how giving blood was different than killing a baby. Try answering the ACTUAL question rather than making up your own question.  I have also asked if YOU support giving the government the power to FORCE people to donate blood, bonemarrow, etc. If you support giving the government this type of power where would you draw the line? Would you allow the government to force donation of part of a liver? How about forcing the donation a kidney if you have two healthy ones?\"</u>    This is why it&apos;s so hard to have a debate with you.  I can accent the word force, I can accent the word is...........The End Result Of Abortion Is Death To An Innocent Child.  The End Result Of Me Giving Or Not Giving Blood Is WHO KNOWS????  Maybe it will save a life, maybe it won&apos;t.  Maybe it will be thrown away after a certain time period.  As for you accenting the term force.....nobody &apos;forced&apos; the woman to have sex to become pregnant.  Unless it was rape, you cannot use that statement.  That&apos;s why it&apos;s different.    Forced to give blood.....I had no choice to have blood in my body in the first place.  Forced to have a baby.....you have a choice to have that baby in you or not.  If you took all the protection you could....too bad.  There is still a way to never be pregnant in the frist place.  That&apos;s the difference.  Am I clear enough?  You cannot compare the forced removal of a kidney..something I have no choice in having in my body or not, to the forced keeping of a baby.  Something the female and male in question HAD A CHOICE OF BRINGING ABOUT.  Don&apos;t want a kid?  Don&apos;t have sex.  Don&apos;t push it off by killing the baby.  The fact that we are talking about this astounds me.  Women and their liberal counterparts keep screaming of this choice they want.  THEY ALREADY HAVE A CHOICE!  People are pretending it&apos;s not their fault that they got pregnant, and how dare we decry the fact that they are killing American babies.  How dare them. ","user_id":"Fighterpilotmafia","fromReply":[67],"toReply":[32,55,56,59]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":62,"time":"Mon 08 September 2008 07:26 PM","content":"\"Women and their liberal counterparts keep screaming of this choice they want.\"  All women?  If you&apos;re a man, you display a great deal of arrogance in deciding for women what is best for them. I don&apos;t think men should be in the abortion debate at all.  I, personally, don&apos;t know whether killing a fetus kills a \"baby.\" It&apos;s a matter of description. Something is certainly being killed.   But, regarding abortion, I don&apos;t think it should be left to a man; that&apos;s women&apos;s business. Our business is in making sure they don&apos;t need one in the first place. If we could do what is morally assigned to us, there&apos;d be no problem. Wear a rubber, men. Man up. ","user_id":"billbright","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":63,"time":"Mon 08 September 2008 11:53 PM","content":"REPLYING TO anoldnotboldrecondo WHO SAID: <u>\" If you demand that every pregnacy is carried to term by force of the law then get you body out in front of an abortion clinic peacefully, accompanied by a lawyer, to create a binding contract with the mother to financially support that child to age 18.  If you will not do that you are a hypocrite that wants the law to rule others lives in terms of your morals and ideas while you accept zero responsibility for the child.\"</u>   So a mother can kill an unborn child because of economic reasons, so should it be legal for parents to kill their children after they are born because of financial hardship. That answer is obviously no, so why is alright to kill an unborn child because of money issues. ","user_id":"nspreitler","fromReply":[64],"toReply":[15,28]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":64,"time":"Tue 09 September 2008 12:53 AM","content":"REPLYING TO nspreitler WHO SAID: <u>\"   So a mother can kill an unborn child because of economic reasons, so should it be legal for parents to kill their children after they are born because of financial hardship. That answer is obviously no, so why is alright to kill an unborn child because of money issues.\"</u>  Then it should be illegal to end a pregnancy where the child is known to have severe deformities...after all financial issues are irrelevant. Nevermind that those that \"chose\" to have a child also \"chose\" any financial difficulties associated with it. Are you prepared to give up some of what you have in support of those you are forcing your moral standards on? If not, then you are a hypocrite.","user_id":"mmulder67","fromReply":[66,75],"toReply":[63]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":65,"time":"Tue 09 September 2008 01:14 AM","content":"REPLYING TO FighterPilotMafia WHO SAID: <u>\" I just disagree with it and I feel that sex resulting in unwanted pregnancy is different that donating blood, skin or bone marrow.\"</u>  There&apos;s lot&apos;s of things that I disagree with but making my moral objections to them, enforced by the government, does not give others the ability to exercise their rights. And that is why abortion is legal and should stay that way. You will never get us to start telling an individual what they can do with their own body when it has no impact on your life. That is a path that we will regret if it comes to pass. Where will it stop? You have 2 kidneys, and that person needs only one to live so we are taking one of yours whether you like it or not.  The death penalty is legal. Do you agree with it? Sure, \"the unborn baby hasn&apos;t committed a crime\", might be your conscious&apos; appeasement way of thinking but it is the exact same thing by your definitions. Taking the life of someone, regardless of circumstances. What it boils down to is that you want to regulate the human need to procreate by enforcing the natural outcome of that need, thereby forcing individuals to repress their urges. Got news for ya buddy...next is that beer you like to drink. It causes harm to not only your body but if not utilized in the right environment you might take someone&apos;s life and we can&apos;t have that. Therefore, your urge to drink will henceforth be repressed as beer will no longer be available in the manner we are accustomed to. Sound far fetched? Not when you open the door to legislating human \"urges\"....","user_id":"mmulder67","fromReply":[66,75],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":66,"time":"Tue 09 September 2008 05:51 AM","content":"REPLYING TO mmulder67 WHO SAID: <u>\"  Then it should be illegal to end a pregnancy where the child is known to have severe deformities...after all financial issues are irrelevant. Nevermind that those that \"chose\" to have a child also \"chose\" any financial difficulties associated with it. Are you prepared to give up some of what you have in support of those you are forcing your moral standards on? If not, then you are a hypocrite.\"</u>   Just my two cents, I hate getting involved in debates like this because I know SOMEONE is going to bite my head off, depending on what side of the fence they sit on. But, I just wanted to say that I do believe abortion is killing a human child. Even in situations where it was a consequence of rape, or incest, it&apos;s still killing a human child. I don&apos;t however, believe that the choice should be taken away from women. I know that if I were raped and a child was the consequence of it, there&apos;s no way that I would want to carry around a daily reminder of such a vicious attack for 9 months. There&apos;s just no way to regulate this that would appease everyone that has an opinion about it, because then you get into gray areas, like, well what if it&apos;s going to harm the mother...or the baby has birth defects that are known early in the pregancy?....You can&apos;t just sit a woman down in an abortion clinic and ask prior to the procedure...\"well, how did this happen? were you being irresponsible and end up knocked up? yes? ok, then you can&apos;t have an abortion.\" Personally, I think that abortion is too easy an out for irresponsible behavior, I also don&apos;t think that the choice should be taken away.   Reason I responded to this quote is because I don&apos;t agree with the above statement about giving up some of what i have in support of the child...I&apos;m not the one that engaged in irresponsible behavior and ended up pregnant, so those that are against abortion should not be financially liable for a child just because of their beliefs. It&apos;s pretty easy to not get pregnant....don&apos;t have sex if you&apos;re not completely willing to accept the possible consequences of your actions.  One last thing, read a post a little while ago that said pregnancy may not show on a test until the 4-5 week mark. There are a lot of tests out there that will let you know you&apos;re pregnant before you even miss a period.   Bumper sticker i saw: \"If it&apos;s not a baby....you&apos;re not pregnant\" ","user_id":"Angie1228","fromReply":[68,78],"toReply":[3,6,8,10,17,50,58,64,65]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":67,"time":"Tue 09 September 2008 07:08 AM","content":"REPLYING TO Fighterpilotmafia WHO SAID: <u>\"    This is why it&apos;s so hard to have a debate with you.  I can accent the word force, I can accent the word is...........The End Result Of Abortion Is Death To An Innocent Child.  The End Result Of Me Giving Or Not Giving Blood Is WHO KNOWS????  Maybe it will save a life, maybe it won&apos;t.  Maybe it will be thrown away after a certain time period.  As for you accenting the term force.....nobody &apos;forced&apos; the woman to have sex to become pregnant.  Unless it was rape, you cannot use that statement.  That&apos;s why it&apos;s different.    Forced to give blood.....I had no choice to have blood in my body in the first place.  Forced to have a baby.....you have a choice to have that baby in you or not.  If you took all the protection you could....too bad.  There is still a way to never be pregnant in the frist place.  That&apos;s the difference.  Am I clear enough?  You cannot compare the forced removal of a kidney..something I have no choice in having in my body or not, to the forced keeping of a baby.  Something the female and male in question HAD A CHOICE OF BRINGING ABOUT.  Don&apos;t want a kid?  Don&apos;t have sex.  Don&apos;t push it off by killing the baby.  The fact that we are talking about this astounds me.  Women and their liberal counterparts keep screaming of this choice they want.  THEY ALREADY HAVE A CHOICE!  People are pretending it&apos;s not their fault that they got pregnant, and how dare we decry the fact that they are killing American babies.  How dare them.\"</u>   Yes it is clear you again are trying to avoid answering the question I actually asked which IMO is dishonest. ","user_id":"rayld2","fromReply":[],"toReply":[1,4,7,21,25,38,39,41,42,57,61]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":68,"time":"Tue 09 September 2008 10:21 AM","content":"REPLYING TO Angie1228 WHO SAID: <u>\"  Reason I responded to this quote is because I don&apos;t agree with the above statement about giving up some of what i have in support of the child...I&apos;m not the one that engaged in irresponsible behavior and ended up pregnant, so those that are against abortion should not be financially liable for a child just because of their beliefs.  Therefore they should not be allowed to force their beliefs on others.  It&apos;s pretty easy to not  get pregnant   get arrested for DUI   get lung cancer   get mugged ....don&apos;t  have sex   drink alcohol   smoke cigarettes   leave your house  if you&apos;re not completely willing to accept the possible consequences of your actions.\"</u>  Where do get the idea that you can force anyone to do what you think they should do and then abdicate your responsibility for that decision?","user_id":"mmulder67","fromReply":[75],"toReply":[66]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":69,"time":"Tue 09 September 2008 10:29 AM","content":"I would love to see some real numbers that show the majority of females who have abortions have the intelligence, maturity, financial resourses and family or peer support to be successful in rearing a child.  We would all like see those babies, fetus, embryo or whatever grow up to run for President but without massive and I mean massive socialistic support most have zero chance of even living a decent, productive life.  Force the birth then bear the burden. Or be still and pray for the souls. ","user_id":"anoldnotboldrecondo","fromReply":[76],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":70,"time":"Tue 09 September 2008 11:07 AM","content":"You know what, where I grew up if any of those factors were the deciding factor, there would be no babies in town..    Love, family, community, fortitude, hard work and a one room  schoolhouse put out some the finest citizens this country could ever want.  An occasional \"run-in\" with Mr. Fist or Budweiser might disrupted the flow........There just was not time for overthinking anything or getting into too much trouble. Yes we had so called \"bad blood\" every once in awhile, but trust me they lost all community support and were left to fend for themselves, get with the program, or leave. ","user_id":"Tower_Flower","fromReply":[71],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":71,"time":"Tue 09 September 2008 11:17 AM","content":"REPLYING TO Tower_Flower WHO SAID: <u>\" You know what, where I grew up if any of those factors were the deciding factor, there would be no babies in town..    Love, family, community, fortitude, hard work and a one room  schoolhouse put out some the finest citizens this country could ever want.\"</u>   At age 6 when my father died we moved to my mother&apos;s grandparent&apos;s farm in Gasville, Arkansas, population 126.  From Catholic school to a 2 room, no plumbing school house where the two teachers were aunts.  Get in trouble and your aunt wants to give both you and your mother a whipping.  I would be shocked if a lot of abortions came from environments of &apos;Love, family, community, fortitude, hard work and a one room  schoolhouse&apos;.  They occur from &apos;kids&apos; that do &apos;it&apos; then find little if any alternative because of their situation or their own selfishness toward being &apos;tied down&apos; by a child.  You can talk &apos;take responsibility&apos; till you are blue but it is not going to happen unless you institutionalize those girls or boys. ","user_id":"anoldnotboldrecondo","fromReply":[76],"toReply":[44,51,60,70]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":72,"time":"Tue 09 September 2008 11:27 AM","content":"Yes, that could be a good alternative because of the structure of society today...but the institution would need to base its program to line up with the afforementioned solutions. This might stop the downward spiral. Course getting drugs off the streets, and greed mentality would be helpful in the effort...... ","user_id":"Tower_Flower","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":73,"time":"Tue 09 September 2008 11:37 AM","content":"By no means do I propose or support any kind of institutionalization for abortion risk people.  The cost would be staggering much less the immorality of locking people up for doing &apos;it&apos;. ","user_id":"anoldnotboldrecondo","fromReply":[76],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":74,"time":"Tue 09 September 2008 11:42 AM","content":"I didn&apos;t think you meant the \"lock-up\", but a community based help program for those who are without any options.     By the way, aunties are indeed a good deterent.    There was an unwritten law that if any parent caught a kid headed for trouble they could correct it on the spot and let the parents know, who in turn would correct them again when they got home....also if it was dinnertime and a child&apos;s family was known to be in trouble financially, wherever the child was at the time, he/she would be fed. ","user_id":"Tower_Flower","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":75,"time":"Tue 09 September 2008 11:43 AM","content":"REPLYING TO mmulder67 WHO SAID: <u>\"   Reason I responded to this quote is because I don&apos;t agree with the above statement about giving up some of what i have in support of the child...I&apos;m not the one that engaged in irresponsible behavior and ended up pregnant, so those that are against abortion should not be financially liable for a child just because of their beliefs.  Therefore they should not be allowed to force their beliefs on others.  It&apos;s pretty easy to not  get pregnant   get arrested for DUI   get lung cancer   get mugged ....don&apos;t  have sex   drink alcohol   smoke cigarettes   leave your house  if you&apos;re not completely willing to accept the possible consequences of your actions.\"</u>  Where do get the idea that you can force anyone to do what you think they should do and then abdicate your responsibility for that decision?[/QUOTE]  I never said that abortion should be taken off the table as an option, so no, it&apos;s not my responsibility to provide the funds for that child&apos;s life. When I have children, planned or not, I will not expect anyone but myself and the father of my child to provide for that child. Hopefully, I&apos;ll be wise enough to not engage in a sexual relationship with someone that I don&apos;t believe will be there to face the consequences. If I&apos;m not, then I certainly wouldn&apos;t use abortion and the easy excuse \"well he didn&apos;t stick around to help me\" as a way to \"abdicate\" my own responsiblity. I don&apos;t agree with abortion when it&apos;s used as an out for someone that just doesn&apos;t want to take the responsibility for their actions. How are any of the things that you lined through comparable to a conscious decision with forseeable consequences? If anything you made my point for me, don&apos;t drink and drive, don&apos;t get a dui; don&apos;t smoke, don&apos;t get cancer. Don&apos;t have sex, don&apos;t get pregnant. Otherwise, be willing to accept the results. Personally and I&apos;m not attacking you, but the getting mugged thing and don&apos;t \"leave your house\" is creative, but ludicrous. Not comparable at all in my eyes. ","user_id":"Angie1228","fromReply":[78],"toReply":[3,6,8,10,17,50,58,64,65,68]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":76,"time":"Tue 09 September 2008 01:51 PM","content":"REPLYING TO anoldnotboldrecondo WHO SAID: <u>\"   At age 6 when my father died we moved to my mother&apos;s grandparent&apos;s farm in Gasville, Arkansas, population 126.  From Catholic school to a 2 room, no plumbing school house where the two teachers were aunts.  Get in trouble and your aunt wants to give both you and your mother a whipping.  I would be shocked if a lot of abortions came from environments of &apos;Love, family, community, fortitude, hard work and a one room  schoolhouse&apos;.  They occur from &apos;kids&apos; that do &apos;it&apos; then find little if any alternative because of their situation or their own selfishness toward being &apos;tied down&apos; by a child.  You can talk &apos;take responsibility&apos; till you are blue but it is not going to happen unless you institutionalize those girls or boys.\"</u>   Sounds like the \"it takes a community to raise a child\" environment that the Republicans made fun of for years.    ","user_id":"rayld2","fromReply":[],"toReply":[15,28,69,71,73]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":77,"time":"Tue 09 September 2008 02:40 PM","content":"Good little buzz phrase with alot of wisdom. Haven&apos;t heard it or the other info....sad to make fun of such a realistic, hands-on approach if that be the case. ","user_id":"Tower_Flower","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":78,"time":"Wed 10 September 2008 08:00 AM","content":"REPLYING TO Angie1228 WHO SAID: <u>\" -snip- One last thing, read a post a little while ago that said pregnancy may not show on a test until the 4-5 week mark. There are a lot of tests out there that will let you know you&apos;re pregnant before you even miss a period.   Bumper sticker i saw: \"If it&apos;s not a baby....you&apos;re not pregnant\"\"</u>  But you&apos;re already 5 weeks pregnant by the day one&apos;s next period is due. I take it you&apos;re not terribly familiar with pregnancy testing and due date calculation? A visit to Planned Parenthood&apos;s website would help. ","user_id":"sweetsuds","fromReply":[86],"toReply":[66,75]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":79,"time":"Wed 10 September 2008 09:21 AM","content":"5 Weeks??  If a woman&apos;s cycle is 28 days why five weeks??  Day 1. begin menses which has visible signs for four to seven days (average) Then the walls of  the uterus build up the blood supply and cellular structure to recieve a fertilized ovum for implantation ( day eight to day thirteen average) day fourteen till aproxx. day twenty the greatest chance for fertilization, day twenty one  the chance for succesful implantation of a fertilized ovum decreases to almost zero till the beginning of the next cycle.  Now these numbers can fluctuate some degree depending on the woman&apos;s state of health, age, stress levels, nutrition and other unknown factors. But, they are reasonably accepted as the \"norm\".  At least they were in the seventies when I was studying to be a physicians assistant.  Which of course could account for the nickname applied to those who use the rythym method.......PARENTS!!!!      T ","user_id":"tawodi","fromReply":[80],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":80,"time":"Wed 10 September 2008 05:52 PM","content":"REPLYING TO tawodi WHO SAID: <u>\" 5 Weeks??  If a woman&apos;s cycle is 28 days why five weeks??  Day 1. begin menses which has visible signs for four to seven days (average) Then the walls of  the uterus build up the blood supply and cellular structure to recieve a fertilized ovum for implantation ( day eight to day thirteen average) day fourteen till aproxx. day twenty the greatest chance for fertilization, day twenty one  the chance for succesful implantation of a fertilized ovum decreases to almost zero till the beginning of the next cycle.  Now these numbers can fluctuate some degree depending on the woman&apos;s state of health, age, stress levels, nutrition and other unknown factors. But, they are reasonably accepted as the \"norm\".  At least they were in the seventies when I was studying to be a physicians assistant.  Which of course could account for the nickname applied to those who use the rythym method.......PARENTS!!!!      T\"</u>   Menstrual cycles can range from 21-45 days, and pregnancies are calculated from the last normal menstrual period. So, if a woman gets her period on July 1st, has a 31 day cycle, (which can fluctuate for all sorts of reasons)conceives between the 15-19, on July 31st, she will be considered to be five weeks pregnant on the 31st. And knowing what you and I know, Bruce, it&apos;s a very valid example. ","user_id":"sweetsuds","fromReply":[86],"toReply":[79]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":81,"time":"Wed 10 September 2008 06:22 PM","content":"AGREED!! ","user_id":"tawodi","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":82,"time":"Wed 01 October 2008 06:34 AM","content":"I was born out of wedlock.  My birth mother had been raped repeatedly by three men.  Her good christian parents had her carry me around until I was no longer a part of her. She hated me, or perhaps she hated her parents, or maybe the circumstances. Children in the womb are aware.  I was.   I was adopted shortly after birth by two good christian parents who thought it best to beat the devil out of me whenever they thought I deserved it. In other words, I was abused.I wil spare you the details, but i have been in therapy for most of my adult life.  Suicide and I are closely aquainted.  If children are bearing children, then society owes both the education to make adult choices.  If women are bearing children to stay on welfare then they should be sterilized.  The problem is not the choices people make, especially when the reasons for those choices are not apparent to those who make them. Sex education should be mandatory, and should begin in grade school; by second grade.  Sex offenders should also be sterilized and segregated from society.  No second chances, and no parole.  If the burdon this places on society becomes too great, then they should all be killed as humanely as possibly.  The problems are harder to solve than the debate of cild or choice, but until all the underlying problems are identified and addressed, abortion is the only humane solution. ","user_id":"lcplcross","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":83,"time":"Tue 28 October 2008 03:13 PM","content":"The men on this thread have never tried to find a way to locate a free clinic that they could get to on public transportation that could dispense reliablbe birth control to them. That is, if they even knew such a place even exsisted. The schools will NOT inform the sutdents about places they can go to for help with matters relating to contraception - they&apos;re forbidden to do so. The poor and uneducated still do not have good access to birth control and that&apos;s a fact. Also a fact is that many males, especially the younger ones, still refuse to take any responsibility for contraception on their own. Until they do, we&apos;ll always be having this argument. Sex is wonderful but men just have to accept that they WILL live to see another day if it doesn&apos;t happen that one time. All it takes is one time for 2 lives to be changed irrevocably. Think about it.  Who&apos;s the daddy? Most of the time, the fathers of the babies of underage girls are adult men. These men tend to make themselves invisable towards the end of the girl&apos;s pregnancy and refuse to contribute anything at all towards the support of their children. The appaling thing is that what we have going on here is a mass situation of statutory rape that&apos;s being totally ignored. If that law is going to be on the books then it should be enforced. ","user_id":"entmjzi","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":84,"time":"Wed 12 November 2008 02:03 PM","content":"I approach this issue myself from both a biological/medical perspective and a social/humanist perspective.  However, I do not ignore the religious perspective, which seems to be very important to many people on this issue.  I was talking with an acquaintance who gave me the Old Testament/Jewish perspective on when human life begins and abortion.  Here&apos;s what I got (copied/pasted with permission):    Anyway, there&apos;s that, for what it&apos;s worth.  The books of the Torah are, of course, the foundation for Jewish law and morality, and they&apos;re also the part of the Bible from which Christians get a lot of other morality-related issues.  It&apos;s clear from those books (for the religious perspective) that a fetus doesn&apos;t become a baby until it takes its first breath, and that abortion is not considered to be the killing of a human being.  Is this the unchanging word of God? ","user_id":"Whirled_Peas","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":85,"time":"Thu 13 November 2008 06:33 PM","content":"I, however, have never seen a fiqh or halachic responsa on the issue of intentionally causing a woman to lose a pregnancy. That would seem to call for a bigger penalty, one would think. ","user_id":"sweetsuds","fromReply":[86],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"5531905206_6420099791001","post_id":86,"time":"Fri 14 November 2008 07:42 AM","content":"REPLYING TO sweetsuds WHO SAID: <u>\" I, however, have never seen a fiqh or halachic responsa on the issue of intentionally causing a woman to lose a pregnancy. That would seem to call for a bigger penalty, one would think.\"</u>   Well, if someone assaults a woman and causes her to lose her pregnancy against her will, then this could (according to the religious laws) be a grievous assault against the woman, but not against a child.  Indeed, the Old Testament would support that stance. ","user_id":"Whirled_Peas","fromReply":[],"toReply":[2,13,23,24,26,35,40,43,78,80,85]}],"id":"5531905206_6420099791001"},{"post":[{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":1,"time":"Tue 19 May 2009 08:50 PM","content":"-  the majority do not want  Roe v. Wade  overturned.  \"http://www.pollster.com/blogs/us_national_survey_cnn51415.php\" A contradiction?  Or do the majority of those who identify themselves as \"pro-life\" still don&apos;t want to criminalize abortion, but hope to use non-criminal law methods such as education, persuasion, etc. to reduce abortions? ","user_id":"Fightdirector","fromReply":[8,12,24,49],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":2,"time":"Tue 19 May 2009 09:01 PM","content":"I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. ","user_id":"Thud357L","fromReply":[4,25],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":3,"time":"Tue 19 May 2009 09:26 PM","content":"To draw a parallel, I do not consider marriage a &apos;right&apos; for gays, but neither do I favor any sort of constitutional amendment banning gay marriage explicitly, nor restricting a state&apos;s right to define marriage as a legal contract.  Equal protection and due process can get very tricky--the business law course I took in college drove me 3/4 nuts! There were no correct answers, only competing arguments; some more compelling than others, and some of those more compelling only because one advocate possessed greater skills of persuasion than another.   I love the idea that the Supreme Court doesn&apos;t come to decisions in a vacuum.  They hear arguments (which require context) from real live lawyers--again, some more skilled than others.  They ask questions (except for Clarence Thomas, of course) and often bait the solicitors away from their prepared texts and into territory those lawyers would rather not cover.  Few issues are as simple as black or white--the what-ifs are too numerous.","user_id":"Yooper_tj","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":4,"time":"Tue 19 May 2009 09:32 PM","content":"REPLYING TO Thud357L WHO SAID: <u>\" I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions.\"</u>   I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain&apos;t right. ","user_id":"Irwin_R_Schyster","fromReply":[5,9],"toReply":[2]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":5,"time":"Tue 19 May 2009 10:02 PM","content":"REPLYING TO Irwin_R_Schyster WHO SAID: <u>\"   I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain&apos;t right.\"</u>        So, if your wife or daughter was pregnent and their doctor comes to you in the second or third \"trimester\" and told you \"The choice is yours but your wife or daughter will die if you don&apos;t abort the baby now. This is a medical problem and can not be cured. What do you do?  ","user_id":"Tangler","fromReply":[6,21],"toReply":[4]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":6,"time":"Wed 20 May 2009 05:19 AM","content":"REPLYING TO Tangler WHO SAID: <u>\"     So, if your wife or daughter was pregnent and their doctor comes to you in the second or third \"trimester\" and told you \"The choice is yours but your wife or daughter will die if you don&apos;t abort the baby now. This is a medical problem and can not be cured. What do you do? \"</u> I think the question is more like this:  If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don&apos;t abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death?  It&apos;s your choice - not mine. If there are consequences, the consequences are yours, not mine. ","user_id":"Fightdirector","fromReply":[8,12,24,49],"toReply":[5]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":7,"time":"Wed 20 May 2009 06:02 AM","content":"  Thanks for TRYING to start up some bull with this comment.  Roe vs wade...what period of birth is that referring to? There is your answer.  Who wants partial birth abortion to go on vs a couple of weeks into the pregnancy. To most people there is a huge huge difference. Go look at a garbage bag full of partial birth aborted babies and a jar of roe vs wade fetuses.  Duh... So no     it is not a contradiction. It is a common knee jerk reaction. ","user_id":"ACR26","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":8,"time":"Wed 20 May 2009 06:13 AM","content":"REPLYING TO Fightdirector WHO SAID: <u>\" -  the majority do not want  Roe v. Wade  overturned.  \"http://www.pollster.com/blogs/us_national_survey_cnn51415.php\" A contradiction?  Or do the majority of those who identify themselves as \"pro-life\" still don&apos;t want to criminalize abortion, but hope to use non-criminal law methods such as education, persuasion, etc. to reduce abortions?\"</u>   The VAST majority of people in this country (even those that support legal abortions) have ALWAYS prefered to reduce the number of abortions. I think what is changing is that many of the younger leaders in the so called \"pro-life\" movement have stopped treating it as an absolute that to be \"pro-life\" you have to support outlawing ALL or almost all abortions and started supporting the non-criminal law methods you mentioned. ","user_id":"rayld2","fromReply":[16],"toReply":[1,6]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":9,"time":"Wed 20 May 2009 06:17 AM","content":"REPLYING TO Irwin_R_Schyster WHO SAID: <u>\"   I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain&apos;t right.\"</u>   Always?    Even if carrying the baby to term will cause health problems for the mother?    Even if the baby can not survive, for example born with only a brain stem? ","user_id":"rayld2","fromReply":[16],"toReply":[4]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":10,"time":"Wed 20 May 2009 06:23 AM","content":"I don&apos;t quite understand how it is a \"human rights\" violation to waterboard someone, which causes no permanent injury or death, yet the decision to terminate a life on demand is a \"fundamental right\".    I don&apos;t care if it was rape, incest, mother/child&apos;s life is at risk, etc., I cannot and will not support abortion.  I don&apos;t accept that a child is unwanted by everybody.  If you don&apos;t want to have a child, don&apos;t have sex.","user_id":"QuanticoBornMarine","fromReply":[11,17,18,31],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":11,"time":"Wed 20 May 2009 07:38 AM","content":"REPLYING TO QuanticoBornMarine WHO SAID: <u>\" I don&apos;t quite understand how it is a \"human rights\" violation to waterboard someone, which causes no permanent injury or death, yet the decision to terminate a life on demand is a \"fundamental right\".    I don&apos;t care if it was rape, incest, mother/child&apos;s life is at risk, etc., I cannot and will not support abortion.  I don&apos;t accept that a child is unwanted by everybody.  If you don&apos;t want to have a child, don&apos;t have sex.\"</u>  When someone can FORCE another person to give blood (after all it will save a life), donate skin (can save a life) or undergo other medical procedures for the benfit of ANOTHER person THEN everyone would be held to the same level of responsiblity for another person YOU want to force on women when it comes to babies. When you support allowing these types of actions to be forced on YOU then I will belief you are actually basing this on belief in the the right to life. ","user_id":"rayld2","fromReply":[16],"toReply":[10]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":12,"time":"Wed 20 May 2009 07:44 AM","content":"REPLYING TO Fightdirector WHO SAID: <u>\"I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don&apos;t abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death?\"</u>   The vast majority of abortions, at least 97  by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother.  They are matters of \"convenience.\"  No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care.  Fifty million (50,000,000) budding lives have been obliterated since 1973 in America.  (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?)  This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly.  It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents.  And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it. ","user_id":"RRR52","fromReply":[20],"toReply":[1,6]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":13,"time":"Wed 20 May 2009 08:13 AM","content":"I should have been more clear: If there is a legitimate medical reason for the abortion in those advanced stages of life then okay..  Absolutely no abortions in the 2nd and 3rd trimester if it is not a medical emergency... ","user_id":"Irwin_R_Schyster","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":14,"time":"Wed 20 May 2009 10:19 AM","content":"Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it.   Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God...   The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says,  \"He who is without sin cast the first stone\"...no one threw a stone at that point! ","user_id":"dragonflyer04","fromReply":[15,23],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":15,"time":"Wed 20 May 2009 01:19 PM","content":"REPLYING TO dragonflyer04 WHO SAID: <u>\" Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it.   Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God...   The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says,  \"He who is without sin cast the first stone\"...no one threw a stone at that point!\"</u>   Actually that was at the Mount of Olives, but no biggie.  More importantly, after no one condemned her, Jesus told her to \"Go now and sin no more.\"","user_id":"QuanticoBornMarine","fromReply":[17,18,31],"toReply":[14]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":16,"time":"Wed 20 May 2009 01:24 PM","content":"REPLYING TO rayld2 WHO SAID: <u>\" When someone can FORCE another person to give blood (after all it will save a life), donate skin (can save a life) or undergo other medical procedures for the benfit of ANOTHER person THEN everyone would be held to the same level of responsiblity for another person YOU want to force on women when it comes to babies. When you support allowing these types of actions to be forced on YOU then I will belief you are actually basing this on belief in the the right to life.\"</u>   There is no issue of force or coercion at play.  I cannot force a woman to not abort any more than she can force someone to abort.  The issue is one of morality.  I believe that it is wrong to take the life of an unborn child, regardless of the circumstances.  What can I do about it?  I can vote, I can pray, I can speak out.  But you won&apos;t see me FORCING anybody to do anything or not do anything.  A coerced virtue is no virtue at all.","user_id":"QuanticoBornMarine","fromReply":[17,18,31],"toReply":[8,9,11]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":17,"time":"Wed 20 May 2009 03:23 PM","content":"REPLYING TO QuanticoBornMarine WHO SAID: <u>\"   There is no issue of force or coercion at play.  I cannot force a woman to not abort any more than she can force someone to abort.  The issue is one of morality.  I believe that it is wrong to take the life of an unborn child, regardless of the circumstances.  What can I do about it?  I can vote, I can pray, I can speak out.  But you won&apos;t see me FORCING anybody to do anything or not do anything.  A coerced virtue is no virtue at all.\"</u>   But you are agitating for the state to force a woman to carry to term. ","user_id":"thorin001","fromReply":[44],"toReply":[10,15,16]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":18,"time":"Wed 20 May 2009 06:29 PM","content":"REPLYING TO QuanticoBornMarine WHO SAID: <u>\"   Actually that was at the Mount of Olives, but no biggie.       Sorry, it was at the main temple see John 8:4-11     More importantly, after no one condemned her, Jesus told her to \"Go now and sin no more.\"\"</u>       More importantly, your trying to force you religious believes on to others who don&apos;t share it. God/Jesus have given you a law your suppose to follow so you shouldn&apos;t have a abortion but if someone else chooses, that is their look out not yours. You can warn them but if they don&apos;t belive you can&apos;t force. ","user_id":"Tangler","fromReply":[21],"toReply":[10,15,16]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":19,"time":"Wed 20 May 2009 07:15 PM","content":"My older brother was the first one to point out to me that the power of prayer has shifted the stance on \"life itself.\"  I want to believe that.","user_id":"PinkBlossoms","fromReply":[29,32],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":20,"time":"Wed 20 May 2009 09:01 PM","content":"REPLYING TO RRR52 WHO SAID: <u>\" So, I gather from your comment that you feel you have the right, indeed the obligation, to decide for someone else (not just for yourself or your spouse) whether or not they can or cannot have a abortion.  Did I read you correctly? If so, what other things do you feel you have the right, indeed the obligation, to decide for someone else? Whether or not they can drink alcohol? Whether or not they can stay home on Sunday and not attend a church? Whether or not they can watch CNN rather than FOX? How far are you willing to go to set yourself up as the decider for other&apos;s people&apos;s lives?  I, for one, agree with dragonflyer04:   quote:  ...if someone does have an abortion it is between them and God...\"</u>  ","user_id":"Fightdirector","fromReply":[24,49],"toReply":[12]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":21,"time":"Thu 21 May 2009 04:19 AM","content":"REPLYING TO Tangler WHO SAID: <u>\"       More importantly, your trying to force you religious believes on to others who don&apos;t share it. God/Jesus have given you a law your suppose to follow so you shouldn&apos;t have a abortion but if someone else chooses, that is their look out not yours. You can warn them but if they don&apos;t belive you can&apos;t force.\"</u>   You are correct on point number one.  My bust.  He had just returned to the temple from the Mount of Olives.    You are incorrect on point number two.  Demonstrate to me ANYWHERE that I have forced or attempted to force something upon another, unless you are saying that I should not be able to vote or speak on my beliefs or speak on my beliefs.  That would be very unconstitutional of you.  I state my beliefs.  If my beliefs offend, then so be it, but offending and coercing are very different.  I am not ashamed or embarrassed by my beliefs, so I will continue to share them.    I don&apos;t know your political or moral leaning Tangler, but I have found, over the years, that most \"liberals\" simply refuse to accept that someone else can hold a viewpoint that might offend another.  They get so wrapped up in \"tolerance\" that they become intolerant of anyone they deem intolerant.  They tend to allow their emotions to override their logic, and they tend to make exaggerated statements such as the one you made.  I don&apos;t believe that all \"liberals\" fall into lockstep with Peter Singer or George Tiller, so I don&apos;t make those kind of exaggerated claims.   Christ stated clearly that the Gospel offends, and that Christians will be hated for His sake. So I don&apos;t expect much out of people these days.","user_id":"QuanticoBornMarine","fromReply":[31],"toReply":[5,18]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":22,"time":"Thu 21 May 2009 04:26 AM","content":"Question:  With all this \"to each his own\" and \"that&apos;s between the mother and God\" stuff, have we lost our sense of moral outrage?  Is there anything that gives Americans the right to speak up and say, \"No, that is just wrong\"?  Does anyone believe in absolute right and wrong in the universe.  I used to be a bit of a computer geek back in the day, and I recall the beauty of the binary system.  It&apos;s either a 1 or a 0, no other option.  Some things in this universe can and should be reduced to that simplicity.","user_id":"QuanticoBornMarine","fromReply":[31],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":23,"time":"Thu 21 May 2009 04:47 AM","content":"REPLYING TO dragonflyer04 WHO SAID: <u>\" Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it.   Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God...   The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says,  \"He who is without sin cast the first stone\"...no one threw a stone at that point!\"</u>   that was then this is now...most people in this country are busy taking god out of everything. ","user_id":"backtoiraq","fromReply":[28,33],"toReply":[14]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":24,"time":"Thu 21 May 2009 04:49 AM","content":"REPLYING TO Fightdirector WHO SAID: <u>\" \"</u>   THAT WOULD BE TRUE EXCEPT MY TAX MONEY IS BEING USED TO MAKE SURE YOU CAN KILL BABIES. SO IT IS JUST NOT BETWEEN GOD AND THE KILLER. ","user_id":"backtoiraq","fromReply":[28,33],"toReply":[1,6,20]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":25,"time":"Thu 21 May 2009 04:51 AM","content":"REPLYING TO Thud357L WHO SAID: <u>\" I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions.\"</u>   The majority of active anti-abortionists are controlling MALES who do not want to give up the last vestiges of absolute dominance over women.  The term, \"pro-life,\" is just a misnomer that they use to try to somehow make their obsession as being a moral issue.   However, when a blind cross-section of the population that includes an equal number of women are asked, the numbers of those who support a woman&apos;s rights to decide abortion issues for themselves overwhelmingly supports the rights for the individual to be free to make procreation decisions without any government intrusion. ","user_id":"skinman13","fromReply":[],"toReply":[2]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":26,"time":"Thu 21 May 2009 04:53 AM","content":"ABORTION IS DONE FOR THE MOST PART TO COVER UP A MISTAKE WITH ANOTHER MISTAKE. MOST OF THE TIME IT HAS NOTHING TO DO WITH THE \"HEALTH\" OF ANY OF THE PARTICIPANTS...IT IS DONE FOR THE SOLE PURPOSE OF GETTING RID OF THE EVIDENCE OF A STUPID DECISION. ","user_id":"backtoiraq","fromReply":[28,33],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":27,"time":"Thu 21 May 2009 04:59 AM","content":"Those who feel the need to SHOUT, are usually those who realize that their argument is weak.    ","user_id":"skinman13","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":28,"time":"Thu 21 May 2009 06:13 AM","content":"REPLYING TO backtoiraq WHO SAID: <u>\"   THAT WOULD BE TRUE EXCEPT MY TAX MONEY IS BEING USED TO MAKE SURE YOU CAN KILL BABIES. SO IT IS JUST NOT BETWEEN GOD AND THE KILLER.\"</u>   Yes, it is (tax money being spent on killing babies.)  Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks.     ","user_id":"PinkBlossoms","fromReply":[29,32],"toReply":[23,24,26]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":29,"time":"Thu 21 May 2009 06:25 AM","content":"REPLYING TO PinkBlossoms WHO SAID: <u>\" Yes, it is (tax money being spent on killing babies.)  Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks.     \"</u> The winky icon does not make your \"liberal\" comment any less insidious. Seems to me there has been only one person on this board bragging about their entitlement checks and he wasn&apos;t a liberal. Excuse me, but I have to head off to WORK now...","user_id":"SeaWitch1220","fromReply":[30,37,38],"toReply":[19,28]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":30,"time":"Thu 21 May 2009 06:30 AM","content":"REPLYING TO SeaWitch1220 WHO SAID: <u>\" The winky icon does not make your \"liberal\" comment any less insidious. Seems to me there has been only one person on this board bragging about their entitlement checks and he wasn&apos;t a liberal. Excuse me, but I have to head off to WORK now...\"</u>        Oh and you were right on in your email.     ","user_id":"DMarkUhler","fromReply":[],"toReply":[29]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":31,"time":"Thu 21 May 2009 06:46 AM","content":"REPLYING TO QuanticoBornMarine WHO SAID: <u>\" Question:  With all this \"to each his own\" and \"that&apos;s between the mother and God\" stuff, have we lost our sense of moral outrage?  Is there anything that gives Americans the right to speak up and say, \"No, that is just wrong\"?  Does anyone believe in absolute right and wrong in the universe.  I used to be a bit of a computer geek back in the day, and I recall the beauty of the binary system.  It&apos;s either a 1 or a 0, no other option.  Some things in this universe can and should be reduced to that simplicity.\"</u>   Ah, binary!  Now you are speaking my language!  One of the things we have discovered about using computers to define the real world is that binary is wholly inadequate.  This lead to the whole field of \"fuzzy logic\", which essentially is programming in that gray space between 0 and 1.  Black and white are almost never the only choices.  In this case, the \"humanity\" of the prospective baby, as well as the \"morality\" of the abortion decision, are both on sliding scales.  As some have noted, there are at least instances of medical need under which abortion makes sense - this at least shows some part of the curve.  In my opinion on the case of abortion, there are two big questions, which must be addressed in order.  The first question is this: When does a couple of cells become a human being?  The churches say \"at conception\", with which I argue both because of the lack of real criteria and because of the surprising number of fertilized eggs that do not make it.  At the other extreme are those who think the answer is \"at birth\" which is abhorrent in my opinion.  The answer must lie somewhere in between, but until we have established testable criteria we can never really agree on a point.  I would personally entertain the 2nd trimester - at the beginning I would not call it a human being, by the end I would say definitely it is.  In fuzzy logic, this would be a two-term output membership function - we would need to agree on the shape, perhaps trapezoidal but more likely sigmoid.  The second question is what factors should be considered in abortions - rape, poverty, health, convenience?  What is the societal cost of allowing/forbidding the abortion?  What is the moral cost?  All of these are to be considered, and none of them are black and white.  Again, to add my own 2 cents here, I feel that a significant number of abortions are making the best of a bad situation.  The output MF would look similar as the previous, but the big issue would be determining the input MF&apos;s. ","user_id":"cosmicfish","fromReply":[],"toReply":[10,15,16,21,22]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":32,"time":"Thu 21 May 2009 06:54 AM","content":"REPLYING TO PinkBlossoms WHO SAID: <u>\" Yes, it is (tax money being spent on killing babies.)  Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks.     \"</u> I am pro life -  I believe in the sanctity of all human life.  And my tax money is used by government to kill living human beings in violation of my religious and moral code - living human beings who, rightly or wrongly, have been convicted of certain crimes that in certain parts of the United States earn them the death penalty.  Does that \"make me want to quit working and join the porch sitters waiting on their monthly entitlement checks\"? No - because I accept that I must follow the laws of the country I live in, whether I like it or not.   Does that make me go out and blow up prisions where the death penalty is carried out, as some \"pro-life\" people blow up medical clinics where legal abortions are performed? No - because I accept that I must follow the laws of the country I live in, whether I like it or not.  Does that make me go out and shoot the executioners from ambush like some \"pro-life\" people shoot doctors who perform legal abortions? No - because I accept that I must follow the laws of the country I live in, whether I like it or not.  Nothing sickens me more than those \"Cafeteria pro-lifers\" whose \"pro-life\" morality only includes the \"death\" of a fertilized egg. ","user_id":"Fightdirector","fromReply":[49],"toReply":[19,28]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":33,"time":"Thu 21 May 2009 07:35 AM","content":"REPLYING TO backtoiraq WHO SAID: <u>\"   THAT WOULD BE TRUE EXCEPT MY TAX MONEY IS BEING USED TO MAKE SURE YOU CAN KILL BABIES. SO IT IS JUST NOT BETWEEN GOD AND THE KILLER.\"</u>  FALSE because tax money is very seldom used for abortions but it is used to stop fanatics from ILLEGALLY attacking people and organizations. ","user_id":"rayld2","fromReply":[],"toReply":[23,24,26]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":34,"time":"Thu 21 May 2009 09:42 AM","content":"Hmmm...Ted Kennedy is a dyed in the wool liberal and is a multi-millionare? In fact there are many millionares who are liberals (George Soros is a billionare)...and someone who is pro-life can be liberal or conservative?! So I am not sure your point makes allot of sense? Please explain how pro-life and \"porch-sitters\" have something in common?! or even disparate relationships... ","user_id":"dragonflyer04","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":35,"time":"Thu 21 May 2009 11:19 AM","content":"   But - you can add me to the Pro-Life list. ","user_id":"mnoble1066","fromReply":[36,39,41],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":36,"time":"Thu 21 May 2009 02:28 PM","content":"REPLYING TO mnoble1066 WHO SAID: <u>\"    But - you can add me to the Pro-Life list.\"</u> Gosh, me too...but I support a woman&apos;s right to  choose .","user_id":"SeaWitch1220","fromReply":[37,38],"toReply":[35]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":37,"time":"Thu 21 May 2009 02:38 PM","content":"REPLYING TO SeaWitch1220 WHO SAID: <u>\" Gosh, me too...but I support a woman&apos;s right to  choose .\"</u>   I consider myself pro-life AND pro-choice, but because I prefer unambiguous labels I am also coming out as pro-undead.  I fully support people&apos;s rights to become a zombie and eat other people&apos;s brains. ","user_id":"cosmicfish","fromReply":[],"toReply":[29,36]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":38,"time":"Fri 22 May 2009 03:31 AM","content":"REPLYING TO SeaWitch1220 WHO SAID: <u>\" Gosh, me too...but I support a woman&apos;s right to  choose .\"</u>    The taking of another innocent human life is nobodys  Choice . ","user_id":"mnoble1066","fromReply":[39,41],"toReply":[29,36]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":39,"time":"Fri 22 May 2009 04:42 AM","content":"REPLYING TO mnoble1066 WHO SAID: <u>\" The taking of another innocent human life is nobodys  Choice .\"</u> Roe v Wade remains the law of the land and it isn&apos;t going away. Instead of tilting at the abortion windmill, work to  reduce  abortions instead of trying to outlaw them.","user_id":"SeaWitch1220","fromReply":[],"toReply":[35,38]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":40,"time":"Fri 22 May 2009 05:39 AM","content":"Abortion is absolutely abhorrent.  The only thing that is more abhorrent than abortion, is for the government to make laws that would deny a woman&apos;s right to choose.","user_id":"ProgMod","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":41,"time":"Fri 22 May 2009 09:18 PM","content":"REPLYING TO mnoble1066 WHO SAID: <u>\" The taking of another innocent human life is nobodys  Choice .\"</u>   So tell us, should we immediately stop fighting terrorists in Afghanistan, Pakistan, and other countries because no matter how hard we try to avoid it, we are taking, \"innocent human life\"?  After all, it is a, \"choice.\" ","user_id":"skinman13","fromReply":[],"toReply":[35,38]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":42,"time":"Sat 23 May 2009 04:21 PM","content":"There is a difference between being against abortion and actually criminalizing it.  If you you overturn Roe v. Wade (and make it a crime again), it would NOT stop abortions, rich women would simply go overseas to have an abortion and poorer women would go into back alleys and organized crime would probably get involved.    Courts would have to decide punishments for those involved (the death penalty perhaps?) and police would have to have to check on miscarriages and pregnant women traveling overseas.  Could a women be sent to prison for \"neglect\" if she did something - drank alcohol or took drugs while pregnant?  Does society want to pay for more courts and prisons and police \"abortion investigation\" teams?    As I said, there is a difference between being against abortion and actually making it a crime. ","user_id":"ColdWarGranny","fromReply":[43],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":43,"time":"Sun 24 May 2009 12:33 AM","content":"REPLYING TO ColdWarGranny WHO SAID: <u>\" There is a difference between being against abortion and actually criminalizing it.  If you you overturn Roe v. Wade (and make it a crime again), it would NOT stop abortions, rich women would simply go overseas to have an abortion and poorer women would go into back alleys and organized crime would probably get involved.    Courts would have to decide punishments for those involved (the death penalty perhaps?) and police would have to have to check on miscarriages and pregnant women traveling overseas.  Could a women be sent to prison for \"neglect\" if she did something - drank alcohol or took drugs while pregnant?  Does society want to pay for more courts and prisons and police \"abortion investigation\" teams?    As I said, there is a difference between being against abortion and actually making it a crime.\"</u>   15 yard penalty. Illegal use of reality in a PCP thread. ","user_id":"thorin001","fromReply":[44],"toReply":[42]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":44,"time":"Sun 24 May 2009 07:11 PM","content":"REPLYING TO thorin001 WHO SAID: <u>\"   15 yard penalty. Illegal use of reality in a PCP thread.\"</u>         ","user_id":"KJ1110","fromReply":[],"toReply":[17,43]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":45,"time":"Tue 02 June 2009 06:27 AM","content":"Once again fundamentalist religious men are trying to control women&apos;s options. Christian fundamentalists in my opinion have more in common with taliban extremists than not.   There is  no such thing as a pro lifer. These same pro lifers in my opinion champion the death penalty and are the biggest supporters of war and torture. They do not care about babies suffering in the Sudan. Why are they not outraged over babies dying around the world? After all being pro life they should care about life everywhere. God loves all people, everywhere. Fundies on the other hand only \"care\" about a fetus in this country.  Why are there so many babies/children without good homes? Why are not the NO Choice Fundies out there adopting unwanted children? Again it is because they do not care about children. They care about the \"enslavement\" of women.  There is no such thing as a pro lifer. If they believe abortion is murderthat means those doctors, mothers, families, friends, etc who participate in an abortion need to receive either the death penalty or life in prison. It is that simple.   As has been stated this has nothing to do with life/death. It is about men trying to control women through religion. Why are these fundies not out there adopting all those unwanted crack babies? Why are they outraged over \"welfare mothers who keep having children when they ain&apos;t got no job.\"  The term pro life needs to be changed to \"No Choicer.\" It is certainly more accurate than pro lifer. Abortion needs to be a safer option for those who want it. I do not like abortion, but letting old men decide what a woman can or cannot do with her body is BS. The Christian Taliban in this country needs to be put down just like its muslim cousin.  If you are in the military you are not pro life. Get over yourself. You are pro choice by the nature of the job. You, like everybody else just choose who/what u think should die or not. ","user_id":"R102v2","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":46,"time":"Tue 02 June 2009 06:48 AM","content":"  No, it&apos;s about demoralizing society and psychologically implanting into our feeble minds that decisions do not have consequences, that no matter what, gov&apos;t will be there to save you from yourself, your neighbors, your children and the next evil ideology (and dammit if one cannot be found, then one will be created via cia). ","user_id":"soscorpio","fromReply":[47],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":47,"time":"Tue 02 June 2009 09:42 AM","content":"REPLYING TO soscorpio WHO SAID: <u>\"   No, it&apos;s about demoralizing society and psychologically implanting into our feeble minds that decisions do not have consequences, that no matter what, gov&apos;t will be there to save you from yourself, your neighbors, your children and the next evil ideology (and dammit if one cannot be found, then one will be created via cia).\"</u>   Someone is obviously off their meds. ","user_id":"thorin001","fromReply":[],"toReply":[46]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":48,"time":"Tue 02 June 2009 12:16 PM","content":"  whoa great comeback!  Listen, I understand, you&apos;re frightened, but hiding from your fears won&apos;t make them go away. ","user_id":"soscorpio","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_1310027322001","post_id":49,"time":"Tue 02 June 2009 12:23 PM","content":"REPLYING TO Fightdirector WHO SAID: <u>\" -  the majority do not want  Roe v. Wade  overturned.  \"http://www.pollster.com/blogs/us_national_survey_cnn51415.php\" A contradiction?  Or do the majority of those who identify themselves as \"pro-life\" still don&apos;t want to criminalize abortion, but hope to use non-criminal law methods such as education, persuasion, etc. to reduce abortions?\"</u>   No not a contradiction, it&apos;s a myth spread by liberals.  OH NO they are pro life, they will mess with Roe vs Wade.  BS. I am pro-life but do not believe I have the right to tell a women what they can do with their body, that said, if my wife tried it, I would have the right to divorce her over it.","user_id":"L0A1","fromReply":[],"toReply":[1,6,20,32]}],"id":"409192893_1310027322001"},{"post":[{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":1,"time":"Wed 23 January 2008 07:59 AM","content":"A news film crew interviewed a group of anti-abortion protestors at a protest in the town of Libertyville. They asked \"if abortion were made illegal, what criminal penalty should the woman who gets the abortion recieve?\" The answers were very interesting - most said abortion should be illegal, but the woman who gets the abortion should not receive any form of punishment. One did say the woman should possibly get a sentence of life imprisonment (she was anti-death penalty).   Anti-abortion protestors on punishing women who get abortions:   If abortion becomes illegal again, what punishment do you think the woman who gets an abortion receive?     A \"parking ticket\"-like misdemenor?   5 years in prison?    10 years in prison?    20 years in prison?    Life in prison?    The death penalty?  I&apos;m going to be hard-core about it: If abortion is murder under the civil law, then any woman who gets an abortion should get life in prison. ","user_id":"Fightdirector","fromReply":[24],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":2,"time":"Wed 23 January 2008 08:06 AM","content":"Ok, then what would you do about the children of the woman in question? Would a monthly inquest be required for every sexually active woman who menstruates, in case a egg was fertilized and \"lost\"? Should women be required to be tested for pregnancy before purchasing Vitamin C, nigella, or other nutritional supplements that can end a pregnancy in very early stages? Since caffeine seems to be connected with miscarriages, should women be required to submit a recent negative pregnancy test result before being allowed to enter Starbucks? Should women even be allowed to work at Starbucks, seeing as that would allow easy access to caffeine? Also, certain massage techniques are used in folk medicine to assist with abortions- should women be restricted to shoulder and foot rubs until menopause? ","user_id":"sweetsuds","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":3,"time":"Wed 23 January 2008 08:18 AM","content":"Since Abortions would be illegal... doesn&apos;t the one who COMMITS the abortion get punished....  So Abortionists would get the penalty.  Also, given that most abortion attempts by non-qualified personel tend to result in scarring, permanent injury, sterility or death.... do we really HAVE to worry about punishing the woman...  I think being rendered sterile is a pretty stiff sentence....  Much as I hate to say it.... better legal, safe and unnecessary, than the opposite.  Don&apos;t like it, but I&apos;ll just have to get over it.  I can&apos;t get pregnant. ","user_id":"LRS51st","fromReply":[8,15],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":4,"time":"Wed 23 January 2008 08:21 AM","content":"What kind of question is this? Roe v Wade will not be overturned.Get over it. If you dont want an abortion, dont get one. If you do,you dont have to answer to anyone but yourself and your God, if you believe in such things.","user_id":"rm444","fromReply":[5,6,17,39,54],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":5,"time":"Wed 23 January 2008 08:24 AM","content":"REPLYING TO rm444 WHO SAID: <u>\" What kind of question is this? Roe v Wade will not be overturned.Get over it.\"</u> Actually, I agree with you.   And one of the reasons it will not become illegal again is that no one (or practically no one) can envision a criminal punishment for a woman who gets an abortion. ","user_id":"Fightdirector","fromReply":[24],"toReply":[4]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":6,"time":"Wed 23 January 2008 08:26 AM","content":"REPLYING TO rm444 WHO SAID: <u>\" What kind of question is this? \"</u>   A very stupid one. ","user_id":"Killswitch_Engage","fromReply":[],"toReply":[4]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":7,"time":"Wed 23 January 2008 08:31 AM","content":"Are you yourself a virgin? Are you waiting til marriage to have sex?  If not, then you are an aider and abetter to a crime.  After all, she would never have been in a position to do this, without you. ","user_id":"OrangeCat97","fromReply":[11,12],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":8,"time":"Wed 23 January 2008 08:34 AM","content":"REPLYING TO LRS51st WHO SAID: <u>\" Since Abortions would be illegal...doesn&apos;t the one who COMMITS the abortion get punished...  So Abortionists would get the penalty.  Also, given that most abortion attempts by non-qualified personel tend to result in scarring, permanent injury, sterility or death...do we really HAVE to worry about punishing the woman...I think being rendered sterile is a pretty stiff sentence...  Much as I hate to say it...better legal, safe and unnecessary, than the opposite.  Don&apos;t like it, but I&apos;ll just have to get over it.  I can&apos;t get pregnant.\"</u> Assuming abortion is murder, under the civil and criminal law (for the purpose of the question, we are ignoring morals, and focusing strictly on civil and criminal law), saying that only the person who performs the abortion should be punished and not the woman who voluntarily has the procedure is like saying that, if a person shoots and kills another person with a pistol, only the gun manufacturer should be punished.  And what criminal punishment should be given to the father of the fetus, or the parents or family members of the woman/girl getting the abortion, who drive her to the doctor? If abortion is murder, under civil and criminal law, should they not be punished as \"accessories before and after the fact\"?  It is all very easy to say that \"abortion is immoral and should be against the law\" - but no law is worth anything more than a bucket of spit unless there is a civil or criminal punishment for breaking it. So why pass a law which doesn&apos;t penalize the person who breaks it - the woman who voluntarily gets the abortion?   If you don&apos;t want her to be punished, don&apos;t criminalize the procedure. ","user_id":"Fightdirector","fromReply":[24],"toReply":[3]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":9,"time":"Wed 23 January 2008 08:54 AM","content":"No  It&apos;s just a fetus ","user_id":"FortesFortunaJuvat","fromReply":[48],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":10,"time":"Wed 23 January 2008 09:43 AM","content":"      - - Rose Kennedy  ","user_id":"The_Bonesaw","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":11,"time":"Wed 23 January 2008 09:53 AM","content":"REPLYING TO OrangeCat97 WHO SAID: <u>\" Are you yourself a virgin? Are you waiting til marriage to have sex?  If not, then you are an aider and abetter to a crime.  After all, she would never have been in a position to do this, without you.\"</u>  For the purposes of this dicussion; only if you are party to the abortion itself.  If the procedure is done without the consent or knowledge of the sperm donor, then he cannot be an \"aider and abetter\". ","user_id":"PSimon572","fromReply":[],"toReply":[7]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":12,"time":"Wed 23 January 2008 10:00 AM","content":"REPLYING TO OrangeCat97 WHO SAID: <u>\" Are you yourself a virgin? Are you waiting til marriage to have sex?  If not, then you are an aider and abetter to a crime.  After all, she would never have been in a position to do this, without you.\"</u>    ","user_id":"rm444","fromReply":[17,39,54],"toReply":[7]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":13,"time":"Wed 23 January 2008 10:53 AM","content":"If abortion is truly so abhorrent to you that you would be willing to condemn another to death, then that&apos;s very serious.  Especially when you can never, never walk in their shoes.  You can just look smugly and safely from the sidelines while you judge and condemn.  How does it feel to sit in the catbird&apos;s seat?  If you truly cared that much about it, then it looks as if you would place some importance on taking preventative action, and no sacrifice would be too small to stop this. ","user_id":"OrangeCat97","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":14,"time":"Wed 23 January 2008 11:59 AM","content":"Dumb idea, and it would never happen. It was never suggested in the past when it WAS illegal.","user_id":"boughtwaprice","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":15,"time":"Wed 23 January 2008 12:07 PM","content":"REPLYING TO LRS51st WHO SAID: <u>\" Since Abortions would be illegal... doesn&apos;t the one who COMMITS the abortion get punished....  So Abortionists would get the penalty.  Also, given that most abortion attempts by non-qualified personel tend to result in scarring, permanent injury, sterility or death.... do we really HAVE to worry about punishing the woman...  I think being rendered sterile is a pretty stiff sentence....  Much as I hate to say it.... better legal, safe and unnecessary, than the opposite.  Don&apos;t like it, but I&apos;ll just have to get over it.  I can&apos;t get pregnant.\"</u>   You are absolutely correct.  I would hate to see this country go back to the dark days of \"back alley\" abortionists. ","user_id":"PUFFBOY","fromReply":[],"toReply":[3]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":16,"time":"Wed 23 January 2008 12:14 PM","content":"Well, the pro-life argument goes that human life begins at conception. And, that just because a fetus does not speak and cannot protect itself, it is still a human life and should be afforded equal protection to other human life. So, lifeimprisonment or execution for abortion is logical from a pro-life standpoint, imho.  Further, if prolifers cannot stomach such stiff penalties for abortion, then why not? Dont they believe their own arguments? ","user_id":"torkel","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":17,"time":"Wed 23 January 2008 12:21 PM","content":"REPLYING TO rm444 WHO SAID: <u>\" What kind of question is this? Roe v Wade will not be overturned.Get over it. If you dont want an abortion, dont get one. If you do,you dont have to answer to anyone but yourself and your God, if you believe in such things.\"</u>   This girl I know used to say; \"If rich white men could get pregnant, not only would abortion be legal... it would be tax deductable .  How right she was. ","user_id":"WhoFreak","fromReply":[18],"toReply":[4,12]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":18,"time":"Wed 23 January 2008 01:04 PM","content":"REPLYING TO WhoFreak WHO SAID: <u>\"   This girl I know used to say; \"If rich white men could get pregnant, not only would abortion be legal... it would be tax deductable .   Had a few girlfriends like this...  They are amusing....        How right she was.   Sounds more LEFT to me...      \"</u>   Who is this Freak?  WhoFreak.  Who freak?  You freak.  No, WhoFreak.  Right... You freak.  Never mind....      ","user_id":"LRS51st","fromReply":[],"toReply":[17]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":19,"time":"Wed 23 January 2008 01:42 PM","content":"If someone kills a pregnant woman, he can also be charged with killing the unborn child.  whatever the penalty is for that, it should probably be the same if abortion was made illegal. This would go for the Doctor.  If someone contracts out, and has their spouse killed, the same charge that would be brought against them should be the same for the mother if abortion was made illegal.","user_id":"Tomcatt","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":20,"time":"Wed 23 January 2008 01:51 PM","content":"Not only the death penality, but certainly all women should be denied the vote as well. They should be locked up at home by any self respecting father or husband and considered \"chattel\" along with a mans dog, house or property. It&apos;s all these \"uppety\" women that are the cause for social unrest anyway. they&apos;re just baby machines to insure the continuance of the race and to provide for mans pleasure. they have no \"rights\" after all to anything and the state or men should always determine what they are allowed to do with their bodies. After all, we OWN them don&apos;t we? God DID make them from OUR rib to keep us amused and satisfy our sexual desires, wash our clothers and keep the house clean didn&apos;t he?  OOPS..sorry,wrong century... ","user_id":"alcyone","fromReply":[25],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":21,"time":"Wed 23 January 2008 01:54 PM","content":"No,  But I can promise you if my child&apos;s life was in danger or even if she felt that an abortion was the right thing to do - if someone got in her way they would get the death penalty!  I would make damn sure she got the abortion.  Get over it folks, even if abortion is criminalized again in this country, there will always be abortion.    The murderers are the ones that want to criminalize it again and make abortion go underground and back to the CoatHangers!  Frisco ","user_id":"FriscoLady01","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":22,"time":"Wed 23 January 2008 01:56 PM","content":"You want an abortion, get it, and then live with your decision to murder an innocent.  My wife had one prior to our marriage 35 years ago and it is her worst regret and still cries about it.  God will not let you live it down...","user_id":"Kegler300","fromReply":[27],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":23,"time":"Wed 23 January 2008 02:04 PM","content":"and the millions of women who don&apos;t regret it??  it cuts both ways.... ","user_id":"scottrj50","fromReply":[28],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":24,"time":"Wed 23 January 2008 02:16 PM","content":"REPLYING TO Fightdirector WHO SAID: <u>\" Actually, I agree with you.   And one of the reasons it will not become illegal again is that no one (or practically no one) can envision a criminal punishment for a woman who gets an abortion.\"</u>   It would hard to overturn because the abortionists stand to loose BILLIONS, pure and simple.  Those slimey baby killing docs might actually have to SAVE lives, rather than take them! ","user_id":"navy8086","fromReply":[35],"toReply":[1,5,8]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":25,"time":"Wed 23 January 2008 02:21 PM","content":"REPLYING TO alcyone WHO SAID: <u>\" Not only the death penality, but certainly all women should be denied the vote as well. They should be locked up at home by any self respecting father or husband and considered \"chattel\" along with a mans dog, house or property. It&apos;s all these \"uppety\" women that are the cause for social unrest anyway. they&apos;re just baby machines to insure the continuance of the race and to provide for mans pleasure. they have no \"rights\" after all to anything and the state or men should always determine what they are allowed to do with their bodies. After all, we OWN them don&apos;t we? God DID make them from OUR rib to keep us amused and satisfy our sexual desires, wash our clothers and keep the house clean didn&apos;t he?   (CRASSLY edited for the sake of brevity) \"</u>                 But what does your opinion on women have to do with abortion?  Oh, you weren&apos;t serious?            Smiley for the humor impaired... ","user_id":"LRS51st","fromReply":[],"toReply":[20]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":26,"time":"Wed 23 January 2008 02:22 PM","content":"Save the babies...but if the fathers don&apos;t pay for the kid till he/she is 18...Cut their Johnsons off...Run that by the limpy conservative viagra gang sitting on the supreme court?    ","user_id":"scottrj50","fromReply":[28],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":27,"time":"Wed 23 January 2008 02:23 PM","content":"REPLYING TO Kegler300 WHO SAID: <u>\" You want an abortion, get it, and then live with your decision to murder an innocent.  My wife had one prior to our marriage 35 years ago and it is her worst regret and still cries about it.  God will not let you live it down...\"</u>   You know what, I lost a child she was 9 months old and died on my 17th birthday.  That is what I cannot deal with!  I am 55 years old this September and I still cry for her on that day and many others it took 15 years for my family to get me to even acknowledge that day is my birthday!  What I could not live with as well is knowing that if my other two daughters were pregnant, their life was in danger if they had the child and could not obtain an  abortion because of some stupid law - well that is murder!  Frisco ","user_id":"FriscoLady01","fromReply":[],"toReply":[22]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":28,"time":"Wed 23 January 2008 02:27 PM","content":"REPLYING TO scottrj50 WHO SAID: <u>\" Save the babies...but if the fathers don&apos;t pay for the kid till he/she is 18...Cut their Johnsons off...Run that by the limpy conservative viagra gang sitting on the supreme court?   \"</u>   Now scotty, if a woman can decide NOT to be a mother, then a man can decide not to be a father....    OK, so I can&apos;t keep a straight face on that one...    Gee, Scott, you said something I agree with.... You knock her up... you are responsible for the outcome....  I like that.  Gene test all prisoners and welfare receipients... then truncate their checks for child support...  That would work almost as well as the old Johnson sliceing....     /2  Only HALF joking.... ","user_id":"LRS51st","fromReply":[],"toReply":[23,26]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":29,"time":"Wed 23 January 2008 02:28 PM","content":"Once Roe v. Wade is overturned it will be up to the states to determine if they will continue to allow abortions and it will be up to them to if the woman should be punished and how be she should be punished. Maybe probation for the first time will be an option.   Most certainly the abortionist, if they are breaking the state&apos;s law should be punished. Prison time, loss of license if they have one, heavy fines, confiscating of property. ","user_id":"Opfor6","fromReply":[51,53],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":30,"time":"Wed 23 January 2008 02:38 PM","content":"Well once ole Fred Thompson gets into the White House he&apos;ll get it overturned.After all the country is sooooooooooooo behind him    ","user_id":"scottrj50","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":31,"time":"Wed 23 January 2008 02:41 PM","content":"Gee Kegler300, sorry to hear that your wife still cries. God doesn&apos;t let you forget, true, but God forgives as well. A sense of humor helps, you gotta laugh, it&apos;s called survival. But those are just my beliefs.    ","user_id":"beatch71","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":32,"time":"Wed 23 January 2008 02:43 PM","content":"My wife and I raised our five children and have a hard time reasoning that we could even envision not having any one of them.  Different people with different circumstances and different intellect and moral upbringing have different opinions about the life of a fetus.  I feel sorry for them.....they miss so much.  Many live with terrible guilt.  Some are too numb to know any different. ","user_id":"pken","fromReply":[56],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":33,"time":"Wed 23 January 2008 02:47 PM","content":"Abortions will never be illegal. It&apos;s a form of population control. Also, some people are not fit to have kids. If they don&apos;t want them, let them be able to get rid of them. Better off for the kid. I&apos;m sure when a kid is aborted, it&apos;s life and conscious simply gets transfered by God to another womans belly anyway ","user_id":"FortesFortunaJuvat","fromReply":[48],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":34,"time":"Wed 23 January 2008 03:14 PM","content":"For all of you that the say the \"support abortions\",  do you really KNOW what you are actually supporting. Here, this link will tell you clinically with out the preaching ....    Abortion Methods   AND for you libs that think Gitmo is torture, consider this .....    Unborn Babies Feel Pain   You&apos;ll note there are medical / scientific refernces for each web site. ","user_id":"navy8086","fromReply":[35],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":35,"time":"Wed 23 January 2008 03:21 PM","content":"REPLYING TO navy8086 WHO SAID: <u>\" For all of you that the say the \"support abortions\",  do you really KNOW what you are actually supporting. Here, this link will tell you clinically with out the preaching ....    Abortion Methods   AND for you libs that think Gitmo is torture, consider this .....    Unborn Babies Feel Pain   You&apos;ll note there are medical / scientific refernces for each web site.\"</u>   We know what we&apos;re supporting ","user_id":"FortesFortunaJuvat","fromReply":[48],"toReply":[24,34]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":36,"time":"Wed 23 January 2008 03:23 PM","content":"   The right to have a choice.","user_id":"rm444","fromReply":[39,54],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":37,"time":"Wed 23 January 2008 03:31 PM","content":"Here in North Carolina if the baby is not breathing on its own it is not a human life.  So no punishment for the abortion.  Of course ever since that Marine Killed that female Marine a few weeks ago and the news media found out that he could not be charged for murder of the baby the Southern Baptist are now storming the halls of justice to get this law over turned. ","user_id":"Duster6","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":38,"time":"Wed 23 January 2008 03:55 PM","content":"... A well-written article that you may find an interesting read as it does include Mother Teresa and Hillary Clinton.    A small, small voice... ","user_id":"aggie_swife","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":39,"time":"Wed 23 January 2008 05:45 PM","content":"REPLYING TO rm444 WHO SAID: <u>\"    The right to have a choice.\"</u>   Bingo!  What ever happened to the line of thought that a person should be free to do whatever they wished to their own body? Y&apos;all conservatives whine about a \"nanny state\" but restricting or outlawing abortion supports just that - telling another what they can or cannot do to their own body, much like Libs saying you can&apos;t smoke or drink or get tattoos. ","user_id":"PhoenixDark","fromReply":[42,43],"toReply":[4,12,36]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":40,"time":"Wed 23 January 2008 05:57 PM","content":" While there is potential for harm to others from my smoking and drinking, you are telling me what I can do to my myself.  If life begins at conception, then the choice the mother is making does not just involve her body.  BTW...I&apos;m pro-choice ","user_id":"PSimon572","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":41,"time":"Wed 23 January 2008 06:01 PM","content":"why does ones personal belief have ANYTHING to do with this?we are talking about a LAW which, in our country is not directly connected to religion. SO forget religion and look at the facts. Viability (life can be sustained utside the womb) of a fetus starts at like 6 or 7 months  in extreme cases with the odds improving with time. so at 6 months yes it is a human life. Scientificaly anytime before that, it is not a human, only what could have been one..thats why it is called a FETUS, not a baby. Most abortion providers DO NOT do abortions past week 20 to week 22. Now if we make abortion illegal, will that stop the problem? NO and we all know this, it will only push desperate females to dangerous lenghts. Putting MORE lifes in danger. At least right now they are preformed in a safe clinical enviroment by trained pros. thirdly, you will find \"medical experts\" on both sides of this fight so really they are not really valid to the argument. ","user_id":"marineJacksonsgirl","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":42,"time":"Wed 23 January 2008 06:11 PM","content":"REPLYING TO PhoenixDark WHO SAID: <u>\"   Bingo!  What ever happened to the line of thought that a person should be free to do whatever they wished to their own body? Y&apos;all conservatives whine about a \"nanny state\" but restricting or outlawing abortion supports just that - telling another what they can or cannot do to their own body, much like Libs saying you can&apos;t smoke or drink or get tattoos.\"</u>  From what I&apos;ve seen, prohibiting tattoos has been a conservative measure, keeping with laws derived from religious traditions.  One of the problems with defining a fetus as a life separate from that of the woman are the medical facts that not all fertilized eggs implant, not all implanted eggs survive to the point of viability, a woman may not be aware of her condition, and one cannot remove a fetus from a woman until it is viable, without ending or at least endangering its life. If a fetus is going to be granted all or even most of the rights that an infant would possess, you&apos;d find the state micromanaging the lives of women between the ages of 14 and 60. For folk who aren&apos;t interested in governmental interference, it would behoove you to remember that. ","user_id":"sweetsuds","fromReply":[],"toReply":[39]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":43,"time":"Wed 23 January 2008 06:11 PM","content":"REPLYING TO PhoenixDark WHO SAID: <u>\"   Bingo!  What ever happened to the line of thought that a person should be free to do whatever they wished to their own body? Y&apos;all conservatives whine about a \"nanny state\" but restricting or outlawing abortion supports just that - telling another what they can or cannot do to their own body, much like Libs saying you can&apos;t smoke or drink or get tattoos.\"</u>   And by that logic destroying one&apos;s own body....?  castration   drugs, impurities   assisted suicide   After all, it is your own body, right?   But what about the baby&apos;s freedom and rights?    Yet he or she gets no say.   ","user_id":"aggie_swife","fromReply":[],"toReply":[39]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":44,"time":"Wed 23 January 2008 06:19 PM","content":"AW, interesting toy- what age group is that supposed to be for? I can&apos;t imagine it would be appropriate for small children, as they are quite likely to swallow it, or try to. Most doll house babies have moveable joints so they can be dressed. ","user_id":"sweetsuds","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":45,"time":"Wed 23 January 2008 07:58 PM","content":"Time Magazine piece which everyone should find of interest.     (Perhaps positives on both sides of the issues)   Grassroots Abortion War     ","user_id":"aggie_swife","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":46,"time":"Wed 23 January 2008 08:21 PM","content":"You all advocating punishment for the doctors who perform abortions are aware that there are a great many legal, easily accessible abortifacients, right? ","user_id":"liberal90","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":47,"time":"Wed 23 January 2008 08:31 PM","content":"Ahhhhhhhh, the liberal fairy tale of \"right to privacy,\" the premise that abortion was ruled lawful under Roe vs Wade.  If you cannot stand up for those who have no voice, then you have lost your soul... I&apos;m sorry, but I think that society has an OBLIGATION to speak for those who cannot be heard.  \"My body... my choice\"... More liberal drivel.  As a man, if I have no say in whether my child lives or dies... then don&apos;t come looking for me when you want a check. ","user_id":"OldUSAFSniper","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":48,"time":"Wed 23 January 2008 11:15 PM","content":"REPLYING TO FortesFortunaJuvat WHO SAID: <u>\" Abortions will never be illegal. It&apos;s a form of population control. Also, some people are not fit to have kids. If they don&apos;t want them, let them be able to get rid of them. Better off for the kid. I&apos;m sure when a kid is aborted, it&apos;s life and conscious simply gets transfered by God to another womans belly anyway\"</u> Margaret Sanger loves you.  By the way, you don&apos;t return back the gifts God gave you. That is why suicide is a sin.   Comfort your self the best you can while you can. ","user_id":"Opfor6","fromReply":[51,53],"toReply":[9,33,35]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":49,"time":"Wed 23 January 2008 11:25 PM","content":"Maybe we can get this back on topic. I would really like to hear the answer&apos;s of the pro-life people on how a law against abortion should be punished and what this punishment will help in the matter of saving the unborn.   IMHO, abortion should be illegal, except from cases like rape, health issues, incest and such. Nevertheless, abortion should not be punished if performed after close monitoring and counseling and within the first 12 weeks of the pregnancy.   After all it is life, yes, but we do so much irresponsible stuff with this life (scientific) and yet we are trying to force women to carry out their pregnancy.   If men could get pregnant, the abortion issue would not be one. Also if men could get pregnant, they will have nothing but ONE child. After that, they would be \"cured\" and only have protected sex, no matter what...hmmmm...maybe that&apos;s not such a bad thought after all, but unfortunately it&apos;s impossible. ","user_id":"undercoversister","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":50,"time":"Wed 23 January 2008 11:47 PM","content":" Link please.  21 weeks        This picture of a 21-week fetus hand reaching up through an incision in its mother&apos;s uterus to grab the finger of the surgeon who had just performed a life-saving procedure...  The 21-week-old unborn baby is named Samuel Alexander Armas, and is being operated on by a surgeon named Joseph Bruner. The baby was diagnosed with spina bifida and would not survive if removed from the mother&apos;s womb.  a C-section removes the uterus and the doctor makes a small incision to operate on the baby.  During the surgery on little Samuel, the little guy reached his tiny, but fully developed, hand through the incision and firmly grasped the surgeon&apos;s finger. The photograph captures this amazing event with perfect clarity.  Here is a picture of Samuel at 6 1/2.        Samuel is 9 years old today. ","user_id":"Opfor6","fromReply":[51,53],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":51,"time":"Thu 24 January 2008 07:28 AM","content":"REPLYING TO Opfor6 WHO SAID: <u>\" Once Roe v. Wade is overturned it will be up to the states to determine if they will continue to allow abortions and it will be up to them to if the woman should be punished and how be she should be punished. Maybe probation for the first time will be an option.   Most certainly the abortionist, if they are breaking the state&apos;s law should be punished. Prison time, loss of license if they have one, heavy fines, confiscating of property.\"</u> Only the abortionist should go to prison?      Surely  the woman who voluntarily got the abortion is an accomplice to murder under the law  (if the laws on murder were expanded to include abortions). Why should she get probation?   If someone held you so you couldn&apos;t move while someone else shot you dead, would you want the shooter to be sent to prison and the one who assisted the shooter by holding you to make you a better target get probation or a slap on the wrist?   Face it, anti-abortion/pro-life people - if abortion is \"murder\" than the woman who voluntarily gets an abortion is a murderer - and needs to be criminally punished - not just the doctor who performs the medical procedure.   All the pictures of what goes on during some abortions and pictures of kids like little Samuel mean absolutely nothing in regard to the question I am presenting.  How should that child-murdering woman be punished?   For example, I posted this same original post on another Internet Forum and several posters suggested that the proper punishment for the woman would be irrevocable sterilization.    If you believe that abortion is murder, is sterilization an appropriate punishment for the woman who voluntarily gets an abortion  (assuming abortion becomes illegal)? ","user_id":"Fightdirector","fromReply":[],"toReply":[29,48,50]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":52,"time":"Thu 24 January 2008 08:33 AM","content":"How about \"Proctologists\"?  Should they go to jail too?  I feel so violated! ","user_id":"pken","fromReply":[56],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":53,"time":"Thu 24 January 2008 09:23 AM","content":"REPLYING TO Opfor6 WHO SAID: <u>\" Once Roe v. Wade is overturned  it will be up to the states to determine if they will continue to allow abortions and it will be up to them to if the woman should be punished and how be she should be punished.     The American Prospect:   quote:  In a meeting with the editorial board of the  Des Moines Register  last year,  [Presidential candidate Mike]  Huckabee sidestepped answering the question directly but strongly suggested  he thinks at least certain types of birth control pills should made illegal.  In his Renewal Project speech Monday night, on the eve of the anniversary of  Roe v. Wade , Huckabee made yet another inappropriate and insulting comparison, maintaining that  overturning Roe is \"not good enough,\"  and that  letting the states \"handle something that is a moral issue is the logic of the civil war.\" \"</u> So, can I gather you would not be supporting Mike Huckabee for President? He advocates taking the ability to decide the legality of abortion and the criminal penalties for abortion away from the states and making a \"one-size-fits-all\" federal law on abortion and the criminal penalties. ","user_id":"Fightdirector","fromReply":[],"toReply":[29,48,50]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":54,"time":"Thu 24 January 2008 09:55 AM","content":"REPLYING TO rm444 WHO SAID: <u>\" What kind of question is this? Roe v Wade will not be overturned.Get over it. If you don&apos;t want an abortion, don&apos;t get one. If you do,you don&apos;t have to answer to anyone but yourself and your God, if you believe in such things.\"</u>   It is the kind of question that will start having to get asked as soon as the current lineup of the Supremes gets the next abortion case and overturns Roe and sends it back to the states. Based on all previous writings, the five Catholics on the present Court are only delaying the inevitable to keep it a live issue in the 2008 election, but Roe is for all intents and purposes a dead letter. Elections have consequences. If you are concerned about what those consequences would be for you personally, contact your state legislatures, because that is where this sort of decision is going to get made.     ","user_id":"oldmole","fromReply":[],"toReply":[4,12,36]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":55,"time":"Thu 24 January 2008 10:13 AM","content":"I&apos;ll believe it when I see it.","user_id":"rm444","fromReply":[],"toReply":[]},{"topic":"abortion_as_rights_or_choices","thread_id":"409192893_6200039561001","post_id":56,"time":"Thu 24 January 2008 10:59 AM","content":"REPLYING TO pken WHO SAID: <u>\" How about \"Proctologists\"?  Should they go to jail too?  I feel so violated!\"</u>   Only because he put his left hand on your left shoulder...  And his right hand on your right shoulder...       In case anyone needed the clue. ","user_id":"LRS51st","fromReply":[],"toReply":[32,52]}],"id":"409192893_6200039561001"}]